[
    {
        "cluster_label": 2652,
        "task": "How to Cure Manure",
        "step": [
            "Choose a suitable area for the manure compost pile or bins.",
            "Build composting bins or create a manure pile.",
            "Add manure and other organic materials such as leaves, grass clippings, animal bedding, ash from a fireplace, and table scraps such as fruit, egg shells, and vegetables.",
            "Roll the curing manure pile weekly.",
            "Add water.",
            "Examine the compost to be sure the manure has cured sufficiently for use."
        ],
        "steps_predictions": [
            "choose_area area1",
            "build_bamboo_container bin",
            "add_materials grass_tinder npc",
            "roll_soap npc grass_tinder",
            "add-water water",
            "get_mixture npc grass_tinder"
        ],
        "goal_state": " ((not (is_injured npc)))"
    },
    {
        "cluster_label": 2652,
        "task": "How to Compost Fish Remains",
        "step": [
            "Determine if there is a commercial composting operation available in your area.",
            "Compost the fish remains using an underground compost setup.",
            "Add the fish remains to an enclosed composter."
        ],
        "steps_predictions": [
            "determine if there is a commercial composting operation available in your area",
            "compost_fish npc",
            "add_fish npc spear fish"
        ],
        "goal_state": " ((inventory npc fish) (cooked fish))"
    },
    {
        "cluster_label": 2652,
        "task": "How to Transport Compost Materials from Your Kitchen to Your Compost Bin",
        "step": [
            "Use a good kitchen scraps storage container.",
            "Keep the container in an easily accessible place to encourage its use.",
            "Make collection and carrying a cinch.",
            "Keep baking soda next to your kitchen compost bin.",
            "Consider having two kitchen scrap bins if you have a lot of trouble getting to the compost bin frequently."
        ],
        "steps_predictions": [
            "use_as_cleaning_container container1",
            "in_container container1",
            "make_collection npc basement",
            "keep-ingredients-in-container baking_soda",
            "get_to_compost_bin bin"
        ],
        "goal_state": " ((in_container container1) (served_rug rug1))"
    },
    {
        "cluster_label": 2652,
        "task": "How to Use Your Home Built Tumble Composter to Create Rich Compost",
        "step": [
            "Choose a warm sunny spot to put the tumbler.",
            "Save your vegetable kitchen scraps to add to the tumbler, avoid adding the seeds of vegetables (see tips).",
            "Adding grass clippings and other non-woody garden waste is essential (see tips).",
            "The contents of the composter need to be moist but not wet.",
            "When adding water, use well water or water that has allowed to sit overnight so chlorine can evaporate.",
            "Tumble your composter at least once a week.",
            "In a composter that is working well, the contents should feel warm to the touch.",
            "If your composter is smelly, add a handful of garden lime or dolomite.",
            "Don't overfill the tumbler - try to only fill 2/3's to 3/4's full at anytime.",
            "Depending on how well you balance the moisture level in the tumbler, you will get 2 or 3 loads of rich compost a season."
        ],
        "steps_predictions": [
            "choose_spot tumblers",
            "save_shelter npc",
            "add-edge grass clippings and other non-woody garden waste",
            "get_wicks_used npc",
            "add_water npc water",
            "tumble-and-stabilize-composter you container",
            "initiate_composter npc",
            "add-lemon water npc",
            "fill_tumblers user1 tumbler1",
            "balance_water npc water pot"
        ],
        "goal_state": " ((selected_area area1) (knowledge npc))"
    },
    {
        "cluster_label": 2652,
        "task": "How to Use Seaweed in the Garden",
        "step": [
            "Collect the seaweed from your local beach or waterway.",
            "When you get home, be sure to wash sand and beach debris off the seaweed for the sand and beach debris is very alkaline.",
            "Choose what you want to use your seaweed for.",
            "If using it in the compost, be sure to mix it through with other materials really well.",
            "To make your seaweed into a liquid fertiliser, simply put all the compost in a barrel or any other sort of container.",
            "If you choose to use the seaweed directly on the garden, it's imperative that you do so correctly."
        ],
        "steps_predictions": [
            "collect_seaweed npc beach",
            "wash_sand npc beach",
            "choose_wailmer npc",
            "mix_materials alice container1",
            "put_sealed container npc",
            "use_sea_eed npc beach"
        ],
        "goal_state": " ((inventory npc seaweed))"
    },
    {
        "cluster_label": 2652,
        "task": "How to Use Your Compost",
        "step": [
            "Know when your compost is ready.",
            "Plant seeds.",
            "Plant seedlings.",
            "Nourish established houseplants.",
            "Spread it on your garden.",
            "Dig it into garden beds.",
            "Plant directly in it."
        ],
        "steps_predictions": [
            "know_when_to_add_compost npc",
            "plant_seeds new_plant fir1 container1",
            "plant_seeds fir1 container1",
            "nourish_established_houseplants npc",
            "gather_tinder npc path tinder",
            "dig_plant fir1 garden_bed1",
            "plant_plant fir1 container1"
        ],
        "goal_state": " ((knowledge npc container1))"
    },
    {
        "cluster_label": 2652,
        "task": "How to Use Aerated Compost Tea",
        "step": [
            "Use aerated compost tea quickly, preferably within 4 to 6 hours of removing it from the brewer, because it contains living organisms.",
            "Keep the compost tea cool, away from sunlight, and in an open container to prolong the useful life of the tea.",
            "Spray compost tea onto plants covering the leaves thoroughly with a fine mist.",
            "Pour compost tea directly into the soil.",
            "Use compost tea either full strength or in a 1:1 mix with equal amounts of tea and water for indoor and garden plants.",
            "Mix compost tea in a 1:3 part tea to water mixture to cover large areas including lawns.",
            "Use a soil drench and foliar spray application to minimize transplant shock immediately before and after moving plants.",
            "Spray compost tea on foliage at the first sign of symptoms of foliar diseases, such as black spot or powdery mildew."
        ],
        "steps_predictions": [
            "remove_teepee npc",
            "keep_teepee npc",
            "sliplargerbamboo_container leaves",
            "mix_teepee npc pot",
            "composter_teepee npc",
            "mix_teepee npc",
            "plant_plant fir1 soil1 garden_center",
            "drink_teepee npc"
        ],
        "goal_state": " ((in npc container))"
    },
    {
        "cluster_label": 2652,
        "task": "How to Compost",
        "step": [
            "Expect the compost to heat up.",
            "Decide whether to add slow-rotting items.",
            "Be cautious about adding weeds to your compost pile.",
            "Keep animal waste out of your compost bin.",
            "Don't add compostable containers to your home compost bin."
        ],
        "steps_predictions": [
            "heat_potatoes potato1 stove1",
            "add_slow_rotating_items items",
            "add_weeds_to_compost_purchaser grass_tinder",
            "keep_animal_wicks_out_of_compost_bin npc",
            "add_compostable_container container1 garden_center"
        ],
        "goal_state": " ((inventory potato1 container1))"
    }
]