[
    "Based on the provided task and steps, here are the PDDL actions for building a fire:\n\nTask: build_fire\n\nSteps:\n- create_shelter npc beach tinder\n- gather_tinder npc forest\n- start_fire npc tinder shelter\n\nDescriptions:\n- Create a shelter. Shelters are vital when it comes to keeping you safe and out of the elements. Shelters can also give you a place to rest and recover while you consider your next moves. There are many different types of shelters you can build. The natural material found on the island will dictate what kind of shelter you can create. As an example, you may try to create a simple lean-to shelter, using these steps:\n- Tinder is essential for starting a fire. Gather dry leaves, small twigs, and other easily combustible materials from the forest.\n- Starting a fire requires tinder and a suitable location, such as a shelter, to ensure the fire is contained and useful.\n\nPDDL Actions:\n```lisp\n(:action create-shelter\n    :parameters (?npc - person ?location - place ?material - item)\n    :precondition (and\n                    (at ?npc ?location)\n                    (material_available ?material ?location)\n                    (not (shelter_built ?location))\n                   )\n    :effect (shelter_built ?location)\n)\n\n(:action gather-tinder\n    :parameters (?npc - person ?location - place ?material - item)\n    :precondition (and\n                    (at ?npc ?location)\n                    (material_available ?material ?location)\n                    (not (tinder_collected ?npc))\n                   )\n    :effect (tinder_collected ?npc)\n)\n\n(:action start-fire\n    :parameters (?npc - person ?material - item ?location - place)\n    :precondition (and\n                    (tinder_collected ?npc)\n                    (shelter_built ?location)\n                    (at ?npc ?location)\n                    (not (fire_started ?location))\n                   )\n    :effect (fire_started ?location)\n)\n```\n\nExplanation:\n1. **create-shelter**: This action involves the NPC creating a shelter at a specified location using the available material (e.g., tinder). The precondition checks if the NPC is at the location, the material is available, and a shelter has not already been built. The effect is that a shelter is built at the location.\n2. **gather-tinder**: This action involves the NPC gathering tinder from a specified location (e.g., forest). The precondition checks if the NPC is at the location, the material (tinder) is available, and the NPC has not yet collected tinder. The effect is that the NPC has collected tinder.\n3. **start-fire**: This action involves the NPC starting a fire at a specified location (e.g., shelter) using the collected tinder. The precondition checks if the NPC has collected tinder, a shelter has been built at the location, the NPC is at the location, and a fire has not already been started. The effect is that a fire is started at the location.",
    "Sure, let's create the PDDL actions based on the provided task and steps.\n\nTask: find_water\n\nSteps:\n- get_water npc river water\n\nDescriptions:\n- Scavenge anything you can. Before you head to shore, it can be a good idea to gather up any supplies or materials near you. There may be useful items floating on the water's surface that will help you survive and await rescue. Try to look for anything you can use before heading to shore.\n\nPDDL Actions:\n\n```pddl\n;; Action1: get_water\n(:action get_water\n    :parameters (?npc - npc ?r - river ?w - water)\n    :precondition (and\n                    (at ?npc ?r)\n                    (water-available ?r))\n    :effect (and\n              (has-water ?npc)\n              (not (water-available ?r))\n             )\n  )\n```\n\nExplanation:\n- **Action Name:** get_water\n- **Parameters:** ?npc (the non-player character), ?r (the river), ?w (the water)\n- **Preconditions:** The NPC must be at the river, and water must be available in the river.\n- **Effects:** The NPC will have water, and the water will no longer be available in the river.\n\nThis action captures the essence of the task \"find_water\" by specifying the necessary conditions and effects related to obtaining water from a river.",
    "To generate PDDL actions for the task \"make_smoke_signal,\" we need to focus on the relevant steps and descriptions that contribute to creating a smoke signal. Some steps provided may not directly relate to the task and can be adjusted or omitted as needed. Below is the PDDL action generation based on the provided task and steps:\n\n### PDDL Actions for \"make_smoke_signal\"\n\n#### Step 1: Wet Tinder\nThis step seems counterintuitive for creating a smoke signal, as wetting tinder would typically prevent it from burning. However, if the context is to create a specific type of smoke or to prevent it from catching fire too quickly, we can proceed with the action.\n\n```pddl\n(:action wet_tinder\n    :parameters (?npc - character ?t - tinder)\n    :precondition (and\n                    (at ?npc ?t)\n                    (dry ?t))\n    :effect (and\n              (wet ?t)\n              (not (dry ?t))\n             )\n)\n```\n\n#### Step 2: Put Object in Receptacle\nThis step does not directly relate to making a smoke signal. We can modify it to involve placing the tinder in a fire pit or similar receptacle for creating smoke.\n\n```pddl\n(:action place_tinder_in_firepit\n    :parameters (?agent - character ?t - tinder ?fp - firepit)\n    :precondition (and\n                    (at ?agent ?t)\n                    (at ?agent ?fp)\n                    (wet ?t))\n    :effect (and\n              (in ?t ?fp)\n              (ready-to-burn ?t)\n             )\n)\n```\n\n#### Step 3: Create Shelter\nCreating a shelter is not directly related to making a smoke signal, but it could be part of a survival task. We'll focus on the smoke signal task and omit this step for now.\n\n#### Step 4: Swim\nSwimming is not directly related to making a smoke signal. We will omit this step unless it can be tied into the overall task in a meaningful way.\n\n### Additional Action: Ignite Tinder\nTo complete the task of making a smoke signal, an action to ignite the tinder is necessary.\n\n```pddl\n(:action ignite_tinder\n    :parameters (?npc - character ?t - tinder ?fp - firepit)\n    :precondition (and\n                    (in ?t ?fp)\n                    (ready-to-burn ?t))\n    :effect (and\n              (burning ?t)\n              (smoke ?fp)\n             )\n)\n```\n\nThese actions focus on the core task of making a smoke signal, adjusting irrelevant steps to fit the context where possible."
]