[
    "Sure, let's generate the PDDL actions for the task \"build_raft\" based on the provided steps and descriptions.\n\nTask: build_raft\n\nSteps:\n- create_raft npc beach raft_draft\n\nDescriptions:\n- Create a rescue signal. If you hope to be rescued, it's a good idea to leave rescuers with a signal. The signal you create will help search parties find your location and get you home more quickly than you would otherwise. You might try making some of these rescue signals to make you more visible:\n\nPDDL Actions:\n```lisp\n;; Action 1: Create Raft Draft\n(:action create_raft\n    :parameters (?npc - person ?beach - location ?raft_draft - raft)\n    :precondition (and\n                    (at ?npc ?beach)\n                    (materials-available ?beach))\n    :effect (and\n              (raft-draft ?raft_draft)\n              (raft-draft-created ?npc ?raft_draft)\n             )\n  )\n\n;; Action 2: Create Rescue Signal\n(:action create_rescue_signal\n    :parameters (?npc - person ?beach - location ?signal - signal)\n    :precondition (and\n                    (at ?npc ?beach)\n                    (signal-materials-available ?beach))\n    :effect (and\n              (rescue-signal ?signal)\n              (signal-created ?npc ?signal)\n             )\n  )\n```\n\nExplanation:\n1. **create_raft**: This action involves creating a raft draft. The preconditions ensure that the person (npc) is at the beach and that the necessary materials are available. The effects indicate that a raft draft is created and associated with the person who created it.\n2. **create_rescue_signal**: This action involves creating a rescue signal. The preconditions ensure that the person (npc) is at the beach and that the necessary materials for the signal are available. The effects indicate that a rescue signal is created and associated with the person who created it.\n\nThese actions should cover the steps and descriptions provided for the task \"build_raft.\"",
    "To generate PDDL actions for the task \"create_shelter,\" I will follow the given instructions and example format. Since there's only one step provided, I'll create a PDDL action for it. The step involves putting an object (pencil1) into a receptacle by an agent (agent1). However, since the task is \"create_shelter,\" I'll assume that this action is part of organizing materials for the shelter.\n\nHere is the PDDL action:\n\n```lisp\n;; Action: put_object_in_receptacle\n(:action put_object_in_receptacle\n    :parameters (?a - agent ?o - object ?r - receptacle)\n    :precondition (and\n                    (holding ?a ?o)\n                    (empty ?r)\n                  )\n    :effect (and\n              (not (holding ?a ?o))\n              (in_receptacle ?o ?r)\n              (not (empty ?r))\n            )\n)\n```\n\n### Explanation:\n- **Action Name**: `put_object_in_receptacle` - This name describes the action of placing an object into a receptacle.\n- **Parameters**: \n  - `?a` - agent (e.g., agent1)\n  - `?o` - object (e.g., pencil1)\n  - `?r` - receptacle (a general placeholder for where the object is placed)\n- **Preconditions**: \n  - `(holding ?a ?o)` - The agent must be holding the object.\n  - `(empty ?r)` - The receptacle must be empty to receive the object.\n- **Effects**: \n  - `(not (holding ?a ?o))` - The agent no longer holds the object after placing it.\n  - `(in_receptacle ?o ?r)` - The object is now in the receptacle.\n  - `(not (empty ?r))` - The receptacle is no longer empty after the object is placed inside.\n\nThis action assumes that organizing materials is a step towards shelter creation. Further steps would involve actions like assembling the shelter, securing materials, etc., which could be added with more detailed task steps."
]