[
    {
        "title": "How to Write a Reading Log",
        "steps": [
            "Purchase an attractive journal.",
            "Keep the log near your favorite reading spot.",
            "Read actively and widely.",
            "Read slowly and carefully.",
            "Write down the bibliographic information for everything you read.",
            "Include the dates of when you read.",
            "Write down page numbers of your favorite passages.",
            "Take notes while you read.",
            "Reflect on the book once it's complete.",
            "Reread your personal reading journal."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Make a Nature Journal",
        "steps": [
            "Decide what kind of nature journal you'd like to make.",
            "Make or buy a suitable journal of you choice.",
            "Get any other equipment you'll need.",
            "Dedicate time to journaling.",
            "Observe the world around you.",
            "Do your writing on location.",
            "Begin each entry with the location, date, and time.",
            "Record your observations with drawings or paintings.",
            "Write about what you observe.",
            "Learn more about what you've seen.",
            "Revisit your past entries."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Write a Mermaid Journal",
        "steps": [
            "Buy or make a journal/notebook.",
            "Start writing.",
            "Write a section of facts about being a mermaid.",
            "Write about the advantages and disadvantages of being a mermaid.",
            "Write about the ocean or another body of water.",
            "Write about your everyday life.",
            "Learn about mermaids.",
            "Remember to keep your journal safe from prying eyes."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Write Reflectively",
        "steps": [
            "Keep a journal either in a notebook or on your computer.",
            "Set aside a few minutes to write every day or once a week.",
            "Journal during transition moments in your life to stay centered.",
            "Try writing reflectively to deal with anxiety and stress.",
            "Use your journal to reflect on things you are grateful for.",
            "Write in stream-of-consciousness to overcome writer’s block."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Find Journal Articles",
        "steps": [
            "Use digital full-text articles, when available, for the most convenient option.",
            "Check your local library catalog to see if it carries the journals you need.",
            "Ask at the library help desk if you need assistance finding journals or articles.",
            "See if interlibrary loan (ILL) is an option for hard-to-find journal articles."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Journal in Public",
        "steps": [
            "Bring your journal with you.",
            "Find somewhere comfortable to write.",
            "Just write!.",
            "Be calm about onlookers or questions.",
            "Avoid making a big deal out of it."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Write a Journal Entry",
        "steps": [
            "Organize your thoughts to make them coherent.",
            "Make sure you reach the required word count.",
            "Use proper grammar like you would in an essay.",
            "Proofread your journal entry and correct any mistakes."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Journal for Therapy",
        "steps": [
            "Journal what you feel.",
            "Evaluate your actions, your thoughts, and your emotions.",
            "Journal in conjunction with your therapy sessions.",
            "Don't be afraid to get creative.",
            "Go into detail.",
            "Give yourself writing prompts to stimulate your self-inspection.",
            "Think of your journal like a friend.",
            "Read through your journal regularly."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Keep a Summer Journal",
        "steps": [
            "Purchase a suitable journal that you can carry about with you.",
            "Start carrying the journal about with you.",
            "Keep a record of the day's weather.",
            "Take photos.",
            "Attach small paper or cloth mementos.",
            "Do WordPress of the things you enjoyed the most during summer months.",
            "Have friends contribute to your summer journal.",
            "Add a summer bucket list at the front of the journal.",
            "Use the journal as a writing prompt.",
            "Keep a note of your travels.",
            "Draw in your summer journal.",
            "Finish the summer journal at the end of summer."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Write a Novel Using Your Journal",
        "steps": [
            "Look for entries about traveling to a foreign country.",
            "Describe a certain place using notes from your journal.",
            "Include sensory details from your journal."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Make A Prayer Journal",
        "steps": [
            "Get a journal.",
            "Find a hiding spot.",
            "Write an entry.",
            "Go back and read.",
            "Consider listing the names of people you're thinking of for prayer, and why some especially need prayer, realizing that you know that you can write about interceding in prayer for the needs of and about people."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Bible Journal",
        "steps": [
            "Decide what you want to cover in your faith journal.",
            "Consider whether you'd like to follow a more structured approach to Bible journaling.",
            "Keep notes on anything that reading the Bible raises for you.",
            "Use imagery and visual prompts.",
            "Consider sharing the Bible journaling."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Write a Devotional",
        "steps": [
            "Study your Bible each day.",
            "Take a notebook with you everywhere you go.",
            "Keep your entries consistent.",
            "Choose a number of devotionals to coincide with a calendar.",
            "Proofread your devotionals carefully.",
            "Submit your collection to Christian publishers."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Keep a Spiritual Journal",
        "steps": [
            "Purchase a journal to write in.",
            "Set a time each day to sit and self reflect on your spiritual journey.",
            "Keep your spiritual journal with you at all times.",
            "Acknowledge your blessings.",
            "Set spiritual goals.",
            "Write down any prayers that inspire you.",
            "Review your journal entries at least once a month."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Make a Gardening Journal",
        "steps": [
            "Decide what purpose you want your gardening journal to fulfill.",
            "Choose a journal format that suits your purpose.",
            "Divide your garden journal into sections.",
            "Leave space in your new sections for non-text items such as seed samples, diagrams and pictures of your garden.",
            "Cover your gardening journal with a book cover or plastic lamination so that it can safely get wet and dirty.",
            "Begin entering information, such as description of a day's work or planting dates into the appropriate sections of the garden journal.",
            "Let your gardening journal evolve as the growing season goes on, adding new sections, including a second volume, inserting additional paper."
        ],
        "cluster_label": 1041
    },
    {
        "title": "How to Use an Art Journal",
        "steps": [
            "Choose a journal or sketchbook, or make one.",
            "Make the journal your own.",
            "Start putting stuff in it.",
            "Try new techniques in your journal.",
            "Think of something that happened during your day which made you happy or angry.",
            "Turn off the filters and the inner critic.",
            "Put your ideas on paper as soon as they form, or as soon as you can.",
            "Review your older entries occasionally."
        ],
        "cluster_label": 1041
    }
]