[
    {
        "title": "How to Do a Bleach Bath",
        "steps": [
            "Fill a bathtub with 40 US gal (150 L) of water.",
            "Mix in ⁄4–⁄2  c (59–118 ml) of chlorine bleach.",
            "Soak in the tub for up to 10 minutes.",
            "Rinse off in warm water.",
            "Moisturize your body with lotion after your bath.",
            "Take bleach baths up to 3 times a week."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Bleach Shorts",
        "steps": [
            "Consider embellishing your shorts further.",
            "Add some designs using fabric paint or fabric markers.",
            "Draw designs using bleach.",
            "Add some studs.",
            "Fray the bottom of the shorts.",
            "Distress the shorts."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Bleach Skin with Peroxide",
        "steps": [
            "Grate 2 tbsp (30 g) of mild bar soap into a plastic container.",
            "Add 2 US tbsp (30 mL) of 3% hydrogen peroxide to the container.",
            "Use a plastic spoon or wooden spatula to create a paste.",
            "Apply the paste to your dark skin patch using the spoon or spatula.",
            "Allow the paste to sit for 10 minutes.",
            "Rinse off the paste using warm water.",
            "Use the treatment as often as once a week until your skin lightens."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Bleach Your Hair",
        "steps": [
            "Start with unprocessed hair.",
            "Pre-condition your hair with a deep conditioner.",
            "Juice several lemons.",
            "Dilute the lemon juice.",
            "Pour the solution into a spray bottle.",
            "Spray your hair with lemon juice solution.",
            "Sit outside in bright sunshine.",
            "Wash your hair."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Bleach Cotton",
        "steps": [
            "Set your washer to the highest heat possible.",
            "Add detergent and bleach if your machine has a bleach dispenser.",
            "Add water first if your machine doesn’t have a bleach dispenser.",
            "Add bleach 5 minutes into the cycle.",
            "Add the clothing to the washer.",
            "Allow the washer to run normally.",
            "Finished."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Lighten Clothing with Bleach",
        "steps": [
            "Read the tag to determine if the fabric is safe to bleach.",
            "Spread the garment on an old towel in a well-ventilated space.",
            "Fill a spray bottle with bleach and water.",
            "Spritz the garment until it's as lightened as you like.",
            "Machine wash the clothes according to the care label."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Bleach a Shirt",
        "steps": [
            "Bring all necessary materials to your work area.",
            "Lay the shirt flat on the floor or another surface.",
            "Slide the rags or cardboard into the shirt to protect the back from being bleached.",
            "Choose the design that you want to bleach into the shirt.",
            "Apply the design to the shirt.",
            "Pour bleach into a glass container or measuring cup.",
            "Dip a folded-up rag or sponge into the bleach.",
            "Blot the shirt all around the design.",
            "Wait for the bleach to take effect.",
            "Peel the stencil or design off of the shirt.",
            "Remove the rags or cardboard and rinse the shirt in cold water.",
            "Dry the shirt accordingly."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Bleach Towels",
        "steps": [
            "Never mix bleach with other cleaning products.",
            "Wear rubber gloves to protect your hands when handling bleach.",
            "Mix bleach solutions outdoors or in a well-ventilated room.",
            "Choose a bleach product recommended for use in the laundry."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Dilute Bleach",
        "steps": [
            "Wear rubber gloves when working with bleach.",
            "Work in a well-ventilated room.",
            "Pour the bleach over a sink or tub.",
            "Use cold water.",
            "Avoid using undiluted bleach."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Bleach Linen",
        "steps": [
            "Let the sun do the work.",
            "Use non-bleach alternatives in your laundry.",
            "Heat and soak on the stove with salt and baking soda."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Use Bleach when Doing Your Laundry",
        "steps": [
            "Fill a bucket or sink with 1 gallon (3.8 L) of hot water.",
            "Mix 1 tablespoon (15 mL) of oxygen or chlorine bleach into the water.",
            "Add your usual washing detergent to treat stained items.",
            "Soak your laundry for up to 1 hour.",
            "Rinse the items under cold water."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Use Bleach in Your Washing Machine",
        "steps": [
            "Set the washing machine to a hot, long wash. Push the hot wash button and then select the long wash option.",
            "Add 1 quart (946 mL) of bleach into the machine.",
            "Pause the cycle to allow the bleach to soak in for 1 hour.",
            "Restart the machine to allow the cycle to finish."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Wash Hemp",
        "steps": [
            "Don't use chlorinated bleach on hemp.",
            "Avoid high-heat.",
            "Don't dry clean hemp."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Neutralize Bleach",
        "steps": [
            "Determine what neutralizing agent you need.",
            "Bleach your wood.",
            "Rinse the wood.",
            "Mix your neutralizer.",
            "Apply your neutralizing agent."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Solar Bleach Cloth Diapers",
        "steps": [
            "Wash the diapers.",
            "Lay the diapers out flat, with the stains facing up.",
            "Alternatively, line-dry the diapers or drape them over a drying rack.",
            "Choose a sunny day to achieve the best, most potent results.",
            "Spray lemon juice onto the worst stains.",
            "Bring the cloth diapers in after a few hours pass.",
            "Repeat the process for stubborn stains that do not come out after the first round of bleaching.",
            "Throw the diapers into the dryer for a few minutes."
        ],
        "cluster_label": 490
    },
    {
        "title": "How to Bleach Paper",
        "steps": [
            "Prepare an acetone wash in a glass casserole pan.",
            "Put on a pair of rubber gloves or prepare a set of metal tongs.",
            "Hold the ink-stained paper under the acetone for 3 minutes.",
            "Place the washed paper on a bed of paper towels.",
            "Let the paper completely air dry."
        ],
        "cluster_label": 490
    }
]