[
    {
        "title": "How to Do a Dead Sea Salt Wrap",
        "steps": [
            "Begin drinking water about an hour before your body wrap.",
            "Turn up the temperature in your bathroom, or another room you plan to sit while the wrap is on.",
            "Dissolve 2 to 3 tbsp.",
            "Consider adding the following ingredients to the wrap.",
            "Brush your skin with a natural bristled brush.",
            "Take a warm shower to open up your pores.",
            "Stir your ingredients again.",
            "Wring out the towels.",
            "Wrap a layer of cellophane over the towels.",
            "Cover your body with a thick blanket or robe to keep the wraps warm.",
            "Rinse off the salt wrap with cool or lukewarm water.",
            "Cover yourself with a layer of non-comedogenic moisturizer."
        ],
        "cluster_label": 793
    },
    {
        "title": "How to Make Fizzy Salts",
        "steps": [
            "Mix the Epsom salts, sea salt and baking soda together well.",
            "Add a few drops of food color for desired color.",
            "Add 1 tablespoon of skin safe fragrance oil.",
            "Add 1/2 cup of citric acid.",
            "Use a funnel to pour the fizzy salts mixture in a jar or container.",
            "Seal the jar or container."
        ],
        "cluster_label": 793
    },
    {
        "title": "How to Make Sandalwood Bath Salts",
        "steps": [
            "Assemble ingredients.",
            "Mix together dry ingredients in a ceramic bowl.",
            "Add the essential oils.",
            "Stir as you add the drops.",
            "Place mixture into a small jar and screw on the lid.",
            "Keep in a dry spot out of direct sunlight for 2 - 3 days to allow the oils to blend.",
            "Use bath salts."
        ],
        "cluster_label": 793
    },
    {
        "title": "How to Use Himalayan Salt Lamps",
        "steps": [
            "Purchase high quality Himalayan salt lamps.",
            "Get a big enough salt lamp.",
            "Watch out for copious sweating.",
            "Clean your lamp and check for build up.",
            "Use a Himalayan salt candle holder."
        ],
        "cluster_label": 793
    },
    {
        "title": "How to Make Colored Salt",
        "steps": [
            "Choose a chalk color that you wish to use.",
            "Cover the workspace with a large sheet of paper.",
            "Pour the salt onto the paper.",
            "Place the piece of chalk on its side, on the salt.",
            "Using the paper as a funnel, pour the chalk-colored salt into a resealable bag or a storage container.",
            "Done."
        ],
        "cluster_label": 793
    },
    {
        "title": "How to Salt‐Speckle Paper",
        "steps": [
            "Vary the grain size to get different effects.",
            "Add the salt immediately to the wet paint for a more wide-spread effect.",
            "Wait 1-2 minutes for the paint to dry for more concentrated speckles.",
            "Try adding salt to water to get bursts of color."
        ],
        "cluster_label": 793
    },
    {
        "title": "How to Color Sand",
        "steps": [
            "Purchase a bag of Epsom salt.",
            "Divide the salt into several zippered bags.",
            "Add 5 to 10 drops of liquid food coloring into each bag.",
            "Zip the bags close, then shake them.",
            "Add more food coloring, if desired.",
            "Open the bags and let the salt dry.",
            "Play with the sand, but don't let it get wet."
        ],
        "cluster_label": 793
    },
    {
        "title": "How to Make Lemon Salt",
        "steps": [
            "Measure 1 cup of lemon juice, and 2 tablespoons of salt together in a small bowl.",
            "Place the lemon juice and salt in a pan and boil.",
            "Scrape off the crust with a spoon.",
            "Place the crust in a clean bowl.",
            "Continue to boil.",
            "Keep the process going.",
            "Drain all of the juice from the crust.",
            "Put the crust, now dry, in a small container.",
            "Eat little by little, or save to put on top of flavorless crackers."
        ],
        "cluster_label": 793
    },
    {
        "title": "How to Prepare a Sea Salt Soak",
        "steps": [
            "Pour 453 g (1.9 cups) of fine grain sea salt into a bowl.",
            "Consider adding 15 to 30 drops of scented or essential oil to the sea salt.",
            "Mix the salts and oils thoroughly then store the mix in a glass container.",
            "Add 120 g (1/2 cup) of the salt soak to a warm bath and let it dissolve.",
            "Take a bath with the sea salt soak when you need to relax and unwind."
        ],
        "cluster_label": 793
    },
    {
        "title": "How to Make a Salt Dough Name Banner",
        "steps": [
            "Gather the ingredients for salt dough.",
            "Make the dough.",
            "Knead the dough.",
            "Divide the dough into pieces based on the letters in your name.",
            "Shape the dough into the letters of your name.",
            "Poke holes in the top of each letter.",
            "Decorate!.",
            "Bake the beads at 350 degrees for 30 minutes to an hour.",
            "Paint the letters and add any more decorations.",
            "String together all the letters."
        ],
        "cluster_label": 793
    },
    {
        "title": "How to Make Flavored Salt",
        "steps": [
            "Select a flavored liquid for your salt.",
            "Bring the liquid to a boil.",
            "Heat the liquid until it forms a reduction.",
            "Add the salt and dry the mixture."
        ],
        "cluster_label": 793
    },
    {
        "title": "How to Make a Water Colour Salt Painting",
        "steps": [
            "Set up your painting area.",
            "Wet your paper.",
            "Paint with watercolors.",
            "Sprinkle some salt over the still-wet painting.",
            "Let the painting dry.",
            "When the painting is dry, tip the paper up gently and shake the excess salt off.",
            "Finished!."
        ],
        "cluster_label": 793
    }
]