[
    {
        "title": "How to Plant a Plant",
        "steps": [
            "Store plants with exposed roots in a water-filled bucket.",
            "Water the plant an hour before transplanting it.",
            "Add water once a week to keep the soil moist.",
            "Use a dripping hose to water trees and large bushes.",
            "Pour a liquid fertilizer over flowers.",
            "Use a slow-release fertilizer on larger plants."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Transplant a Plant",
        "steps": [
            "Research the date when you should move your plant outside.",
            "Begin to harden the plant off 2 weeks before the transplanting date.",
            "Plan to transplant during the cool part of the day.",
            "Fill the planting bed with gardening soil.",
            "Dig a hole big enough to hold the plant's pot.",
            "Turn the pot upside down and slide the root ball out.",
            "Leave the plant in the pot if it's made from peat or paper.",
            "Loosen the root ball with your fingers, if needed.",
            "Place the root ball into the hole.",
            "Fill the space around the root ball with more soil and pat it down.",
            "Water the plant thoroughly."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Plant a Shrub",
        "steps": [
            "Keep the shrub in the container before planting.",
            "Remove the plant from the container.",
            "Prepare the roots.",
            "Situate the shrub in the hole.",
            "Replace dirt around the plant.",
            "Spread mulch around the shrub.",
            "Water the area."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Transplant Daffodils",
        "steps": [
            "Plant daffodil bulbs in a deep pot with good drainage.",
            "Use bulb compost or regular potting compost.",
            "Keep the pot in a cool, dark spot for the first few months.",
            "Fertilize potted daffodils with bone meal.",
            "Replant fresh bulbs each year.",
            "Transplant daffodils from a pot to the ground."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Plant Boxwood",
        "steps": [
            "Decide whether to plant boxwood in a garden or a pot.",
            "Choose the correct time to plant.",
            "Determine where to plant.",
            "Test your soil.",
            "Loosen the ball of roots on a new boxwood plant so they are mostly spread out.",
            "Dig a hole in the soil about as deep as the plant's height and as wide as the spread of the roots.",
            "Place the boxwood inside the hole and cover the roots with water and soil about 2 inches (5.08 cm) short of the top.",
            "Pour 2 inches (5.08 cm) of mulch into the remainder of the hole and pack it down.",
            "Water the boxwood once a week during warm months and much less often during cooler periods."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Plant Trees for a Reforestation Project",
        "steps": [
            "Contact your local extension office.",
            "Order numerous seedlings.",
            "Plan your planting time.",
            "Mow the reforested area with a tractor and a shredding attachment.",
            "Purchase a specialized planting tool such as a power auger, planting bar, dibble, or hoedad to dig the holes for the seedlings.",
            "Place the reforestation seedlings in a planting bag.",
            "Dig the hole for the seedling.",
            "Plant a seedling in the hole in an upright position with the roots straight down.",
            "Press the soil firmly around the roots of the seedling with the dibble or planting bar.",
            "Place seedling protectors around the newly planted trees."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Plant a Bare Root Tree",
        "steps": [
            "Carefully unpack the bare root tree from the container or material it came in.",
            "Set the tree into a bucket filled with water.",
            "Dig a hole slightly larger than the diameter and depth of the tree and soil width.",
            "Check to be sure there are no large weed roots in the hole you have dug.",
            "Plant the tree so that where the roots meet the base of the tree.",
            "Shovel the remaining dirt from the container.",
            "Build a water basin around the outside of the tree.",
            "Add a mulch area of a metre /a yard wide and 5 centimeter (2.0 in) deep around the tree base.",
            "Water the tree again and again.",
            "Stake large trees.",
            "Remove the stake after a year."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Grow Kumquat",
        "steps": [
            "Transplant trees in early spring or fall.",
            "Keep your kumquat in 6 hours of sunlight outside in the summer.",
            "Move your kumquat inside to a south-facing window in the winter.",
            "Water the potting mix so the soil is damp 1 in (2.5 cm) deep.",
            "Harvest the fruits when they are bright orange in the summer.",
            "Prune the growing stems after you harvest the fruit.",
            "Cut back the roots by 1 in (2.5 cm) each year.",
            "Use neem oil to prevent spider mites and other pests."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Graft a Tree",
        "steps": [
            "Choose your cultivar and your rootstock.",
            "Amputate your rootstock.",
            "Cleave your rootstock.",
            "Prepare the scions.",
            "Insert the scions into the rootstock.",
            "Seal the graft.",
            "Look after the graft."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Promote Root Growth",
        "steps": [
            "Apply a root stimulator when you plant the tree or shrub.",
            "Do a soil test to learn about the health of the soil around the plant.",
            "Adjust the pH of the soil so it's between 6 and 7.",
            "Spread fertilizer that's high in phosphorus or potassium.",
            "Water the plants with willow water to encourage root growth.",
            "Move potted plants to larger pots."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Graft Plants",
        "steps": [
            "Plant the rootstock plants in advance.",
            "Prepare to graft the plants in cool weather when the scion plant is budding.",
            "Make a T-shaped cut on the rootstock plant.",
            "Cut a healthy bud and attached wood from the scion plant.",
            "Insert the bud wood into the T cut.",
            "Tie the plants together.",
            "Wait for it to heal before removing the binding.",
            "Cut the rootstock branch some distance above the new bud.",
            "Once the bud wood has grown a few new leaves, remove the rest of the rootstock branch."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Plant",
        "steps": [
            "Choose the best location for your tree.",
            "Till the soil lightly with a pick or a shovel.",
            "Dig a hole in the area that is twice as wide as the root ball of your tree.",
            "Loosen the roots in preparation for the transplant.",
            "Pull the container away from the root ball until it is completely exposed.",
            "Look for roots that are circling.",
            "Place the root ball of the tree in your hole.",
            "Mix one part compost with three parts soil before you fill the hole around the tree.",
            "Fill in the area around the root ball with your mixture of compost and soil.",
            "Create a circular berm, or small mounded hill.",
            "Cover the area with a layer of mulch.",
            "Use stakes to support the tree.",
            "Water the area.",
            "Enjoy your gift to the earth!."
        ],
        "cluster_label": 412
    },
    {
        "title": "How to Remove a Tree",
        "steps": [
            "Water the soil surrounding the tree the day before you remove it.",
            "Remove the topsoil surrounding the top roots.",
            "Dig the roots out with a spade.",
            "Dig underneath the root ball and pull it out of the ground."
        ],
        "cluster_label": 412
    }
]