[
    "To merge the given action \"cook_food\" with the guidelines provided, we need to construct a universal action that can adapt to various cooking tasks. Here's the merged action:\n\n```pddl\n(:action cook\n  :parameters (?agent - entity ?location - place)\n  :precondition (and (at ?agent ?location) (not (task_completed ?agent ?location)))\n  :effect (task_completed ?agent ?location)\n)\n```\n\n### Explanation:\n- **Action Name**: `cook` - This action represents a general cooking task that can apply to various scenarios involving preparing food or any similar tasks.\n- **Parameters**: \n  - `?agent` - Represents any entity (e.g., person, robot) performing the cooking task.\n  - `?location` - Represents the place where the cooking or related task takes place (e.g., kitchen, campsite).\n- **Preconditions**: \n  - `(at ?agent ?location)` - The agent must be present at the specified location to carry out the task.\n  - `(not (task_completed ?agent ?location))` - The task should not have already been completed by the agent at the location.\n- **Effects**: \n  - `(task_completed ?agent ?location)` - After performing the action, it is established that the agent has completed the task at the location.\n\n### Rationale:\n1. **Generality**: The parameters `?agent` and `?location` are abstract, making the action adaptable to various entities and places.\n2. **State Change**: The precondition and effect clearly describe the transformation of the entity's state from not having completed the task to having completed it.\n3. **Simplicity**: The action is straightforward, focusing on essential preconditions and effects without redundant details.\n4. **Logical Consistency**: The action checks that the agent is at the location and that the task hasn't been completed before marking the task as completed. This logic is consistent and reasonable across different tasks.\n\nThis merged \"cook\" action maintains flexibility and simplicity while being applicable to a wide range of scenarios involving the completion of tasks by entities in specific locations."
]