[
    {
        "task": "how to make an egg, tomato and toast breakfast.",
        "steps": [
            "Assemble all of the ingredients",
            "For the eggs, beat the eggs in a bowl and add 1 tbsp of milk into the eggs and whisk again",
            "When the oil is hot enough, pour the egg mixture in with medium heat and start stirring the mixture with a wooden spoon",
            "Do not over-cook the eggs",
            "Chopped the tomatoes into small cubes about the size a little bigger than your thumbnail!",
            "To make the fresh fried tomatoes, heat a little oil in pan in low heat",
            "Put a pinch of salt and sugar in to enhance the flavors",
            "Now, we toast the bread",
            "Lay the bread next to the eggs and tomatoes and drizzle some olive over the dish",
            "Finished"
        ],
        "clap_step": [
            "1: Pour beaten eggs over veggies",
            "2: Beat one large egg in a cup or bowl"
        ]
    },
    {
        "task": "how to make spotted dick.",
        "steps": [
            "Mix the dry ingredients",
            "Add the butter",
            "Add the milk",
            "Prepare to steam",
            "Cook the spotted dick",
            "Serve"
        ],
        "clap_step": []
    },
    {
        "task": "how to apply a steak rub.",
        "steps": [
            "Choose a steak to grill",
            "Find a rub recipe from a cookbook or online",
            "Make the rub",
            "Apply the rub to the steak",
            "Let the steak rest",
            "Grill the steak",
            "Finished"
        ],
        "clap_step": []
    },
    {
        "task": "how to make a crown braid.",
        "steps": [
            "Let your hair fall to one side of your face",
            "Begin to braid your hair",
            "Follow this pattern all the way around",
            "Continue for as long as you have hair to incorporate",
            "Finish off your twisted crown braid"
        ],
        "clap_step": [
            "1: Start the braidi",
            "2: Braid hair correctly"
        ]
    },
    {
        "task": "how to braid string.",
        "steps": [
            "Cut 5 pieces of 32-inch (81-cm) length of string",
            "Knot your strings together",
            "Divide your string into 5 groups",
            "Weave the first string under and over the next 2 strings",
            "Weave the last string under and over the previous 2 strings",
            "Repeat the process until you get the length you want",
            "Tie the end of the braid into an overhand knot",
            "Peel the tape off"
        ],
        "clap_step": [
            "1: Thread string through the two holes",
            "2: Thread string through the two holes",
            "3: Thread string through the two holes",
            "4: Thread string through the two holes"
        ]
    },
    {
        "task": "how to goddess braid natural hair.",
        "steps": [
            "Start with blow-dried hair",
            "Part your hair in preparation for the crown braid",
            "Apply gel, edge control, or pomade to your part and hair",
            "Begin a regular braid to the right of the part",
            "Begin to Dutch braid your hair",
            "Dutch braid your hair until you reach the back-center part",
            "Finish off with a regular braid",
            "Repeat the process on the other side of your head",
            "Cross the braids across the back of your head and pin them"
        ],
        "clap_step": []
    },
    {
        "task": "how to create a time capsule.",
        "steps": [
            "Mark the container with the current date and the intended opening date",
            "Do something to remind yourself or others about the time capsule",
            "Make extra arrangements for a time capsule that will outlive you",
            "Seal the time capsule and store it",
            "Place a marker of some kind on the exact site of a buried capsule"
        ],
        "clap_step": [
            "1: Establish your space"
        ]
    },
    {
        "task": "how to create a memory cookbook.",
        "steps": [
            "Decide on who the memory cookbook will focus",
            "Set about gathering together the memorabilia",
            "Find photographs, anecdotes, quotes, and other relevant snippets to place into the memory cookbook",
            "Consider asking other members of your family or circle of friends for recipes and ideas",
            "Decide on the need for illustrations",
            "Choose your method of preparing and printing the cookbook",
            "Distribute the memory cookbook"
        ],
        "clap_step": [
            "1: Start with the right food"
        ]
    },
    {
        "task": "how to remove old nail polish.",
        "steps": [
            "Choose a nail polish you don't like very much",
            "Paint polish over one of your nails",
            "Use a paper towel to wipe it off after five seconds",
            "Repeat with remaining nails"
        ],
        "clap_step": [
            "1: Bend and remove the nail tips"
        ]
    },
    {
        "task": "how to remove nail polish without using remover.",
        "steps": [
            "Make a base coat with glue and water",
            "Apply and dry the glue base coat before putting on polish",
            "Apply nail polish",
            "Soak your nails when you're ready to remove your polish",
            "Peel off your old nail polish"
        ],
        "clap_step": [
            "1: Bend and remove the nail tips"
        ]
    },
    {
        "task": "how to free your child from lice.",
        "steps": [
            "Avoid sharing",
            "Ensure hair hygiene",
            "Teach your children steps to avoid lice",
            "Make sure your child's school or organization checks for lice",
            "Look for the telltale signs of a louse",
            "Check your child’s hair"
        ],
        "clap_step": []
    },
    {
        "task": "how to change your toddler's clothes without a tantrum.",
        "steps": [
            "Lay out any items and clothing that you need ahead of time",
            "Dress your child first thing in the morning",
            "Leave plenty of time to change your child",
            "Pick clothes that are comfortable and easy"
        ],
        "clap_step": [
            "1: Monitor young children's interaction with a ragdoll"
        ]
    },
    {
        "task": "how to start a book club at school.",
        "steps": [
            "Really think about if anyone at your school would join",
            "Contact a school administrator for permission, preferably the principal",
            "Find a teacher or parent to supervise",
            "Compose a list of books that you want to read",
            "Think of a time to meet",
            "Do you know what you'll actually be doing?",
            "Get some members!",
            "Establish some rules",
            "After the meeting, make sure that they know when the next one is"
        ],
        "clap_step": [
            "1: Start conversations with school-related topics"
        ]
    },
    {
        "task": "how to boil corned beef.",
        "steps": [
            "Make your corned beef into hash and get ready for some serious flavor",
            "Spice up your corned beef hash by making baked eggs in hash nests",
            "Get traditional by making a New England boiled dinner",
            "Make your corned beef into a pie",
            "Try something totally different by making Scotch eggs covered in corned beef"
        ],
        "clap_step": []
    },
    {
        "task": "how to dilute bleach.",
        "steps": [
            "Wear rubber gloves when working with bleach",
            "Work in a well-ventilated room",
            "Pour the bleach over a sink or tub",
            "Use cold water",
            "Avoid using undiluted bleach"
        ],
        "clap_step": [
            "1: Mix a two-parts water and one-part vinegar solution"
        ]
    },
    {
        "task": "how to wash hemp.",
        "steps": [
            "Don't use chlorinated bleach on hemp",
            "Avoid high-heat",
            "Don't dry clean hemp"
        ],
        "clap_step": []
    },
    {
        "task": "how to use bleach in your washing machine.",
        "steps": [
            "Set the washing machine to a hot, long wash",
            "Push the hot wash button and then select the long wash option",
            "Add 1 quart (946 mL) of bleach into the machine",
            "Pause the cycle to allow the bleach to soak in for 1 hour",
            "Restart the machine to allow the cycle to finish"
        ],
        "clap_step": [
            "1: Mix a two-parts water and one-part vinegar solution"
        ]
    },
    {
        "task": "how to write a novel using your journal.",
        "steps": [
            "Look for entries about traveling to a foreign country",
            "Describe a certain place using notes from your journal",
            "Include sensory details from your journal"
        ],
        "clap_step": [
            "1: Start journaling",
            "2: Write a journal"
        ]
    },
    {
        "task": "how to keep a summer journal.",
        "steps": [
            "Purchase a suitable journal that you can carry about with you",
            "Start carrying the journal about with you",
            "Keep a record of the day's weather",
            "Take photos",
            "Attach small paper or cloth mementos",
            "Do WordPress of the things you enjoyed the most during summer months",
            "Have friends contribute to your summer journal",
            "Add a summer bucket list at the front of the journal",
            "Use the journal as a writing prompt",
            "Keep a note of your travels",
            "Draw in your summer journal",
            "Finish the summer journal at the end of summer"
        ],
        "clap_step": [
            "1: Keep a journal",
            "2: Write a journal"
        ]
    },
    {
        "task": "how to make a nature journal.",
        "steps": [
            "Decide what kind of nature journal you'd like to make",
            "Make or buy a suitable journal of you choice",
            "Get any other equipment you'll need",
            "Dedicate time to journaling",
            "Observe the world around you",
            "Do your writing on location",
            "Begin each entry with the location, date, and time",
            "Record your observations with drawings or paintings",
            "Write about what you observe",
            "Learn more about what you've seen",
            "Revisit your past entries"
        ],
        "clap_step": []
    },
    {
        "task": "how to graft a tree.",
        "steps": [
            "Choose your cultivar and your rootstock",
            "Amputate your rootstock",
            "Cleave your rootstock",
            "Prepare the scions",
            "Insert the scions into the rootstock",
            "Seal the graft",
            "Look after the graft"
        ],
        "clap_step": []
    },
    {
        "task": "how to plant a plant.",
        "steps": [
            "Store plants with exposed roots in a water-filled bucket",
            "Water the plant an hour before transplanting it",
            "Add water once a week to keep the soil moist",
            "Use a dripping hose to water trees and large bushes",
            "Pour a liquid fertilizer over flowers",
            "Use a slow-release fertilizer on larger plants"
        ],
        "clap_step": []
    },
    {
        "task": "how to wax your armpits.",
        "steps": [
            "Examine your armpits in the mirror",
            "Remove excess wax with oil",
            "Clean the area"
        ],
        "clap_step": []
    },
    {
        "task": "how to get slime out of hair.",
        "steps": [
            "Remove as much slime as you can",
            "Put goggles on the person to protect their eyes",
            "Rub a mixture of 2/3 vinegar and 1/3 warm water into the hair",
            "Use conditioner to rinse out the remaining slime"
        ],
        "clap_step": []
    },
    {
        "task": "how to get wax out of hair.",
        "steps": [
            "Pour a small amount of oil into the palm of your hand",
            "Massage the oil into the wax",
            "Pull the excess wax free as it loosens",
            "Wash and condition your hair in hot water"
        ],
        "clap_step": []
    },
    {
        "task": "how to use aerated compost tea.",
        "steps": [
            "Use aerated compost tea quickly, preferably within 4 to 6 hours of removing it from the brewer, because it contains living organisms",
            "Keep the compost tea cool, away from sunlight, and in an open container to prolong the useful life of the tea",
            "Spray compost tea onto plants covering the leaves thoroughly with a fine mist",
            "Pour compost tea directly into the soil",
            "Use compost tea either full strength or in a 1:1 mix with equal amounts of tea and water for indoor and garden plants",
            "Mix compost tea in a 1:3 part tea to water mixture to cover large areas including lawns",
            "Use a soil drench and foliar spray application to minimize transplant shock immediately before and after moving plants",
            "Spray compost tea on foliage at the first sign of symptoms of foliar diseases, such as black spot or powdery mildew"
        ],
        "clap_step": []
    },
    {
        "task": "how to compost.",
        "steps": [
            "Expect the compost to heat up",
            "Decide whether to add slow-rotting items",
            "Be cautious about adding weeds to your compost pile",
            "Keep animal waste out of your compost bin",
            "Don't add compostable containers to your home compost bin"
        ],
        "clap_step": [
            "1: Recycle and compost"
        ]
    },
    {
        "task": "how to make the most from your old candles.",
        "steps": [
            "Obtain some old candles",
            "Find an old saucepan or something similar that can get wax on it",
            "Break up the old wax and stick a few pieces in the saucepan over low heat",
            "Stir the candles until they have melted",
            "Prepare the container for the wax while you are waiting for the candles to melt",
            "Pour",
            "Take the little bit of wax that you left in the saucepan and make sure that it is completely melted",
            "Pour the extra wax into the dip to make the dip fill in",
            "Let this little bit of wax completely harden",
            "Remember depending on what type of container you used, either light the candle directly in the container or you can slip it right out of the container",
            "Keep in mind that if you are having a hard time getting the candle out of the container, stick the container in the freezer for about five to ten minutes",
            "Decorate your new candle with glitter, sand, flowers or any other idea you might have to make your candle pretty",
            "Finished"
        ],
        "clap_step": []
    },
    {
        "task": "how to melt candles.",
        "steps": [
            "Use an electric stove if possible",
            "Set up a double boiler",
            "Fill the pan halfway with water and bring it to the boil",
            "Place the bowl with the wax in it into the pan",
            "Take the bowl with the melted wax from the pan"
        ],
        "clap_step": []
    },
    {
        "task": "how to create a secret candle stash.",
        "steps": [
            "Find a tall, thick candle, a sharp steak knife, or other medium sized knife, and drill with a thick bit, a lighter of any sort, and a sponge or other squishy item in a color relatively close to your candle, and of course, something to hide",
            "Use the drill to make some holes as far into the candle as possible, while staying far enough away from the edge of the candle to leave a strong outside wall",
            "Cut out the rest of the inside with the knife, using the holes from the drill to get the it inside",
            "Spark the lighter and hover the flame below the hole in the candle to melt the wax",
            "Cut the squishy object into a circle about one half inch bigger than the hole in the candle",
            "Use the hole to store whatever you want",
            "Close off the stash by stuffing the squishy item in the candle",
            "Place somewhere inconspicuous",
            "Enjoy your privacy!"
        ],
        "clap_step": []
    },
    {
        "task": "how to make fizzy salts.",
        "steps": [
            "Mix the Epsom salts, sea salt and baking soda together well",
            "Add a few drops of food color for desired color",
            "Add 1 tablespoon of skin safe fragrance oil",
            "Add 1/2 cup of citric acid",
            "Use a funnel to pour the fizzy salts mixture in a jar or container",
            "Seal the jar or container"
        ],
        "clap_step": []
    },
    {
        "task": "how to make colored salt.",
        "steps": [
            "Choose a chalk color that you wish to use",
            "Cover the workspace with a large sheet of paper",
            "Pour the salt onto the paper",
            "Place the piece of chalk on its side, on the salt",
            "Using the paper as a funnel, pour the chalk-colored salt into a resealable bag or a storage container",
            "Done"
        ],
        "clap_step": []
    },
    {
        "task": "how to celebrate the winter solstice.",
        "steps": [
            "Research the time of winter solstice, as well as the occurrences",
            "Understand the religious, magical and natural significance of winter solstice",
            "Decorate your home",
            "Make some solstice-themed traditional crafts, such as a Yule log",
            "Prepare a feast",
            "Go wassailing",
            "Stay up until sunrise",
            "Keep the flame"
        ],
        "clap_step": []
    },
    {
        "task": "how to visit the september 11th memorial museum.",
        "steps": [
            "Purchase tickets online ahead of your visit",
            "Spend some time paying your respects at the two reflecting pool memorials",
            "Enter the museum after passing a through security screening",
            "Explore the exhibits and displays on the basement level",
            "Proceed one level up to the main exhibition hall",
            "Visit the museum store on your way to the exit"
        ],
        "clap_step": []
    },
    {
        "task": "how to celebrate women's history month.",
        "steps": [
            "Look for women’s history events in your area",
            "Visit your local museum to check out a gallery exhibit",
            "Attend lectures about women in history or women’s issues",
            "Organize a women’s history event in your community"
        ],
        "clap_step": [
            "1: Plan your vacation activities with meeting women in mind"
        ]
    },
    {
        "task": "how to treat a ruptured ovarian cyst.",
        "steps": [
            "Go to your doctor or the emergency room",
            "Get a physical exam",
            "Test for a ruptured cyst"
        ],
        "clap_step": []
    },
    {
        "task": "how to know if you have a baker's cyst.",
        "steps": [
            "Understand that some health conditions can lead to the create of baker’s cysts",
            "Know that some knee injuries can increase your chances of developing these cysts",
            "Be aware that previous surgeries can predispose you to getting these cysts"
        ],
        "clap_step": []
    },
    {
        "task": "how to melt butter.",
        "steps": [
            "Know"
        ],
        "clap_step": [
            "Cut butter into pieces before softening",
            "Leave butter on the counter near the oven",
            "Soften butter more quickly by mashing or beating it",
            "Place a container of butter in a warm water bath",
            "Rapidly soften frozen butter by grating it"
        ]
    },
    {
        "task": "how to eat soft boiled eggs.",
        "steps": [
            "Coat the soft boiled eggs in the batter",
            "Deep-fry the battered soft boiled eggs",
            "Season the deep-fried soft boiled eggs"
        ],
        "clap_step": [
            "1: Beat one large egg in a cup or bowl"
        ]
    },
    {
        "task": "how to thaw frozen fish.",
        "steps": [
            "Rinse the fish when you remove it from the freezer",
            "Cook the fish right away",
            "Know which recipes require thawed fish"
        ],
        "clap_step": [
            "1: Begin icebreakers"
        ]
    },
    {
        "task": "how to reset a factory car alarm.",
        "steps": [
            "Fix an alarm that starts when you turn the car on",
            "Diagnose an alarm that never sets",
            "Fix an alarm that goes off randomly",
            "Check if the alarm is the reason your car won't stop"
        ],
        "clap_step": []
    },
    {
        "task": "how to buy a remote keyless entry system for a car.",
        "steps": [
            "Determine what functions you want",
            "Choose a basic or pager model",
            "Decide whether to add an alarm",
            "Some remote keyless entry systems include the optional feature of a car alarm that is activated when the door is forced open or opened without the controller",
            "Compare transmitter ranges",
            "Evaluate warranty options",
            "Consider how many controllers you need",
            "Have the system professionally installed"
        ],
        "clap_step": [
            "{\"concept_knowledge\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"task_only_base\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"base\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"base_tune\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"standard_prompt\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"soft_prompt_tuning\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"chain_of_thought\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"chain_of_cause\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"cmle_ipm\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"cmle_epm\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"irm\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"vae_r\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"rwSAM\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}, \"counterfactual_prompt\": {\"sentence-bleu\": 0, \"wmd\": 0, \"mover\": 0, \"rouge-1-f\": 0, \"rouge-1-p\": 0, \"rouge-1-r\": 0, \"bert-score-f\": 0, \"bert-score-p\": 0, \"bert-score-r\": 0}}"
        ]
    }
]