[
    "Based on the task \"get_coconut_juice\" and the provided steps and descriptions, here are the PDDL actions:\n\n### PDDL Actions:\n\n```lisp\n;; Action 1: Peel the coconut\n(:action peel_coconut\n    :parameters (?c - coconut ?b - cutting_board ?k - knife)\n    :precondition (and\n      (on ?c ?b)\n      (sharp ?k)\n      (has_white_casing ?c)\n    )\n    :effect (and\n      (exposed_inner_shell ?c)\n      (not (has_white_casing ?c))\n    )\n)\n\n;; Action 2: Drain the coconut\n(:action drain_coconut\n    :parameters (?c - coconut ?g - glass)\n    :precondition (and\n      (exposed_inner_shell ?c)\n      (not (empty ?c))\n    )\n    :effect (and\n      (empty ?c)\n      (in_glass ?coconut_juice ?g)\n    )\n)\n```\n\n### Explanation:\n\n1. **peel_coconut**:\n   - **Parameters**: The action involves a coconut (`?c`), a cutting board (`?b`), and a knife (`?k`).\n   - **Preconditions**: The coconut must be on the cutting board, the knife must be sharp, and the coconut must have a white casing.\n   - **Effects**: The action results in the coconut's inner shell being exposed, and it no longer has the white casing.\n\n2. **drain_coconut**:\n   - **Parameters**: The action involves a coconut (`?c`) and a glass (`?g`).\n   - **Preconditions**: The coconut's inner shell must be exposed, and it must not be empty.\n   - **Effects**: The coconut becomes empty, and the coconut juice is now in the glass. \n\nThese actions capture the process of peeling and draining a coconut to obtain the juice, as described in the task.",
    "Here are the PDDL actions based on the task \"get_coconut_meat_without_oven\" and the provided steps and descriptions:\n\n```lisp\n;; Action to wrap the coconut in a towel\n(:action wrap-coconut\n    :parameters (?c - coconut ?t - towel)\n    :precondition (and\n                    (not (wrapped ?c ?t))\n                    (coconut_intact ?c)\n                   )\n    :effect (wrapped ?c ?t)\n)\n\n;; Action to peel the coconut using a knife\n(:action peel-coconut\n    :parameters (?npc - person ?c - coconut ?k - knife)\n    :precondition (and\n                    (wrapped ?c ?t)\n                    (not (peeled ?c))\n                    (knife_sharp ?k)\n                   )\n    :effect (peeled ?c)\n)\n\n;; Action to drain the coconut\n(:action drain-coconut\n    :parameters (?npc - person ?c - coconut ?r - rack)\n    :precondition (and\n                    (peeled ?c)\n                    (not (drained ?c))\n                   )\n    :effect (drained ?c)\n)\n\n;; Action to open the coconut after wrapping it\n(:action smash-coconut\n    :parameters (?npc - person ?c - coconut ?h - hammer)\n    :precondition (and\n                    (wrapped ?c ?t)\n                    (drained ?c)\n                    (not (smashed ?c))\n                   )\n    :effect (smashed ?c)\n)\n```\n\n### Explanation:\n\n1. **wrap-coconut**: This action wraps the coconut in a towel, ensuring that bits do not fly when smashed.\n   - **Preconditions**: The coconut is intact and not yet wrapped.\n   - **Effects**: The coconut becomes wrapped in the towel.\n\n2. **peel-coconut**: This action involves peeling off the outer casing of the coconut with a knife.\n   - **Preconditions**: The coconut is wrapped, the knife is sharp, and the coconut is not yet peeled.\n   - **Effects**: The coconut becomes peeled.\n\n3. **drain-coconut**: This action drains the liquid from the coconut by placing it upside down on a rack.\n   - **Preconditions**: The coconut is peeled and not yet drained.\n   - **Effects**: The coconut becomes drained.\n\n4. **smash-coconut**: This action breaks open the coconut using a hammer while it is still wrapped.\n   - **Preconditions**: The coconut is wrapped, drained, and not yet smashed.\n   - **Effects**: The coconut becomes smashed, making the meat accessible.",
    "Sure, let's generate PDDL actions for the task \"get_coconut_meat_with_oven\" based on the steps and descriptions provided.\n\nTask: get_coconut_meat_with_oven\n\nSteps:\n- peel npc\n- drain npc rack\n- wrap coconut_wrapped towel1\n- peel npc\n- break coconut_wrapped towel\n- remove_item npc\n\nDescriptions:\n- Use a knife to shave off the tender white casing. Position your young coconut on a cutting board, and use a sharp cleaver or a sturdy chef’s knife to slice off the outer casing. Carve at an angle, as if you were removing the skin from an apple, until you expose the hard inner shell. Work to expose as much of the shell as possible.\n- Turn the coconut upside down over a glass and allow it to drain. Let the coconut sit for several minutes or until all of the liquid drains out. You may need to shake the coconut a few times to get the last bit of water out of it.\n- Wrap the mature coconut in a kitchen towel. Place the coconut in the center of the towel, and gather the corners of the towel together to form a pouch. This will keep coconut bits from flying when you go to smash it with a hammer.\n- Whack the wrapped coconut with a hammer, or bash it against a hard surface. With the coconut still wrapped in the towel, use a hammer or a mallet to repeatedly and forcefully whack the coconut. Turn the coconut as you hammer it, in order to strike it from multiple angles. Hammer it until you feel it break open beneath the towel.\n- Remove the coconut and wrap it in a towel to cool. Use oven mitts to retrieve the coconut from the oven or microwave, and allow it to cool for about 5 minutes while wrapped in a towel. Doing this ensures you don’t have hot coconut bits flying everywhere when you go to smash it in the next step.\n- Use a knife to separate the meat from the shell. Remove the coconut pieces from the towel. Take each piece, and wedge a knife between the shell and the white meat of the coconut to carefully separate the two. Then, use the knife (or a vegetable peeler) or remove the fibrous layer that might still be clinging to the outside of the meat.\n\nPDDL Actions:\n```lisp\n(:action peel_coconut\n    :parameters (?c - coconut ?k - knife)\n    :precondition (and (has_outer_casing ?c) (sharp ?k))\n    :effect (and (exposed_shell ?c) (not (has_outer_casing ?c)))\n)\n\n(:action drain_coconut\n    :parameters (?c - coconut ?g - glass)\n    :precondition (and (exposed_shell ?c) (empty ?g))\n    :effect (and (drained ?c) (filled ?g) (not (empty ?g)))\n)\n\n(:action wrap_coconut\n    :parameters (?c - coconut ?t - towel)\n    :precondition (and (drained ?c) (clean ?t))\n    :effect (and (wrapped ?c ?t) (not (clean ?t)))\n)\n\n(:action break_coconut\n    :parameters (?c - coconut ?t - towel ?h - hammer)\n    :precondition (and (wrapped ?c ?t) (heavy ?h))\n    :effect (and (broken ?c) (not (wrapped ?c ?t)))\n)\n\n(:action remove_coconut_meat\n    :parameters (?c - coconut ?k - knife)\n    :precondition (and (broken ?c) (sharp ?k))\n    :effect (and (meat_separated ?c) (not (broken ?c)))\n)\n```\n\nThis set of PDDL actions captures the steps and descriptions provided for the task \"get_coconut_meat_with_oven.\" Each action includes parameters, preconditions, and effects that reflect the logic and intent of the corresponding step."
]