[
    "Sure, let's generate PDDL actions for the task \"hunt_animal_for_food\" based on the given steps and descriptions.\n\nTask: hunt_animal_for_food\n\nSteps:\n1. hunt_path npc path\n2. carve_groove person wood rock\n3. test_food npc\n\nDescriptions:\n- Heating the water above 185° F (85° C) for three minutes will kill all pathogens in your water.\n- Hunt for fish, insects, and small animals for food. The protein and nutrients from meat and fish will give you energy. Mollusks, clams, oysters, crabs, muscles, and fish are all things that you may be able to find in the shallow waters surrounding or on an island.\n- Test the food you eat for poison. If you've never eaten the fruit that you find on the island, test it for poison by rubbing it on a sensitive part of your skin, like your wrist. Wait 45 minutes. If there is no adverse reaction, rub some of the food on your lips. If you form a rash, or there is burning or irritation, then the food is most likely poisonous. Never eat large amounts of any unknown food. Eat a small amount, wait an hour or two to see if you feel sick, then eat the rest of it.\n\nPDDL Actions:\n\n```lisp\n;; Action 1: Hunt for food\n(:action hunt_for_food\n    :parameters (?npc - agent ?location - location)\n    :precondition (and\n      (at ?npc ?location)\n      (not (has_food ?npc))\n    )\n    :effect (and\n      (has_food ?npc)\n    )\n)\n\n;; Action 2: Carve groove\n(:action carve_groove\n    :parameters (?person - agent ?wood - material ?rock - tool)\n    :precondition (and\n      (at ?wood ?location)\n      (at ?rock ?location)\n      (not (carved ?wood))\n    )\n    :effect (and\n      (carved ?wood)\n    )\n)\n\n;; Action 3: Test food for poison\n(:action test_food_for_poison\n    :parameters (?npc - agent ?food - item)\n    :precondition (and\n      (has_food ?npc)\n      (not (tested ?food))\n    )\n    :effect (and\n      (tested ?food)\n      (safe_to_eat ?food)\n    )\n)\n```\n\nExplanation:\n1. **hunt_for_food**: This action represents the NPC hunting for food in a specified location.\n   - **Parameters**: `?npc` (the NPC hunting), `?location` (the location where the hunt takes place).\n   - **Preconditions**: The NPC must be at the location and must not already have food.\n   - **Effects**: The NPC obtains food.\n\n2. **carve_groove**: This action represents a person carving a groove in wood using a rock.\n   - **Parameters**: `?person` (the person carving), `?wood` (the wood being carved), `?rock` (the tool used for carving).\n   - **Preconditions**: The wood and rock must be at the same location, and the wood must not already be carved.\n   - **Effects**: The wood is carved.\n\n3. **test_food_for_poison**: This action represents testing food for poison.\n   - **Parameters**: `?npc` (the NPC testing the food), `?food` (the food being tested).\n   - **Preconditions**: The NPC must have the food, and the food must not have been tested yet.\n   - **Effects**: The food is tested and marked as safe to eat if it passes the test.\n\nThese actions capture the intent and logic of the provided steps and descriptions for the task \"hunt_animal_for_food\"."
]