[
    "To generate PDDL actions for the task \"build_raft\" based on the provided step and description, let's define an action that captures the intent of creating a raft and possibly a rescue signal. The action will be structured to reflect the creation of the raft at the beach location.\n\n### PDDL Actions:\n\n```lisp\n;; Action 1: create_raft\n(:action create_raft\n    :parameters (?npc - agent ?location - place ?raft_draft - object)\n    :precondition (and\n                    (at ?npc ?location)\n                    (has-materials ?npc ?raft_draft)\n                    (location-type ?location beach))\n    :effect (and\n              (raft-built ?raft_draft)\n              (not (has-materials ?npc ?raft_draft))\n             )\n)\n\n;; Action 2: create_rescue_signal\n(:action create_rescue_signal\n    :parameters (?npc - agent ?location - place)\n    :precondition (and\n                    (at ?npc ?location)\n                    (location-type ?location beach)\n                    (has-materials ?npc signal-materials))\n    :effect (and\n              (signal-created ?location)\n              (not (has-materials ?npc signal-materials))\n             )\n)\n```\n\n### Explanation:\n\n- **create_raft**: This action involves an agent (npc) creating a raft at a specific location (beach) using materials (raft_draft). The preconditions ensure the npc is at the beach and has the necessary materials. The effect is the raft being built, and the materials no longer being available.\n\n- **create_rescue_signal**: This action allows the npc to create a rescue signal at the beach location. The preconditions check that the npc is at the beach and has the necessary materials for the signal. The effect is the signal being created and the materials being used up.\n\nThese actions are designed to reflect the task of building a raft and potentially creating a rescue signal, aligning with the provided description.",
    "To generate PDDL actions for the task \"create_shelter\" based on the provided step and descriptions, we'll follow the format and structure as shown in the example. Since there is only one step provided, we'll assume that the task is about placing an object in a receptacle, which might be a part of organizing or preparing materials for shelter creation.\n\nHere are the PDDL actions:\n\n```pddl\n;; Action: Put Object in Receptacle\n(:action put_object_in_receptacle\n    :parameters (?a - agent ?o - object ?r - receptacle)\n    :precondition (and\n                    (holding ?a ?o)\n                    (empty ?r)\n                  )\n    :effect (and\n              (not (holding ?a ?o))\n              (in_receptacle ?o ?r)\n              (filled ?r)\n            )\n)\n```\n\n### Explanation:\n\n- **Action Name**: `put_object_in_receptacle` - This action describes placing an object into a receptacle, which could be part of organizing materials for a shelter.\n- **Parameters**: \n  - `?a` - agent, representing the individual performing the action.\n  - `?o` - object, representing the item being placed in the receptacle.\n  - `?r` - receptacle, representing the container or location where the object is placed.\n- **Preconditions**: \n  - `(holding ?a ?o)` - The agent must be holding the object.\n  - `(empty ?r)` - The receptacle must be empty to receive the object.\n- **Effects**: \n  - `(not (holding ?a ?o))` - The agent is no longer holding the object after placing it.\n  - `(in_receptacle ?o ?r)` - The object is now in the receptacle.\n  - `(filled ?r)` - The receptacle is now filled with the object.\n\nThis action captures the intent of organizing or preparing materials, which can be a preliminary step in creating a shelter. If there were more steps or detailed descriptions, additional actions could be generated to cover other aspects of shelter creation."
]