[
    {
        "title": "How to Make a Candy Wreath",
        "steps": [
            "Hot glue the candy canes together to form heart shapes.",
            "Arrange the candy cane hearts to form a circle, with the points facing inwards.",
            "Glue the candy cane hearts together where they touch.",
            "Make a smaller wreath in the same fashion using 12 mini candy canes.",
            "Glue the mini wreath on top of the larger wreath, right in the middle.",
            "Glue a round peppermint to the center of the wreath.",
            "Spray the wreath with clear, glossy sealant to make it last longer.",
            "Tie a ribbon to the top of the wreath to make a hanger.",
            "Hang the wreath up when you are done."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make an Easter Door Decoration",
        "steps": [
            "Decide on your favorite decoration idea for the door.",
            "Make Easter wreaths.",
            "Make a paper decoration.",
            "Make a bird's nest front door decoration.",
            "Sew a door hanging.",
            "Make a tray decoration.",
            "Make a bunting.",
            "Make a basket decoration.",
            "Use fresh flowers.",
            "Crochet or knit a decoration."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Hang Wreaths",
        "steps": [
            "Buy a premade wreath hanger for an easy option.",
            "Use magnetic hangers to hang wreaths on metal surfaces.",
            "Utilize a suction cup hook to hang wreaths on glass."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make a Family Crest",
        "steps": [
            "Gather your materials.",
            "Gather everyone together.",
            "Brainstorm ideas.",
            "Think of symbols to represent your ideas.",
            "Create the background shape.",
            "Pick a person to design each piece.",
            "Divide the shape.",
            "Glue the pieces onto the crest.",
            "Add a motto.",
            "Place your family name on a banner."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make a Deco Mesh Wreath",
        "steps": [
            "Curl your deco mesh ribbon.",
            "Form bunches of deco mesh curls.",
            "Attach the first bunch.",
            "Attach the remaining bunches.",
            "Fluff the curls."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make a Pinecone Wreath",
        "steps": [
            "Select short, round pinecones.",
            "Paint the foam form with brown metallic paint.",
            "Remove all of the stems from the pinecones.",
            "Place a dot of hot glue on the bottom of the pinecone.",
            "Attach the pinecones around the foam wreath form.",
            "Add another layer of pinecones.",
            "Decorate the wreath."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make a Tulip Wreath",
        "steps": [
            "Place your tulips around the wreath.",
            "Add an additional layer.",
            "Hot glue any loose buds.",
            "Hang your wreath."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make an Easter Egg Wreath",
        "steps": [
            "Choose a wreath to use as your base.",
            "Hot glue moss to the front of a grapevine wreath to create a natural look.",
            "Hot glue plastic Easter eggs to the wreath.",
            "Fill the gaps between the eggs with sprigs of flowers, if desired.",
            "Make a bow out of wired ribbon, then secure it to the wreath, if desired.",
            "Add a ribbon hanging loop, if desired."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make a Clay Pot Wreath",
        "steps": [
            "Lay wreath and supplies on a flat surface covered with either a drop cloth or newspaper.",
            "Position clay pots around the top of the wreath.",
            "Tie pots into place with the twine.",
            "Add hot glue underneath each tied pot for added security.",
            "Decorate with added items using your hot glue gun.",
            "Finished."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Hang a Wreath on a Door",
        "steps": [
            "Open the door.",
            "Add a protective pad to the magnet.",
            "Place the magnets on the door.",
            "Hang your wreath."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make an Easter Bunny Wreath",
        "steps": [
            "Cut your fabric into three-inch wide strips.",
            "Wrap fabric around your wreath.",
            "Wrap the other wreath in fabric.",
            "Cut your hangers in half.",
            "Make tips on the ends of your hangers.",
            "Make holes for each ear.",
            "Insert your bunny ears.",
            "Wrap the ears in fabric.",
            "Attach your two wreaths with a bow."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make a Driftwood Wreath",
        "steps": [
            "Hot-glue seashells around the wreath if you want to make it beach-themed.",
            "Add live flowers or artificial succulents to the wreath to give it a natural look.",
            "Wrap rope or fabric around the wreath to create a rustic feel.",
            "Tie garlands and ribbons around the ring for a driftwood Christmas wreath.",
            "Attach a mirror behind the wreath to create a decorative driftwood frame."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Hang a Wreath on a Window",
        "steps": [
            "Ensure that your window can open from the top.",
            "Cut 4 to 5 feet (1.2 to 1.5 m) of wide, outdoor ribbon.",
            "Hot glue one end of the ribbon around your wreath.",
            "Wrap the ribbon around the top of the wreath twice.",
            "Add a bow to the top of the wreath for a nicer finish, if desired.",
            "Open the window and push the wreath through it.",
            "Adjust the length of the ribbon, then pin it to the window frame.",
            "Close the window."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make a Wreath",
        "steps": [
            "Try a candy wreath for a tasty treat.",
            "Create a deco mesh wreath using a wire wreath frame as a base.",
            "Use non-floral items such as pinecones or succulents.",
            "Wrap ribbon or burlap around a Styrofoam wreath for a unique base."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make a Clay Wreath",
        "steps": [
            "Make cinnamon clay.",
            "Mix the cinnamon, cloves, and nutmeg together in a bowl.",
            "Roll out the dough to about a quarter inch thick.",
            "Cut out gingerbread men.",
            "Place the cut shapes carefully on waxed paper on top of cookie sheets.",
            "Decorate.",
            "Wrap a plain ribbon around a foam wreath.",
            "Arrange the gingerbread men around the covered foam wreath.",
            "Weave a length of ribbon in and out around the gingerbread circle.",
            "Hang the cinnamon clay gingerbread wreath on a door or other place."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make a Boxwood Wreath",
        "steps": [
            "Get some faux boxwood greenery.",
            "Pull the faux boxwood greenery apart.",
            "Hot glue your first set of boxwood to the outermost edge of the grapevine wreath.",
            "Continue hot gluing the sprigs until the entire wreath is covered.",
            "Fill in any gaps.",
            "Neaten the wreath up.",
            "Add a ribbon hanging loop.",
            "Hang your wreath."
        ],
        "cluster_label": 2404
    },
    {
        "title": "How to Make a Cookie Wreath",
        "steps": [
            "Assemble the items needed.",
            "Make the cookies, pierce two holes at the top of each cookie.",
            "Bake as recommended by the recipe.",
            "Remove the baked cookies from the oven.",
            "Arrange the cookie pattern you want to make into a wreath.",
            "Thread the ribbon or other chosen thread through the holes of the cookies.",
            "Thread on as many as it takes to create a circle.",
            "Tie off the ribbon or other thread material with a knot.",
            "Hang on a tree, a door or other part of your house."
        ],
        "cluster_label": 2404
    }
]