[
    {
        "title": "How to Start Your Own Country",
        "steps": [
            "Learn about your country.",
            "Make your plans.",
            "Create rules.",
            "Find territory for your micronation.",
            "Build an island.",
            "Invite your friends.",
            "Establish a government and/or constitution.",
            "Establish a law system.",
            "Declare your independence.",
            "Establish an economy.",
            "Be recognized by the world community.",
            "Manage your branding.",
            "Establish a language.",
            "Get out there and do it!."
        ],
        "cluster_label": 254
    },
    {
        "title": "How to Make Homework a Game",
        "steps": [
            "Write a list of all your homework.",
            "Get all your homework together and put it in a pile in the order you want to do it.",
            "Collect the supplies you'll need, such as a calculator, ruler, pencils, drawing paper, or anything else you know you'll need to complete all of your assignments.",
            "Create a lore for your epic game of doing your homework.",
            "Sit back and continue the story in your mind.",
            "Once you have worked for an hour, give yourself a ten minute break.",
            "Continue in this way until you have finished your homework."
        ],
        "cluster_label": 254
    },
    {
        "title": "How to Make a Game Room",
        "steps": [
            "Consider where you want to build your game room.",
            "Clear out all the furniture and start fresh.",
            "Think about what you want out of your game room.",
            "Furnish the room accordingly.",
            "Now it's time for the fun part, getting the games!.",
            "(Optional) If you want you can go find some old classic arcade games!.",
            "Have fun with it!."
        ],
        "cluster_label": 254
    },
    {
        "title": "How to Start a Hockey League With Your Friends",
        "steps": [
            "Buy some regulation hockey nets to use.",
            "You will need a large surface to play on.",
            "Find some friends that can play.",
            "Assign captains and teams, the number of them varying upon how many players there are.",
            "Assign a certain day of the week and time to have games that works for the most people.",
            "Have fun!."
        ],
        "cluster_label": 254
    },
    {
        "title": "How to Run a Golf Tournament",
        "steps": [
            "Set a tentative date to hold your event.",
            "Contact a golf course.",
            "Create a golf tournament-planning folder.",
            "Shop for and discuss trophy and tournament memorabilia with a reputable vendor as far in advance as possible.",
            "Decide the fee you will charge participants and sponsors.",
            "Assemble sponsor packets and send to area businesses.",
            "Design a media kit and send to various radio, television, and newspaper outlets to promote your golf tournament.",
            "Make copies of the flier and form to disperse to the golf course as well as friends and family who can spread the word.",
            "Keep track of the groups and payments as they sign up.",
            "Contact food vendors.",
            "Create banners or signs for sponsor holes.",
            "Assign starting positions for the teams.",
            "Collect items for auctions.",
            "Finalize arrangements with the golf course and food vendor.",
            "Set up your event."
        ],
        "cluster_label": 254
    },
    {
        "title": "How to Create a Kahoot Game",
        "steps": [
            "Go to https://create.kahoot.it/login.",
            "Log in.",
            "Click Create.",
            "Click to choose a template or create a new game from scratch.",
            "Click Add question and choose a question type.",
            "Click Done."
        ],
        "cluster_label": 254
    },
    {
        "title": "How to Make a Game Like RuneScape",
        "steps": [
            "Figure out what you want in your game, make a list with things you really want in your game and put it in a locker until you reach a specific step beneath.",
            "Download 3Ds max or buy it (pretty expensive, but do you want new handful updates?.",
            "Download/buy unity 3D, (this is your engine,) and again follow many tutorials.",
            "Make a whole world and enemies.",
            "Use music software (like fruity loops) to make specific soundtrack.",
            "Search for a server and create your own website.",
            "Let your game be free."
        ],
        "cluster_label": 254
    },
    {
        "title": "How to Make Your Own Game",
        "steps": [
            "Use the sporting equipment you already have to give you ideas.",
            "Combine your favorite sports.",
            "Establish rules.",
            "Gather your friends.",
            "Test out your game.",
            "Play your game."
        ],
        "cluster_label": 254
    },
    {
        "title": "How to Build Your Own Carnival Games",
        "steps": [
            "Make a plan.",
            "Add a wheel.",
            "Add a balloon pop.",
            "Add a duck pond.",
            "Add a shoot out.",
            "Add a basketball net.",
            "Add a dunk tank!.",
            "Add games of your own invention or alter the games you find above or ones you see at the carnivals.",
            "Play with family and friends."
        ],
        "cluster_label": 254
    },
    {
        "title": "How to Make a Game",
        "steps": [
            "Design a board game if you want old-fashioned fun.",
            "Come up with a party game if you're hosting an event.",
            "Invent a road trip game if you’re bored on a long car ride.",
            "Use cards if you want to make a portable game you can play anywhere."
        ],
        "cluster_label": 254
    },
    {
        "title": "How to Make a Game Using Construct 2",
        "steps": [
            "Be creative: Being game developer is not an easy task it need skills & time.",
            "Play games: if you want to be a game maker we must be a gamer.",
            "Practice a lot: You need to use construct 2 all the time , to learn faster make game projects and have fun as you do them, it’s not attempt to make a game, it just a practice for it, so don’t make game first, just get experiences and lot of small projects and I hope you’ll succeed."
        ],
        "cluster_label": 254
    },
    {
        "title": "How to Invent a Game",
        "steps": [
            "Read the rules aloud to a group of friends or family members.",
            "Play the game.",
            "Evaluate the tests and make any necessary changes."
        ],
        "cluster_label": 254
    }
]