[
    {
        "title": "How to Fertilize Carnivorous Plants",
        "steps": [
            "Place your carnivorous plants in soil that lacks nutrients.",
            "Supply your plant with water that does not contain nutrients.",
            "Keep the soil of your carnivorous plants damp or wet.",
            "Expose your carnivorous plants to sunlight at all times.",
            "Fertilize your carnivorous plants with insects."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Build Humus",
        "steps": [
            "Test the soil’s pH level to see if it can benefit from a humus treatment.",
            "Stir the humus into your topsoil to correct soil that’s too sandy or too thick.",
            "Discourage pests and prevent diseases in the soil with humus.",
            "Revitalize infertile so it can grow plants again.",
            "Turn compacted soil into fruitful gardening soil."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Fertilize Daffodils",
        "steps": [
            "Let the daffodil foliage die back on its own.",
            "Keep the soil damp but not wet.",
            "Make sure your daffodils are planted deeply enough.",
            "Chill the daffodil bulbs over the winter months to ensure flowering.",
            "Place your daffodils in a sunny spot with where the soil drains well.",
            "Hoe around the daffodils to prevent infestation."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Apply Urea Fertilizer",
        "steps": [
            "Determine your ideal fertilizer ratio.",
            "Combine urea with additional fertilizers to create a stable fertilizer mixture.",
            "Mix urea with certain fertilizers to fertilize plants immediately.",
            "Prevent unwanted chemical reactions from harming your crops.",
            "Blend urea with phosphorus and potassium-rich fertilizers for a well-balanced fertilizer.",
            "Spread your urea-based fertilizer evenly across your crops."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Fertilize Flowers",
        "steps": [
            "Read labels.",
            "Look for N-P-K.",
            "Choose phosphorous for flowers.",
            "Consult an expert.",
            "Expect some trial and error."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Buy Soil Amendments",
        "steps": [
            "Determine what kind of soil amendment you need.",
            "Bear in mind that each type of amendment will change the chemical composition of the soil -- lowering nitrogen or adding phosphorous, potassium or salt.",
            "Calculate how much soil amendment you will need.",
            "Buy soil amendments by the bag or truckload from garden centers, nurseries, compost facilities, landscapers and tree companies, farmers markets or online."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Use Potash",
        "steps": [
            "Check with your local extension office for advice on when to apply potash.",
            "Measure out the amount of potash you need based on soil test results.",
            "Apply granular potash fertilizers directly on top of the soil.",
            "Spray potassium thiosulfate on the leaves during the growing season."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Fertilize a Lawn",
        "steps": [
            "Obtain the proper equipment.",
            "Fertilize at the right time of year.",
            "Prepare the spreader.",
            "Start fertilizing.",
            "Water your lawn."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Use Ashes As Fertilizer",
        "steps": [
            "Use wood ashes as a soil amendment in the early spring while the soil is dry and before the plant life has begun to actively grow.",
            "Apply 20 pounds (9 kg) of wood ashes per 1000 square feet (93 square m) of soil, tilling them thoroughly into the soil.",
            "Sprinkle ashes upon each layer of your compost pile.",
            "Amend heavy clay soil by using wood ashes because they break up the soil and help it retain more air.",
            "Deter garden pests by using wood ashes.",
            "To keep your ashes where you want them, apply them on a day that is not too windy.",
            "Use caution when using ashes in the garden.",
            "Produce more wood ashes by burning hardwoods rather than soft woods."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Use Commercial Fertilizer",
        "steps": [
            "Understand what chemical fertilizers are made of.",
            "Research the nutrient requirements for the crop you are growing.",
            "Have your soil tested to understand what compounds are needed the most for your growing conditions and crops.",
            "Calculate how much fertilizer you need.",
            "Purchase the product you determine you need for your crop and soil condition.",
            "Apply the fertilizer.",
            "Cultivate or till the fertilizer into the soil around the plants to make it available to the plant's roots, to accelerate absorption, and to prevent run-off in case of rain.",
            "Watch for signs of over- or under-fertilization while your plants are growing.",
            "Clean up your application equipment as soon as you are finished using it.",
            "Store unused fertilizer in its original package, if possible, in a dry, safe place."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Apply Slow Release Fertilizer",
        "steps": [
            "Put on gloves before touching the fertilizer.",
            "Sprinkle slow-release fertilizer around individual perennials.",
            "Arrange fertilizer around the base of shrubs and perennials.",
            "Spread slow-release fertilizer next your vegetable plants."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Make Nitrogen Fertilizer",
        "steps": [
            "Use compost.",
            "Add in some composted coffee grounds.",
            "Try composted manure.",
            "Mix in a good dose of blood meal for a quick-release fertilizer.",
            "Apply cotton seed meal cautiously.",
            "Use crab meal, feather meal, or leather meal for slow-release fertilizers.",
            "Try biosolids and wood.",
            "Plant nitrogen-fixing cover crops."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Prepare Soil for Fruit Trees",
        "steps": [
            "Reduce soil acidity when necessary.",
            "Raise the pH of soil that's too basic.",
            "Avoid fertilizing before planting.",
            "Use nitrogen light fertilizers for established trees."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Fertilize a Garden Cheaply",
        "steps": [
            "Fertilize the garden with aged animal manure.",
            "Use fish guts and bones to make fish fertilizer.",
            "Fertilize with worm castings."
        ],
        "cluster_label": 1137
    },
    {
        "title": "How to Use Blood Meal",
        "steps": [
            "Begin applying blood meal in early spring.",
            "Determine how much blood meal you need for your space.",
            "Mix the blood meal with soil or water before spreading it.",
            "Avoid using blood meal on seedlings or beans and legumes.",
            "Lower nitrogen in the soil if you've applied too much blood meal."
        ],
        "cluster_label": 1137
    }
]