[
    {
        "title": "How to Pass Your Music Exam",
        "steps": [
            "Know the syllabus.",
            "Practice, practice, practice!.",
            "Know which part of the syllabus you need to work on most, and what you can improve, and then work on it.",
            "Do not be afraid of aural!.",
            "On the day of your exam: The most important thing is to be calm, relax, and try not to think about it.",
            "Turn up early, and definitely warm up and run through pieces and scales beforehand.",
            "Introduce yourself and your music calmly to the examiner waiting until he asks.",
            "Stay calm and composed, do not show your nerves.",
            "Check your sight-reading piece.",
            "Practise with your accompaniment so they know your style of playing."
        ],
        "cluster_label": 519
    },
    {
        "title": "How to Choose Musical Toys",
        "steps": [
            "Choose toys that will not break easily.",
            "Match the musical instrument to the interests of your child.",
            "Research your options.",
            "Choose an introductory level instrument.",
            "Ask advice from a music teacher.",
            "Choose an instrument whose noise you can tolerate for long periods of time."
        ],
        "cluster_label": 519
    },
    {
        "title": "How to Be Motivated to Practice an Instrument",
        "steps": [
            "Identify with your instrument.",
            "Go to concerts and other musical events.",
            "Select practice pieces that you like.",
            "Get inspiration from others.",
            "Get creative.",
            "Have a recital.",
            "Take breaks.",
            "Play with someone else.",
            "Challenge yourself."
        ],
        "cluster_label": 519
    },
    {
        "title": "How to Make Violin Practice Fun",
        "steps": [
            "Do a token race to help you master harder sections.",
            "Go on a “tour” of your home or neighborhood.",
            "Use silly cards or sticks to make practice playful.",
            "Play “pick a cup” with hidden treats."
        ],
        "cluster_label": 519
    },
    {
        "title": "How to Play Experimental Music",
        "steps": [
            "Don't think.",
            "Start looking at things and thinking what weird things you could do to it that would make it sound cool.",
            "Go out and by a cheap violin bow and some rosin (its the dried tree sap stuff string players smear all over the bow hair) Try bowing stuff.",
            "While you are at the music store, you can pick up some guitar, violin, cello, bass strings.",
            "Enter the electronic world of music.",
            "Now take all of your experimentation and combine it together to make sort of a super-junk-instrument of doom.",
            "Add in real instruments if you like.",
            "Play with other people for best results.",
            "Have fun."
        ],
        "cluster_label": 519
    },
    {
        "title": "How to Play the Tenor Saxophone",
        "steps": [
            "Obtain a decent saxophone and the accessories needed to play it.",
            "Assemble the saxophone.",
            "Make sure you're holding the instrument correctly.",
            "Form your embouchure.",
            "Without covering any holes or pressing any keys, blow into the instrument.",
            "Move on to the next notes.",
            "Find some music to play.",
            "Keep practicing."
        ],
        "cluster_label": 519
    },
    {
        "title": "How to Yodel",
        "steps": [
            "Expect mistakes in the beginning.",
            "Watch yodeling videos.",
            "Listen to yodeling albums.",
            "Turn yodeling into a game to play with your friends.",
            "Join a yodeling group.",
            "Play an instrument."
        ],
        "cluster_label": 519
    },
    {
        "title": "How to Play the Timpani",
        "steps": [
            "First, you will have to know how to read bass clef music.",
            "Sit on a spinning stool in front of however many timpani you need to play.",
            "Make sure you have timpani mallets.",
            "To tune a timpani, you will need a pitch pipe, or if there is a vibraphone nearby, it will work just as well because its keys will not go out of tune.",
            "Read the music just as you would any other music, making sure that you are playing the right drums at the right time, depending on where they are located in front of you and where the notes are located on the staff."
        ],
        "cluster_label": 519
    },
    {
        "title": "How to Study an Unusual Musical Instrument",
        "steps": [
            "Acquire some prior musical experience.",
            "Choose an unusual musical instrument to study.",
            "Purchase or rent the instrument and all accessories needed to play it.",
            "Begin learning to play.",
            "If you haven't been doing so already, join a group or start performing.",
            "Stick with it."
        ],
        "cluster_label": 519
    },
    {
        "title": "How to Play the Viola in a School Orchestra",
        "steps": [
            "Join your school’s orchestra.",
            "Pick up your viola from the school if they order it for you, or buy one.",
            "Get a shoulder rest.",
            "Learn how to read music.",
            "Learn scales.",
            "Learn basic songs.",
            "Slowly increase the amount your practice.",
            "Have patience, and stick with the instrument.",
            "Audition for a more selective ensemble.",
            "Listen to other violists and classical music."
        ],
        "cluster_label": 519
    },
    {
        "title": "How to Improvise on the Piano",
        "steps": [
            "Choose a key for your improvised piece.",
            "Establish a chord progression.",
            "Pick a simple phrase as the foundation of your melody.",
            "Play the phrase over each chord in your progression.",
            "Experiment with variations on the main phrase.",
            "Keep going even if you “mess up”."
        ],
        "cluster_label": 519
    }
]