[
    {
        "title": "How to Advertise Locally",
        "steps": [
            "Create business cards to hand out.",
            "Purchase an ad in a local publication.",
            "Put out a press release once a month.",
            "Turn your car into an advertisement.",
            "Wear T-shirts with your business’s name on them.",
            "Design a contest to get people excited about your business."
        ],
        "cluster_label": 2487
    },
    {
        "title": "How to Advertise an Event",
        "steps": [
            "Send event invites to your email list.",
            "Tell new people you meet about your event.",
            "Ask your friends and family to help you promote the event."
        ],
        "cluster_label": 2487
    },
    {
        "title": "How to Sell Billboard Space",
        "steps": [
            "Choose a location for your billboard that will attract buyers.",
            "Use your billboard to advertise itself.",
            "Contact local organizations to let them know that your billboard space is for rent.",
            "Offer discounted rates for advertising on multiple billboards (optional).",
            "List your billboard on Internet sites.",
            "Evaluate all offers and accept 1.",
            "Complete the necessary paperwork."
        ],
        "cluster_label": 2487
    },
    {
        "title": "How to Advertise an Event Planning Business",
        "steps": [
            "Advertise in local newspapers to get your name out.",
            "Place an ad on an online classified ad website in your area.",
            "Contact local radio stations to advertise your business.",
            "Volunteer to organize events benefiting your community."
        ],
        "cluster_label": 2487
    },
    {
        "title": "How to Get Free Radio Advertising",
        "steps": [
            "Choose 5 to 200 radio stations that are near to your business.",
            "Listen to the radio regularly.",
            "Give tickets or another prize to a station for a radio contest.",
            "Submit an event on the radio station's community calendar.",
            "Ask for a buy one, get one free deal.",
            "Call talk radio stations and propose to be an expert guest on their shows.",
            "Ask to start a Per Inquiry (PI) advertising campaign."
        ],
        "cluster_label": 2487
    },
    {
        "title": "How to Advertise an Art Gallery Show",
        "steps": [
            "Send out a Save the Date announcement via Facebook, Twitter and email blast as soon as your date is set.",
            "Send a press release out to local newspapers, radio stations and television channels 2 weeks before the event.",
            "Invite local bloggers to the art show.",
            "Advertise on online art forums, such as Visual Art Source."
        ],
        "cluster_label": 2487
    },
    {
        "title": "How to Advertise On Your Favorite Websites",
        "steps": [
            "Decide which of your favorite websites you'd like to advertise on, and think about why you want to advertise on them.",
            "Look at the current ads on the sites to see what kind of space is available and what other companies advertise there.",
            "Search the sites for advertising information.",
            "Contact the website owner if there is no advertising link.",
            "Think about ways to advertise on the sites for free.",
            "Sign up with the site's advertising service provider, if necessary.",
            "Consider using Google AdWords for advertising on your favorite websites."
        ],
        "cluster_label": 2487
    },
    {
        "title": "How to Advertise a Preschool",
        "steps": [
            "Team up with local businesses where parents take preschool-age children.",
            "Build relationships with a few other quality preschools in the area.",
            "Contact the local newspaper to write a story featuring your preschool.",
            "Sponsor a charity event or Little League team."
        ],
        "cluster_label": 2487
    },
    {
        "title": "How to Advertise to College Students",
        "steps": [
            "Make sure your ads are mobile friendly.",
            "Use simple, concise copy in your ads.",
            "Target college students’ parents too."
        ],
        "cluster_label": 2487
    },
    {
        "title": "How to Plan a Radio Promotion",
        "steps": [
            "Map out your demographic.",
            "Appoint someone who is experienced with marketing to lead the radio promotion campaign.",
            "Establish your budget.",
            "Choose a time frame for your radio advertisements.",
            "Decide how far you want your radio promotion to reach.",
            "Create a short press release.",
            "Contact radio stations that fit your target market.",
            "Make a list or spreadsheet of the radio stations you contact.",
            "Choose your radio stations and the number of ads you are buying.",
            "Create your radio script.",
            "Ask to review your advertisement before it goes live.",
            "Ask for a schedule of ad placement, so that you can ensure the radio station is airing your promotions during peak times.",
            "Arrange for tickets or products to be given as part of a radio show or radio station contest.",
            "Track your radio promotion results."
        ],
        "cluster_label": 2487
    },
    {
        "title": "How to Distribute Publicity Materials",
        "steps": [
            "Look for bulletin boards at your local libraries.",
            "Place flyers on college campuses in bulletin boards and kiosks.",
            "Check for community bulletin boards at local businesses.",
            "Go online to \"hang\" your publicity materials.",
            "Avoid putting flyers on public property if your area forbids it."
        ],
        "cluster_label": 2487
    },
    {
        "title": "How to Advertise Your Business on a Budget",
        "steps": [
            "Use your business space.",
            "Volunteer or donate to a cause.",
            "Take part in a contest.",
            "Give things away.",
            "Print flyers and/or business cards.",
            "Turn your car into an advertisement.",
            "Do a publicity stunt.",
            "Build relationships with your customers."
        ],
        "cluster_label": 2487
    }
]