[
    {
        "title": "How to Register Your Dog As a Service Dog",
        "steps": [
            "Request a doctor's letter if you have a psychiatric service dog.",
            "Ask your doctor or therapist for an official letter.",
            "Avoid online websites that provide fraudulent \"doctor consultation letters.\".",
            "Request a letter for non-psychiatric service dogs to make accessibility easier."
        ],
        "cluster_label": 2685
    },
    {
        "title": "How to Adopt a Deployed US Soldier",
        "steps": [
            "Click on the “adopt a soldier here”.",
            "Prepare for a short waiting time.",
            "Make a 'special' request.",
            "Remember, all the soldiers who register are in a combat situation so there is no guarantee that all soldiers will write back or thank you for care packages that are sent."
        ],
        "cluster_label": 2685
    },
    {
        "title": "How to Adopt a Dolphin",
        "steps": [
            "Research various establishments.",
            "Look at dolphin adoption packages.",
            "Sign up for an adoption package.",
            "Visit your animal periodically to check in after adoption.",
            "Read up on dolphins in captivity before adopting."
        ],
        "cluster_label": 2685
    },
    {
        "title": "How to Buy a German Shepherd Puppy",
        "steps": [
            "Look for a puppy that demonstrates the qualities desirable in the German Shepherd breed.",
            "Play with a puppy that you are considering adopting.",
            "Introduce the puppy to every member of your household before buying it, if possible.",
            "Remember to ask to see all the paperwork for any puppy you consider buying."
        ],
        "cluster_label": 2685
    },
    {
        "title": "How to Adopt a Rottweiler",
        "steps": [
            "Close off any rooms you don’t want your newly adopted Rottweiler to go in.",
            "Create a space in the home that is just for your Rottweiler.",
            "Establish a routine and stick to it.",
            "Provide time for daily exercise.",
            "Tell visitors to let your Rottweiler approach them when he’s ready.",
            "Reward your dog for good behaviors."
        ],
        "cluster_label": 2685
    },
    {
        "title": "How to Adopt a Service Dog",
        "steps": [
            "Find a program for service dogs.",
            "Check the cost.",
            "Apply for the program by filling out an application.",
            "Go through training.",
            "Bring your new service dog home.",
            "Learn your rights as a service dog owner.",
            "Keep your service dog under control in public."
        ],
        "cluster_label": 2685
    },
    {
        "title": "How to Encourage Senior Dog Adoption",
        "steps": [
            "Promote senior dog adoption to first time dog owners.",
            "Target senior citizens to adopt senior dogs.",
            "Find foster homes for senior dogs."
        ],
        "cluster_label": 2685
    },
    {
        "title": "How to Adopt a Fostered Dog",
        "steps": [
            "Have prior experience as a dog owner.",
            "Be able to own a dog.",
            "Attend adoption events.",
            "Complete the paperwork.",
            "Meet the fostered dog you want to adopt.",
            "Be ready to take the dog home with you.",
            "Complete adoption paperwork."
        ],
        "cluster_label": 2685
    },
    {
        "title": "How to Adopt a Retired Police Dog",
        "steps": [
            "Learn about the common breeds of retired police dogs.",
            "Be aware of the different types of working military dogs (WMD).",
            "Get the facts about retired police dogs."
        ],
        "cluster_label": 2685
    },
    {
        "title": "How to Save Dogs",
        "steps": [
            "Encourage others to adopt instead of buy.",
            "Raise awareness through activities like sharing resources and attending events.",
            "Report animal cruelty when you see it.",
            "Contact your local legislators to support laws that help dogs."
        ],
        "cluster_label": 2685
    }
]