[
    {
        "title": "How to Make a Bookworm Christmas Tree",
        "steps": [
            "Locate dozens of books.",
            "Choose the lights for the bookworm Christmas tree.",
            "Decide where to place the bookworm tree.",
            "Create the base of the bookworm tree.",
            "Add the next layer.",
            "As you near the top of the bookworm Christmas tree, the books may benefit from being placed one on top of the other, discontinuing the circles.",
            "Add the lights.",
            "Finish the top of the tree.",
            "Finished."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Write a Story on Fairies",
        "steps": [
            "Think about the kind of fairy you want to write about.",
            "Find out or make up their name.",
            "Create a plot.",
            "Figure out the setting of your story (when and where it takes place).",
            "Get writing!."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Hang Fairy Lights",
        "steps": [
            "Wrap lights around tree trunks or large plants to illuminate your garden.",
            "Hang a strand of lights between 2 trees to create an arch.",
            "Wrap fairy lights around a pergola or garden arch for a magical touch.",
            "Combine ornamental and standard fairy lights to create wall art."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Make Garden Crafts with Kids",
        "steps": [
            "See How to make a fairy house for one approach to putting a fairy house together.",
            "Make a fairy house from basic unwanted food containers.",
            "Paint the bowl and the cup or mug.",
            "Add decorative paintwork to the cup and bowl.",
            "Attach the two pieces together to make the fairy house.",
            "Decorate a little more.",
            "Varnish or clear coat the entire house.",
            "The following day, place the little fairy house in the garden."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Make a Faerie Garden with Your Child",
        "steps": [
            "Draw a plan on a piece of paper with your child's input and opinion.",
            "Take a walk in the garden and plot out the area that will make the faerie garden.",
            "Dig over the garden.",
            "Place a square or circle paver upon which the main feature piece will sit.",
            "Mark out a larger outer faerie circle which surrounds this feature piece.",
            "Make little faerie circles next to the large circle.",
            "Add extra faerie pieces.",
            "Follow your child's imagination to include other items in the garden.",
            "Remind your child to keep the flowers watered regularly.",
            "Have a special tea party to open the faerie garden."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Make Fairy Dust",
        "steps": [
            "Gather the materials you will need.",
            "Mix the sugar and food coloring in a bowl.",
            "Pour the colored sugar onto a pan and put it into an oven preheated to 350 degrees.",
            "Pull the sugar out of the oven and let cool to room temperature.",
            "Put the sugar in a container, such as a sugar or salt shaker.",
            "Shake the \"fairy dust\" onto your kids favorite food."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Make a Fairy for the Christmas Tree",
        "steps": [
            "Assemble the materials.",
            "Fold the paper.",
            "Trim.",
            "Bend the wire.",
            "Attach to the paper.",
            "Wind the wire.",
            "Make a bodice.",
            "Make the fairy wings.",
            "Place your beautiful fairy on top of the tree.",
            "Finished."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Make Fairy Wings",
        "steps": [
            "Sketch a fairy wing on a sheet of poster board.",
            "Bend heavy duty wire to match your wing's outline.",
            "Add the inner shapes using thinner wire.",
            "Roll out the cellophane, spray it with adhesive, then set the wing on top.",
            "Roll the cellophane back over the wing, then cut it.",
            "Smooth the wings down, then cut them out of the cellophane.",
            "Let the wing dry beneath a stack of books while you do the next one.",
            "Cover the wings with paper before ironing them using a low-heat setting.",
            "Trim off excess cellophane, but leave a small seam all around the outline wire.",
            "Finish your second wing.",
            "Secure the wings to a U-shaped piece of wire, if desired.",
            "Slide the wings into the back of a corset or fitted dress."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Make Paper Fairy Wings",
        "steps": [
            "Bend the hangers into wings.",
            "Connect the wings together.",
            "Cover with paper.",
            "Decorate the wings.",
            "Make a harness."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Make Friendship Fairy Bread",
        "steps": [
            "Cut off the crusts of your bread.",
            "Place a serving plate in front of you.",
            "Separate the triangles of bread into two stacks - one for butter and one for jam.",
            "Repeat the spreading and 'sticking' process.",
            "Take the last pieces of bread, and spread either butter or jam - whatever comes next in the order of which you placed the other slices of bread.",
            "Spread jam all over the \"sides\" of the square fairy bread stack.",
            "Keep on creating the 100s and 1000s 'shell' until all the sides have been covered.",
            "Enjoy!.",
            "Finished."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Make a Fairy Wand",
        "steps": [
            "Make a natural fairy wand.",
            "Make an embossed fairy wand.",
            "Make a simple wand out of several pipe cleaners.",
            "Make a wand using a glowstick instead of a dowel."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Make a Child's Bat Costume",
        "steps": [
            "For the wings, cut or bend open the wire coat hanger(s).",
            "Once you have this figured out, make two three-pronged shapes.",
            "Twist them together in the middle.",
            "Cut purple fabric to mimic the shape of each wing frame (you'll need two for each side; a front and a back).",
            "Securely glue or sew the fabric around the frame.",
            "Pad each side of the twisted wires with more fabric; glue or sew together.",
            "Fit your child with loops of the wide black elastic (model them after the fairy wings sold in most costume shops).",
            "Sew the padded centerpiece of the wings to the center of the straps at your child's back.",
            "For the ears, cut small triangles of the wire coat hanger.",
            "Cover them in the purple fabric on both sides, then sew to the headband."
        ],
        "cluster_label": 1561
    },
    {
        "title": "How to Hang a Monarch Chrysalis",
        "steps": [
            "Tie the thread around a branch or wire enclosure if you have one.",
            "Pin the chrysalis to a mesh monarch cage for a simple solution.",
            "Tape the chrysalis up if you’re attaching it to a flat surface."
        ],
        "cluster_label": 1561
    }
]