[
    {
        "title": "How to Make an Egg, Tomato and Toast Breakfast",
        "steps": [
            "Assemble all of the ingredients.",
            "For the eggs, beat the eggs in a bowl and add 1 tbsp of milk into the eggs and whisk again.",
            "When the oil is hot enough, pour the egg mixture in with medium heat and start stirring the mixture with a wooden spoon.",
            "Do not over-cook the eggs.",
            "Chopped the tomatoes into small cubes about the size a little bigger than your thumbnail!.",
            "To make the fresh fried tomatoes, heat a little oil in pan in low heat.",
            "Put a pinch of salt and sugar in to enhance the flavors.",
            "Now, we toast the bread.",
            "Lay the bread next to the eggs and tomatoes and drizzle some olive over the dish.",
            "Finished."
        ],
        "cluster_label": 1888
    },
    {
        "title": "How to Make Egg Rolls",
        "steps": [
            "Place an egg roll wrap on a flat surface in front of you with a corner facing you.",
            "Use a spoon to put a scoop of the filling in the middle of the wrap.",
            "Fold the bottom of the wrap up, fold the left and right sides in, then roll it up.",
            "Beat an egg with a fork or whisk in a bowl and use it to seal the egg rolls.",
            "Heat up 1 qt (946 ml) of peanut oil in a pot or deep fryer.",
            "Place the egg rolls into the heated oil and fry them until they are brown.",
            "Drain the cooked egg rolls on a paper towel or a rack and serve them hot."
        ],
        "cluster_label": 1888
    },
    {
        "title": "How to Fry an Egg",
        "steps": [
            "Fry your egg in hot oil for a decadent, golden brown crust and runny yolk.",
            "Flip eggs halfway through to make them over-easy.",
            "Serve an egg with toast for a simple breakfast.",
            "Serve a fried egg over leftovers to make a filling meal.",
            "Place a fried egg on sandwiches or burgers for a rich, protein filled option.",
            "Make Huevos Rancheros."
        ],
        "cluster_label": 1888
    },
    {
        "title": "How to Fry an Egg on the Sidewalk",
        "steps": [
            "Wait for a very hot day.",
            "Place tin foil or metal pan in direct sunlight to heat up.",
            "Crack an egg onto the metal surface.",
            "Crack a second egg onto the sidewalk.",
            "Discard the eggs when you're finished."
        ],
        "cluster_label": 1888
    },
    {
        "title": "How to Make Roti",
        "steps": [
            "Heat up your cooking surface.",
            "Prepare your rolling surface.",
            "Knead and divide the dough.",
            "Roll out the balls.",
            "Begin cooking the roti.",
            "Finish cooking the roti.",
            "Remove the roti and repeat with the next ball of dough.",
            "Enjoy the product of your labor!."
        ],
        "cluster_label": 1888
    },
    {
        "title": "How to Make Egg Strips",
        "steps": [
            "Place 1 to 2 eggs into a bowl.",
            "Add a tablespoon of milk.",
            "Lightly beat the eggs together.",
            "Pour the mixture into a frying pan with butter or oil.",
            "Turn over the egg, remove from the heat, and set aside to cool.",
            "Roll the cooled egg into a cylinder shape.",
            "Cut across the cylinder horizontally.",
            "Put the egg strips onto your dish as required."
        ],
        "cluster_label": 1888
    },
    {
        "title": "How to Make Crispy Vegetable Spring Rolls",
        "steps": [
            "Cook the vegetables.",
            "Add the wet ingredients.",
            "Make the spring rolls.",
            "Lift the wrapper over the top and tuck it in under the filling.",
            "Repeat until all the rolls are finished.",
            "Fry the egg rolls.",
            "Serve."
        ],
        "cluster_label": 1888
    },
    {
        "title": "How to Make an Egg Wash",
        "steps": [
            "Brush the egg wash over your bread.",
            "Spread egg wash over the bottom of an unbaked pie crust.",
            "Seal the edges of pastry with egg wash.",
            "Cover the top of the baked goods.",
            "Use the egg wash to secure seeds, sugar, or pastry."
        ],
        "cluster_label": 1888
    },
    {
        "title": "How to Make Sunny Side Down Eggs",
        "steps": [
            "Put 2 tbsp vegetable oil or butter on the frying pan while the heat is on.",
            "After the oil or butter has been melted or what not, make sure it's all over the pan so it won't stick.",
            "Crack the egg(s) open and make sure you crack the eggs lower to the pan or else the yolks will break.",
            "Just as the whites are starting to turn white, turn the stove off and wait until the eggs are pure white and the yolk has a little bit of a skin over it.",
            "Flip the egg over with a spatula gently.",
            "After a minute or two, flip it over again gently.",
            "Make toast to sweep up the yolk if you like."
        ],
        "cluster_label": 1888
    },
    {
        "title": "How to Make Indian Potato Bread Rolls",
        "steps": [
            "Peel and boil the potatoes.",
            "Pour a little oil into the frying pan or skillet.",
            "Remove from the heat.",
            "Shape the lemony filling mixture into cylinder or ball shapes.",
            "Cut the edges off the bread slices.",
            "Wrap the dampened bread around the filling balls or cylinders.",
            "Deep fry the rolls in oil in a pan or pot.",
            "Serve the lemony potato bread rolls with the sauce of your choice."
        ],
        "cluster_label": 1888
    }
]