[
    {
        "title": "How to Start a Locksmith Business",
        "steps": [
            "Find out the legal requirements for your state.",
            "Get locksmith training.",
            "Practice your skills.",
            "Choose what areas to specialize in.",
            "Purchase tools and supplies.",
            "Find a location.",
            "Get a vehicle.",
            "Decide whether to hire employees.",
            "Set prices and a financial plan.",
            "Build word of mouth advertising.",
            "Network with local business owners as well as other locksmiths.",
            "Advertise your business."
        ],
        "cluster_label": 153
    },
    {
        "title": "How to Start a Scrap Metal Business",
        "steps": [
            "Hire an employee or find a business partner.",
            "Start making arrangements to collect scrap.",
            "Advertise your new business.",
            "Find buyers for your scrap metal.",
            "Work out a schedule."
        ],
        "cluster_label": 153
    },
    {
        "title": "How to Start a Thrift Store",
        "steps": [
            "Decide if you want to start a thrift store that is a for-profit or not-for-profit business.",
            "Prepare and file all required documents.",
            "Choose a location.",
            "Sketch a basic floor plan and decide what type of merchandise you are going to sell in each area.",
            "Stock inventory to sell.",
            "Hire people to staff your thrift store.",
            "Advertise your grand opening."
        ],
        "cluster_label": 153
    },
    {
        "title": "How to Start Your Own Jewelry Line",
        "steps": [
            "Take stock of your technical abilities and design skills.",
            "Gather the tools and materials you will need to produce your own jewelry designs.",
            "Write down your business goals and plans.",
            "Set prices for your jewelry designs.",
            "Think about where you will sell your jewelry.",
            "Talk to a business adviser or accountant to find out how to start your own jewelry line.",
            "Create a logo and printed materials for your jewelry business.",
            "Market your jewelry business online.",
            "Learn some of the practical aspects of running a business.",
            "Continue working on your skills and design."
        ],
        "cluster_label": 153
    },
    {
        "title": "How to Start a Driving Range",
        "steps": [
            "Determine where to build your driving range.",
            "Design the layout of your driving range.",
            "Develop a business plan.",
            "Apply for loan.",
            "Hire a lawyer.",
            "Purchase all the necessary materials needed to operate a driving range.",
            "Market your driving range."
        ],
        "cluster_label": 153
    },
    {
        "title": "How to Start a Tanning Salon",
        "steps": [
            "Visit tanning salons.",
            "Make your business plan.",
            "Secure your start-up capital.",
            "Choose a location.",
            "Buy equipment.",
            "Assess your staffing needs.",
            "Advertise your tanning salon.",
            "Open your doors."
        ],
        "cluster_label": 153
    },
    {
        "title": "How to Start a Retail Firework Business",
        "steps": [
            "Check the laws regarding fireworks in your area.",
            "Secure capital, or raise an initial investment.",
            "Secure a business license for your store location.",
            "Establish your business.",
            "Order your inventory.",
            "Establish prices for your merchandise.",
            "Keep it neat.",
            "Open your store.",
            "Watch the store, closely, for the first year.",
            "Advertise."
        ],
        "cluster_label": 153
    },
    {
        "title": "How to Start a Reptile Business",
        "steps": [
            "Research legal requirements.",
            "Write a business plan.",
            "Choose a location for your reptile business.",
            "Determine the best legal structure for your business and register a business name.",
            "Acquire your reptiles.",
            "Purchase additional inventory."
        ],
        "cluster_label": 153
    },
    {
        "title": "How to Start a Used Clothing Store",
        "steps": [
            "Choose a location.",
            "Decide how you will get used clothes.",
            "Determine who your target market is.",
            "Find out what licenses and permits are needed.",
            "Find out how to start a used clothing store, including how to set up your company with the IRS.",
            "Get equipment and supplies.",
            "Display your merchandise.",
            "Advertise your store.",
            "Decide on a return policy and if you are going to have a 60-90 day layaway program for larger ticket items."
        ],
        "cluster_label": 153
    },
    {
        "title": "How to Start a Pawn Shop",
        "steps": [
            "Look for a location for your pawn shop.",
            "Hire an attorney experienced in consumer law to draw up customer contracts.",
            "Furnish your pawn shop.",
            "Buy inventory to sell.",
            "Interview and hire employees.",
            "Open and advertise your pawn shop."
        ],
        "cluster_label": 153
    },
    {
        "title": "How to Start a Cheap Candy Machine Business",
        "steps": [
            "Find a vending machine.",
            "Purchase candy in bulk.",
            "Think of places to put your machine.",
            "Talk to the managers or owners of the businesses you want to place your machines in.",
            "Get advice from an attorney or accountant about how to start a candy machine business for $50.",
            "Maintain your machines regularly."
        ],
        "cluster_label": 153
    },
    {
        "title": "How to Start a Craft Store",
        "steps": [
            "Decide what to sell and how much you'll need to sell to make a profit.",
            "Start writing a business plan and a marketing plan to get a better understanding of your business and market and learn more about how to start a craft store.",
            "Find the necessary space that you will need to run your craft store.",
            "Get an understanding of the administrative and financial tasks you'll need to take care of to run your business, including bookkeeping, inventory, accounting and advertising.",
            "Create a website or online store, depending on what you are going to sell and how you are going to sell it.",
            "Get all necessary licenses for your state, municipality or location.",
            "Design a logo for your store, or hire someone to do it."
        ],
        "cluster_label": 153
    }
]