[
    {
        "title": "How to Get Gum Out of Your Hair",
        "steps": [
            "Try ice.",
            "Use an ice wrap to harden the gum.",
            "Chip the hardened gum out of your hair."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Remove Butt Hair",
        "steps": [
            "Use an epilator to pull out the hairs.",
            "Apply a depilatory cream to get rid of hairs at the surface.",
            "Trim your butt hair using an electric clipper.",
            "Consider laser hair removal for a permanent fix."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Use Veet on Your Bikini Area",
        "steps": [
            "Lay out a towel for you to sit on while you wax.",
            "Sit in a comfortable position with your legs spread open.",
            "Rub a Veet wax strip between your hands to warm it up.",
            "Peel the strips apart and set them on the towel wax-side up.",
            "Apply 1 of the strips to your skin.",
            "Rub the strip 3-4 times in the direction of your hair growth.",
            "Hold your skin taut so that it’s easy to pull off the strip.",
            "Grasp the end of the wax strip and rip it off.",
            "Continue applying wax strips until your entire bikini area is hair-free.",
            "Wipe off the excess wax using the cloths provided in the box."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Wax",
        "steps": [
            "Avoid ingrown hairs.",
            "Use baby powder.",
            "Avoid burning yourself with the wax.",
            "Make sure hair is long enough before you attempt to wax it.",
            "Don't wax the same area twice."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Wax Your Legs",
        "steps": [
            "Search for leg wax services in your area.",
            "Call to make an appointment.",
            "Show up for your appointment."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Use Wax on Your Hair",
        "steps": [
            "Start with dry, combed hair.",
            "Warm a pea-sized amount of wax between your palms.",
            "Run your fingers through your hair to tousle it.",
            "Apply another pea-sized amount to create additional volume.",
            "Use a small amount to add definition and texture to particular pieces."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Wash Coconut Oil Out of Hair",
        "steps": [
            "Choose a dry shampoo or powder to soak up the oil.",
            "Apply the powder to your roots.",
            "Comb through your hair until the powder soaks up the oil."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Shave Your Legs Out of Water",
        "steps": [
            "Spray your legs with water or use a wet towel to wet your legs.",
            "Add some stick deodorant, (NOT antiperspirant!).",
            "Squirt just a little bit of water on top of your gel/foamburst/deodrant.",
            "Now shave your legs as you normally do if you were in a shower.",
            "Use a dry cloth or towel to dry your legs and get any hair off.",
            "Once your finished use a after-shaving lotion or a body lotion to make your legs even smoother and moisturizer."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Wax Your Armpits",
        "steps": [
            "Examine your armpits in the mirror.",
            "Remove excess wax with oil.",
            "Clean the area."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Remove Hair Using Organic Ganda Beroza",
        "steps": [
            "Exfoliate your skin before removing hair.",
            "Wash your hands with soap and water.",
            "Take a small amount of solid ganda beroza.",
            "Take a pinch of the hair removal agent.",
            "Apply the pinch of ganda beroza to your body hair.",
            "Hold the unwanted hair between your thumb and index finger where you have already applied the ganda beroza.",
            "Keep repeating the procedure until all unwanted hairs are removed.",
            "Clean the skin gently.",
            "Remove ganda beroza from you fingers.",
            "Wash your hands with soap and water."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Get Wax out of Hair",
        "steps": [
            "Pour a small amount of oil into the palm of your hand.",
            "Massage the oil into the wax.",
            "Pull the excess wax free as it loosens.",
            "Wash and condition your hair in hot water."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Apply Hair Wax",
        "steps": [
            "Purchase hair wax.",
            "Apply hair wax to dry or slightly-damp hair.",
            "Make sure that you are fully-clothed when you apply the wax.",
            "Scoop out a bit of wax with your index, middle, and ring finger.",
            "Rub the wax between the tips of your fingers.",
            "Restyle your wax when necessary.",
            "Wash the wax out of your hair."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Wax With Honey",
        "steps": [
            "Wash and dry your skin beforehand.",
            "Grow your hair out first.",
            "Plan to wax often in the beginning."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Remove Hair from Your Bikini Area with Nair",
        "steps": [
            "Decide how much hair you want to remove.",
            "Clean up down south.",
            "Trim your hair.",
            "Wet the skin.",
            "Apply the Nair.",
            "Give it time to work.",
            "Rinse off the Nair in a test patch.",
            "Wash off all the Nair.",
            "Wait 24 to moisturize your skin.",
            "Maintain your bikini."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Use Hair Removing Wax",
        "steps": [
            "Warm the wax.",
            "Dip the applicator into the warm wax.",
            "Apply the fabric over the wax in the direction of hair growth, leaving enough free fabric at the end to grasp the strip firmly."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Get Slime Out of Hair",
        "steps": [
            "Remove as much slime as you can.",
            "Put goggles on the person to protect their eyes.",
            "Rub a mixture of 2/3 vinegar and 1/3 warm water into the hair.",
            "Use conditioner to rinse out the remaining slime."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Remove Wax from Wool",
        "steps": [
            "Place a plain paper bag over the wax spill area.",
            "Run an iron over the bag on medium heat.",
            "Remove the paper bag.",
            "Repeat with clean paper bags until the wax is removed."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Get Wax Off a Tablecloth",
        "steps": [
            "Freeze the dripped wax.",
            "Use a dull knife, such as a butter knife, or your fingernail to carefully scrape the frozen wax off the tablecloth.",
            "Remove the wax with heat."
        ],
        "cluster_label": 863
    },
    {
        "title": "How to Remove Wax from Concrete",
        "steps": [
            "Prepare the cleansers.",
            "Use a putty knife or similar scraper to remove as much wax as possible.",
            "Place a terry towel rag over the top of the wax.",
            "Set the hair dryer to its hottest temperature.",
            "Wipe up the melted wax with the mineral spirits and a rag or kitchen paper towel.",
            "Repeat if needed."
        ],
        "cluster_label": 863
    }
]