[
    {
        "title": "How to Memorize Numbers",
        "steps": [
            "Learn the rules.",
            "Choose numbers that work with this method.",
            "Create simple math problems to help you remember numbers."
        ],
        "cluster_label": 2565
    },
    {
        "title": "How to Be a Science Tutor",
        "steps": [
            "Go to school at the level that you wish to tutor.",
            "Take courses on the subjects that you want to tutor.",
            "Complete tutor training.",
            "Be aware of interactions with your students."
        ],
        "cluster_label": 2565
    },
    {
        "title": "How to Understand Logarithms",
        "steps": [
            "Know the difference between logarithmic and exponential equations.",
            "Know the parts of a logarithm.",
            "Know the difference between a common log and a natural log.",
            "Know and apply the properties of logarithms.",
            "Practice using the properties."
        ],
        "cluster_label": 2565
    },
    {
        "title": "How to Add and Subtract Integers",
        "steps": [
            "Learn how to add a negative and a positive number.",
            "Learn what to do if this turns into a subtraction problem with a smaller number first.",
            "Learn how to add two negative integers.",
            "Learn how to subtract a negative integer."
        ],
        "cluster_label": 2565
    },
    {
        "title": "How to Count to 100 in American Sign Language",
        "steps": [
            "Learn how to sign the numbers 1-5.The numbers 1-5 are just like counting on your fingers.",
            "Learn how to sign the numbers 6-9.",
            "Learn how to sign the number 10.",
            "Learn how to sign the numbers 11-15.",
            "Learn how to sign the numbers 16-19.",
            "Learn how to sign the number 20.",
            "Learn how to sign the number 21.",
            "Learn how to sign the number 22.",
            "Learn how to sign the numbers 23 and 25.",
            "Learn the signs for the number 24 and the numbers 26-29.",
            "Learn how to sign the numbers which are evenly divisible by ten(such as 30,40,50).",
            "Practice signing 30-99.",
            "Learn how to sign the number 100."
        ],
        "cluster_label": 2565
    },
    {
        "title": "How to Teach Prime Numbers",
        "steps": [
            "Get a number chart.",
            "Have your child or students cross off all multiples of 2 that are greater than 2.",
            "Have them cross off all multiples of 3 that are greater than 3.",
            "Move on to all the multiples of 5 greater than 5.",
            "Have them cross off all multiples of 7 starting with 14.",
            "Ask them to strike out the multiples of 11 and 13 as well.",
            "Look at what's left.",
            "Discuss that 0 and 1 are neither prime or composite.",
            "Ask how many prime numbers are even."
        ],
        "cluster_label": 2565
    },
    {
        "title": "How to Learn Uyghur",
        "steps": [
            "Label items around your home in Uyghur.",
            "Converse with native speakers in person or online.",
            "Cook Uyghur recipes and learn the names of the ingredients.",
            "Stream Uyghur music online.",
            "Read and watch news and radio in Uyghur."
        ],
        "cluster_label": 2565
    },
    {
        "title": "How to Learn Numerology",
        "steps": [
            "Sign up for a numerology e-newsletter.",
            "Practice creating numerology charts for people you know.",
            "Learn about more advanced numerology techniques.",
            "Teach your friends how to make numerology charts.",
            "Join a numerology group in your area."
        ],
        "cluster_label": 2565
    },
    {
        "title": "How to Do Numerology",
        "steps": [
            "Explore Pythagorean, or Western numerology.",
            "Investigate Gematria, Jewish mystical numerology.",
            "Learn about Chaldean numerology."
        ],
        "cluster_label": 2565
    },
    {
        "title": "How to Know What Repeated Numbers in Numerology Mean",
        "steps": [
            "Recognize that there is no \"this means that\" simple answer.",
            "Understand that it’s common for a person to have a fixation with certain numbers that are significant in his/her personal numerology charts, before even knowing anything about the chart.",
            "Understand that numbers have specific meanings to a numerologist, and these circumstances are a personal concern--you would have to relay under what circumstances and when you see the numbers."
        ],
        "cluster_label": 2565
    },
    {
        "title": "How to Become a Rubik's Cube Speed Solver",
        "steps": [
            "Watch video tutorials on the internet to learn speed techniques.",
            "Learn different methods and theories.",
            "Use cube solving programs and software.",
            "Join an online speedcubing community.",
            "Attend and enter competitions to learn speed solving techniques in person."
        ],
        "cluster_label": 2565
    },
    {
        "title": "How to Understand Basic Basket Weaving Techniques",
        "steps": [
            "Start by understanding some basic terms:.",
            "Be familiar with under-and-over-weaving.",
            "Note that double weaving is the same form but two weavers are used at once.",
            "Note that pairing may be used with an odd or even number of spokes.",
            "Identify the triple twist."
        ],
        "cluster_label": 2565
    }
]