[
    {
        "title": "How to Read Engineering Drawings",
        "steps": [
            "Familiarize yourself with the scale of the drawings.",
            "Understand the basic symbols used in the engineering drawings.",
            "Look for circled numbers.",
            "Identify specific abbreviations.",
            "Work with colleagues."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Transfer a Hand Drawing to a Computer",
        "steps": [
            "Ensure optimal lighting.",
            "Take a photo of your drawing.",
            "Transfer the photo to the computer.",
            "Convert drawing to a vector using a tracing software.",
            "Import to a free photo-editing software."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw a Hand",
        "steps": [
            "Sketch a box to serve as the main shape of the palm and add a wedge on one side to serve as the base for the thumb.",
            "Sketch a circle for each finger that will connect to the palm.",
            "Sketch cylinders and spheres to build the shape of each finger.",
            "Sketch the shape of the hand using the basic shapes as a guide.",
            "Draw the outline over the sketch to finalize the drawing.",
            "Erase and remove the sketch marks.",
            "Add color."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Figure out What You Should Draw",
        "steps": [
            "Figure out your style.",
            "Sketch or doodle.",
            "Daydream.",
            "Read.",
            "If you don't have anything yet, try the Internet.",
            "Remember to be confident when you are drawing."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw a Grasshopper",
        "steps": [
            "Draw the basic shapes of your grasshopper.",
            "Draw shapes for the upper legs and angled lines for the lower legs/antennae.",
            "Fine tune the lines and remove the guidelines that you made before.",
            "You're done!.",
            "Finished."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw Letters",
        "steps": [
            "Draw 3D letters.",
            "Write in calligraphy.",
            "Attempt some ancient-looking letters.",
            "Draw bubble letters.",
            "Try writing like a tagger."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw for Yourself",
        "steps": [
            "Keep a notebook, a piece of computer paper, or even a spare scrap of paper on you so you can draw whenever you want to.",
            "Don't care.",
            "Reserve judgment on your own work, at least until after it is done.",
            "Remember that there are no right or wrong ways to draw."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw Concept Art for a Game",
        "steps": [
            "Decide if you want this character to be a male or a female (or a robot, or an animal, etc.).",
            "Start drawing.",
            "Color them in.",
            "Start designing the character itself.",
            "Go past steps 2, 3 and 4 for the objects.",
            "Try out your objects with the character."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw a Broom",
        "steps": [
            "Draw a \"skeleton\" for your broom.",
            "Outline the broom's body over the “skeleton.” Draw the broomstick over the upper longer part and the broom itself over the lower shorter part.",
            "Sketch the shape of the broom, putting in details like bristles.",
            "Strengthen the outer line and you're done.",
            "Finished."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Think of What to Draw",
        "steps": [
            "Try another activity before starting to draw.",
            "Don’t limit yourself to one medium.",
            "Draw everyday."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw a Sword",
        "steps": [
            "Drawing lightly, sketch the shape of the sword you have in mind.",
            "Sketch additional details for the blade handle and guard (if any).",
            "Create finer details using a sharper tipped pencil or sketching tool.",
            "Draw the final outline over the sketch.",
            "Erase and remove the sketch marks to produce a clean outlined drawing.",
            "Add color or shading to the drawing if needed."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw a Lake",
        "steps": [
            "Look at photographs of lakes for inspiration.",
            "Instead, decide how much space you'd like the lake to take up, and roughly what area it would encompass.",
            "Decide where you would like this lake to be set.",
            "Lakes often are surrounded by water plants with thin blades.",
            "Trees are great addition to lake scenes, so learn how to draw different types of trees with leaves.",
            "Draw animals!.",
            "Decide what time you would like your drawing to be set, and draw in the sky.",
            "Don't forget to add in the lake's reflection!."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw Graffiti Letters",
        "steps": [
            "Draw the outline sketches for the letters.",
            "Add the actual lines for the graffiti designs on the letters.",
            "Erase the unnecessary lines.",
            "Fill in the basic color.",
            "Add the highlights and shadows.",
            "Instead of adding shadows,  choose a bright color that is contrasting the colors of the letters.",
            "Add more designs on the background to finish the graffiti."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw Like a Pro",
        "steps": [
            "Express yourself.",
            "Look at the work of other artists.",
            "Learn basic drawing practices.",
            "Draw different versions of what your idea looks like.",
            "Create scenes: a bedroom, a farm, or a school with kids in it.",
            "Do not let anyone tell you what not to draw.",
            "Draw a lot.",
            "Do not get discouraged."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw From Your Imagination",
        "steps": [
            "Think of an interesting subject that would look quite realistic.",
            "Be inspired.",
            "Start with using basic shapes then start adding more detail.",
            "Do a rough draft.",
            "Draw every detail needed in your picture so you could see that it looks realistic.If your subject is a clown, be sure to draw some eyes and ears that look clownish.",
            "Sketch in an environment.",
            "Put some clothes on your character.",
            "Make a line in between the walls so there will be equal to three walls.",
            "Sign your name and write your age at the bottom and make it the size that it's not too big and not too small.",
            "Finished."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw",
        "steps": [
            "Sketch a simple object from life.",
            "Try your hand at drawing cartoons if you have a playful style.",
            "Draw a picture of your favorite animal to practice detail."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Illustrate a Book",
        "steps": [
            "Find a book you want to illustrate.",
            "Begin sketching images.",
            "Decide on a style.",
            "Draw and redraw each image.",
            "Scan your images into the computer.",
            "Consider sharing your work."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Draw a Robot",
        "steps": [
            "Draw quick sketches of robots.",
            "From your drawings, choose a design you like the most.",
            "Draw your line art.",
            "Erase your silhouette drawing and add finer details, like the wires, cables, design on the head and chest, etc.",
            "Color your drawing.",
            "Finished."
        ],
        "cluster_label": 1779
    },
    {
        "title": "How to Make a Sculpture",
        "steps": [
            "Make a sculpture sketch.",
            "Carve the basic form.",
            "Use a pointing machine.",
            "Carve in the details.",
            "Sand down your sculpture.",
            "Done!."
        ],
        "cluster_label": 1779
    }
]