[
    {
        "title": "How to Become a Hockey Coach",
        "steps": [
            "Learn the rules of the game.",
            "Don't limit your abilities to coaching the way you think hockey should be played.",
            "Use 5 or 6 practice drills to enhance timing and conditioning of players.",
            "Learn each player's attributes.",
            "Take the time to talk to each player individually and in groups to fully understand what they want to achieve on the ice.",
            "Assign an assistant coach for working individually with players that need more work on skills or understanding the plays or position.",
            "Develop a team spirit and maintain that spirit throughout the season- no matter of wins or losses.",
            "Be prepared to devote hours to making practice plans for the ice time that is available to you.",
            "Be prepared to explain to parents/ guardians/ agents why you are making the decisions for the play of each player on the team.",
            "Have fun on and off the ice with players."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Coach Swimming",
        "steps": [
            "Get any required training and certification.",
            "Study the rules and regulations for your league.",
            "Join a swim coaching organization.",
            "Read and watch materials on swim coaching.",
            "Be yourself as a coach."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Coach a Sports Team",
        "steps": [
            "Build the following skills when you work towards becoming that 'good sports coach:.",
            "Recognize your strengths and be smart enough to seek help when you need it or delegate work.",
            "Be observant towards every detail.",
            "Know that coaching is about the athlete and needs to essentially be athlete-led and so, in that sense, you should not perceive yourself to be the boss.",
            "Adopt suitable styles commensurate to the needs of the athletes.",
            "Play video games in \"coach mode\" or \"manager mode\".",
            "Get to know your team.",
            "Teach your pitcher a new pitch.",
            "Teach your QB a way to get out of a jam.",
            "Realize that winning isn't everything.",
            "Keep consistently rising up this mountain, then you could be in the pros one day!."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Manage a Youth Sports Team",
        "steps": [
            "Get the team roster down.",
            "Get the 911.",
            "Understand your goals.",
            "Ask for volunteers.",
            "Create the master schedule.",
            "Figure out the budget.",
            "Build on the community  A sports team is comprised of a group of people that form a community around the common interest of sport.",
            "Do something special.",
            "Broadcast your accomplishments!.",
            "Ask for feedback."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Coach a Soccer Team",
        "steps": [
            "Have your team warm up.",
            "Pump your players up with a pregame talk.",
            "Keep your coaching to a minimum during the game.",
            "Offer pointers right after the game if a player fails to meet expectations."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Make Your Middle School Softball Team",
        "steps": [
            "Prepare for it.",
            "Whether you've played softball before or you are the star on your travel team, know that anyone can make the team.",
            "Practice until you can't practice anymore.",
            "Have your supplies.",
            "Dress appropriately.",
            "Eat well before tryouts.",
            "Get plenty of sleep.",
            "9."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Be Good at Volleyball",
        "steps": [
            "Work with a coach or trainer.",
            "Join a team.",
            "Attend summer camps or clinics.",
            "Watch volleyball matches in person and on TV."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Pitch a Fast Pitch Softball",
        "steps": [
            "Warm up every time you practice pitching to avoid injury.",
            "Increase and decrease your distance to practice your aim.",
            "Practice with weighted softballs to increase your strength.",
            "Do a speed-pitching drill to help speed up your pitching motion."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Get Along With Your Sports Team",
        "steps": [
            "Address the coach if there is an issue.",
            "Talk to them privately if there is a problem.",
            "Get your parents/guardian to contact the director if the problem persists.",
            "Make an effort to spend some more time with your teammates in a non-competitive setting.",
            "If you are getting laughed at due to your ability to play your sport make the time to get better."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Buy Softball Gloves",
        "steps": [
            "Check your existing sports clothing brands first.",
            "You might want to browse gloves online first.",
            "Go to your local sporting goods store (Dicks, etc.).",
            "Look through the selection available.",
            "Try it on!.",
            "If you need help, find a knowledgeable assistant to take you through the stock, or someone who has played for a while who has gone through this process before and can give you tips based on their experience.",
            "Unless it is second hand (in which case the next two steps don't apply), once you have bought your glove, your glove will be stiff because it has never been used, and you will have a hard time catching the softball.",
            "If breaking it in sounds like too much for you, don't worry.",
            "Start using your glove, and have fun!."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Coach Softball",
        "steps": [
            "Familiarize yourself with the rules of softball.",
            "Purchase a book on coaching softball.",
            "Attain certification if necessary.",
            "Put together a practice schedule.",
            "Meet the players and their parents.",
            "Assign each player to positions.",
            "Run specific drills at each practice.",
            "Make in-game changes calmly and between innings.",
            "Adjust your practice regimen as needed."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Buy a Girl's Softball Bat",
        "steps": [
            "Consult your coach about the right type of bat to buy.",
            "Buy a wood bat for practice, tournaments, or professional games.",
            "Choose an alloy bat for lightness, durability, and affordability.",
            "Choose a composite or hybrid bat for good balance and high performance.",
            "Decide between a one-piece or a two-piece bat.",
            "Keep your budget in mind."
        ],
        "cluster_label": 1152
    },
    {
        "title": "How to Join a Bowling League",
        "steps": [
            "Find a local bowling alley.",
            "Go to the bowling alley.",
            "Talk to someone that works there.",
            "Figure out what works best for your schedule or friends' schedules.",
            "Sign up and commit to a league.",
            "Bowl!."
        ],
        "cluster_label": 1152
    }
]