[
    {
        "title": "How to Make a Chaffle",
        "steps": [
            "Wash and grate about 1/4 of a cup of zucchini.",
            "In a small bowl, beat an egg.",
            "Add in grated zucchini, mozzarella, basil, 1/2 teaspoon salt, and pepper.",
            "Sprinkle 1-2 tablespoons of shredded parmesan to cover the bottom of the waffle iron.",
            "Spread 1/4 of the zucchini mixture into a hot waffle maker.",
            "Top with another 1-2 tablespoons of shredded parmesan and close the lid.",
            "Allow the zucchini chaffle to cook for 4-8 minutes.",
            "Remove and let cool."
        ],
        "cluster_label": 2674
    },
    {
        "title": "How to Whisk Eggs",
        "steps": [
            "Select fresh eggs when baking.",
            "Use the whisk attachment on your stand mixer.",
            "Combine eggs and sugar according to your recipe.",
            "Continue beating until the mixture is pale yellow.",
            "Check for ribboning."
        ],
        "cluster_label": 2674
    },
    {
        "title": "How to Make Egg White Waffles",
        "steps": [
            "Pour egg whites into a large bowl.",
            "Whip the egg whites in a bowl.",
            "Stir in the additional ingredients.",
            "Add in your protein.",
            "Repeat the whipping process using all your ingredients and protein powder.",
            "Turn on the waffle iron.",
            "Spray the waffle iron with cooking spray.",
            "Pour the batter slowly onto the greased waffle iron.",
            "Cook thoroughly for 1 to 2 minutes.",
            "Use a spatula to remove the waffle from the iron.",
            "Add topping and sides to your waffles, if desired.",
            "Serve and enjoy!."
        ],
        "cluster_label": 2674
    },
    {
        "title": "How to Make Waffle Cones",
        "steps": [
            "Combine the sugar, eggs, and vanilla extract in a large bowl.",
            "Get a separate medium bowl.",
            "Add the dry ingredients slowly to the wet ingredient bowl and mix until well combined.",
            "Use non-stick cooking spray onto a pizzelle iron or a non-stick pan.",
            "Add about 1 1/2 tablespoon of the batter onto the iron.",
            "Roll the hot and finished waffle around a cone-shaped mold.",
            "Remove the cone from the mold.",
            "Cook the remaining batter and create the cones.",
            "Finished."
        ],
        "cluster_label": 2674
    },
    {
        "title": "How to Cook Frozen Waffles",
        "steps": [
            "Get your supplies out.",
            "Take the grill out of the oven.",
            "Turn the oven/broiler on to medium heat.",
            "Put the grill back in the oven.",
            "Watch the waffles.",
            "Once they look golden, put your oven mitts on and take the grill back out.",
            "Flip the waffles over with a butter knife or spatula, and put the grill back in.",
            "Watch the waffles until they look cooked.",
            "Finished."
        ],
        "cluster_label": 2674
    },
    {
        "title": "How to Use a Waffle Maker",
        "steps": [
            "Make a grilled cheese sandwich.",
            "Make some quesadillas.",
            "Press fruits between a waffle maker as a substitute for grilling.",
            "Cook sliced vegetables for a quick snack.",
            "Make some pizza!."
        ],
        "cluster_label": 2674
    },
    {
        "title": "How to Make One Egg Waffles",
        "steps": [
            "Whisk together dry ingredients.",
            "Add milk slowly, beaten egg and melted butter.",
            "Beat batter for 2 minutes and drop by spoonfuls onto a well greased hot waffle iron.",
            "Bake until steaming stops.",
            "Remove waffle from iron and keep warm until ready to serve.",
            "Done."
        ],
        "cluster_label": 2674
    },
    {
        "title": "How to Make Bacon Flavored Waffles",
        "steps": [
            "Crisp the bacon slices.",
            "Transfer each piece of cooked bacon to a cooling rack or a plate lined with paper towels.",
            "Dab each slice of bacon to remove excess grease.",
            "Chop the bacon into small pieces and set aside.",
            "Use the dry ingredients for the waffle batter.",
            "Combine the wet ingredients in a separate bowl.",
            "Mix the dry ingredients with the wet ingredients.",
            "Gently fold the pieces of bacon into the mixture.",
            "Preheat the waffle iron.",
            "Add the batter to the iron.",
            "Cook the waffles.",
            "Top the waffles with decadent flourishes.",
            "Enjoy!."
        ],
        "cluster_label": 2674
    },
    {
        "title": "How to Make Waffles with a Grill Pan",
        "steps": [
            "Prepare your waffle batter.",
            "Preheat the grill pan.",
            "Using a ladle, scoop waffle batter on the grill pan.",
            "Lower the heat and let the waffle cook.",
            "Flip the waffle with a spatula.",
            "Cook the other side of the waffle.",
            "Repeat the same steps until there is no more waffle batter.",
            "Serve."
        ],
        "cluster_label": 2674
    },
    {
        "title": "How to Make Johnnycake",
        "steps": [
            "Whisk the dry ingredients.",
            "Rub in the butter and add the liquid ingredients.",
            "Knead the dough.",
            "Rest the dough.",
            "Portion the dough into balls.",
            "Heat the oil for frying.",
            "Stretch the dough balls.",
            "Place a few johnnycakes in the hot oil."
        ],
        "cluster_label": 2674
    }
]