[
    {
        "title": "How to Make Dry Ice Smoke",
        "steps": [
            "Put dry ice in a punch bowl to cool your drink down and make it smoke.",
            "Keep dry ice in Halloween decorations to give them an eerie appearance.",
            "Create large bubbles filled with dry ice smoke for a fun experiment.",
            "Attach a pipe filled with dry ice to a fog machine to make the smoke denser.",
            "Put dry ice in a heated pool or hot tub to make outdoor smoke.",
            "Use colored lights in your room to make the smoke appear a different color."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make Dry Ice",
        "steps": [
            "Combine with water to make fog-like gas.",
            "Use dry ice to carbonate liquids.",
            "Use dry ice to keep food and beverages frozen.",
            "Use dry ice to store loose food.",
            "Use dry ice to shrink solid materials.",
            "Use dry ice to kill yard pests."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Keep Ice from Melting",
        "steps": [
            "Keep the ice in a cool room or area.",
            "Use frozen ice packs to keep the ice from melting.",
            "Fill up the ice often."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Handle Dry Ice",
        "steps": [
            "Wear protective gloves when handling dry ice.",
            "Use certified food-grade dry ice.",
            "Put a piece of cardboard or newspaper between the dry ice and the food.",
            "Know the proper placement of dry ice in a freezer or refrigerator.",
            "Use containers with loose lids that are not airtight."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Create an Ice Bowl",
        "steps": [
            "Prepare the flowers or the citrus fruit rounds as follows:.",
            "Fill the 2-1/2 quart (2.3 litre) bowl half full with water using a pitcher to pour.",
            "Place the 1 quart (950ml) bowl over the flowers in the bowl and gently let it drop to the base of the larger bowl.",
            "Fill the 1 quart (950ml) bowl with ice cubes.",
            "Put the bowl arrangement into the freezer for 30 minutes.",
            "Remove from the freezer and add more flowers inside the gap, if needed.",
            "Place back in the freezer.",
            "Remove from the freezer the next day.",
            "Remove the outer bowl.",
            "Place the ice bowl onto its own platter or stand.",
            "Serve."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make Ice Candles",
        "steps": [
            "Find two different sized cans.",
            "Clean the cans well and peel off any labels.",
            "Fill the larger can with some water, then place smaller can inside of it.",
            "Fill the smaller can with enough rocks until the rim is level with the larger can's rim.",
            "Tape the rims of the cans together so that the smaller can stays in the center.",
            "Consider adding some greenery.",
            "Check the water level, then pour or add more water if needed.",
            "Freeze the water.",
            "Take the ice luminary out of the mold.",
            "Use the luminary with flameless candles."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Install an Ice Maker",
        "steps": [
            "Measure the space you have available to install the ice maker.",
            "Choose an ice maker that best fits your needs.",
            "Shop for a model of ice maker with a drain pump.",
            "Attach the ice maker to your cold water line with a compression fitting.",
            "Put the ice maker into its place under the counter."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make an Ice Pack from a Balloon",
        "steps": [
            "Find a suitable balloon.",
            "Fill the balloon with water.",
            "Tie the balloon to prevent the water from escaping.",
            "Place between 2 sheets of wax paper.",
            "Mould the ice pack.",
            "Allow to freeze.",
            "Use as needed."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make Tasty Ice Cubes",
        "steps": [
            "Add some herbs to the ice cubes.",
            "Freeze a solid food present inside the ice cubes.",
            "Add flowers to the ice cubes.",
            "Add fruit to the ice cubes.",
            "Make ice cubes from tasty liquids.",
            "Put chocolate inside the ice cubes.",
            "Color the ice cubes."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make Clear Ice",
        "steps": [
            "Fill up a bowl with water then dump a lot of salt into it to prevent it from freezing then put it in the freezer.",
            "Leave the salt water in the freezer at least 3 hours to get really cold.",
            "Boil some water, then let it cool to eliminate microscopic bubbles.",
            "Take the bowl of salt water out of the freezer to prevent the water in the ice cube tray from freezing from the top.",
            "Fill up an ice cube tray with water then float it on the salt water in the freezer which is denser than fresh water.",
            "Put the ice cube tray back in the freezer to prevent melting.",
            "Put the bowl of salt water back into the freezer so that you can skip the first step the next time you want to make clear ice cubes."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make Italian Ice",
        "steps": [
            "Pour the mixture into a shallow pan.",
            "Freeze the mixture and scrape it.",
            "Blend the mixture for smoother Italian ice.",
            "Consider using an ice cream maker.",
            "Serve the Italian ice."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make Ice",
        "steps": [
            "Understand the basic components of an ice maker.",
            "Be gentle with the dispenser arm.",
            "Change the settings every so often.",
            "Keep your freezer above -20 F (-4 C).",
            "Clean the ice bin.",
            "Finished."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make Ice Balls",
        "steps": [
            "Use insulated mugs to get clear ice balls.",
            "Add color.",
            "Freeze ingredients inside the ice balls.",
            "Make ice balls from liquids other than water."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make Homemade Shaved Ice",
        "steps": [
            "Prepare the flavouring for your shaved ice.",
            "Prepare ice.",
            "Shave your ice.",
            "Add your flavouring to your shaved ice."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make Iced Tea",
        "steps": [
            "Make sweet tea.",
            "Make lemon iced tea.",
            "Make vanilla iced tea."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make an Iced Latte",
        "steps": [
            "Try an iced tea latte.",
            "Use an instant store-bought mix.",
            "Make a simple iced latte with coffee.",
            "Customize your drink with garnishes."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make Coffee Ice Cubes",
        "steps": [
            "Pour the freshly brewed coffee into the ice cube tray.",
            "Place the ice cube tray in the freezer.",
            "Freeze the coffee liquid until solid.",
            "Add the ice cubes to your favorite iced coffee drink and enjoy."
        ],
        "cluster_label": 279
    },
    {
        "title": "How to Make Striped Iced Cocktails",
        "steps": [
            "Get yourself two ice cube trays and two different coloured drink.",
            "Use one ice cube tray for each colour.",
            "Once you've pour the spaces of the ice cube trays, you can put it into the freezer, and wait till the ice cubes to freeze.",
            "And, once they have frozen, take them out and now you're going to put the ice cubes into the freezer bags and use one freezer bag for each colour.",
            "Just tip them in, make sure you get them all out of the ice cube tray.",
            "Now, you are going to crush the ice and the best way to crush it is to use a rolling pin.",
            "It's a bit noisy!.",
            "So put the first colour first, just put a little bit.",
            "Now, if you want a bit of a smoothie, you could make a yoghurt iced cocktail."
        ],
        "cluster_label": 279
    }
]