[
    {
        "title": "How to Draw Popcorn",
        "steps": [
            "Start by drawing a rectangular shape with a narrow bottom.",
            "Draw another rectangle on the right side of the first rectangle.",
            "On top of both rectangles, sketch a curving, bumpy line.",
            "Outline the shape of the box and popcorn over the sketch.",
            "Add in color!."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Clean a Popcorn Machine",
        "steps": [
            "Turn off and unplug the machine.",
            "Remove the kettle from the unit.",
            "Boil out the kettle.",
            "Drain and rinse the kettle.",
            "Use a non-ammonia based cleaner to wipe the glass.",
            "Clean the outer surface."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Make Candy Melts Covered Popcorn",
        "steps": [
            "Prepare a baking sheet by lining it with parchment paper or a silicone baking sheet.",
            "Tip the popcorn into a large bowl.",
            "Tip the vanilla candy melts into a microwave safe bowl.",
            "Pour some of the melted candy mixture over the popcorn.",
            "Pour the remaining amount over the top of the now-coated popcorn.",
            "Tip the coated popcorn across the prepared baking sheet.",
            "Spread the sprinkles across the layer of coated popcorn.",
            "Allow the popcorn to set."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Flavor Popcorn",
        "steps": [
            "Try some caramel popcorn for a traditional treat.",
            "Pour honey butter over your popcorn if you have a sweet tooth.",
            "Mix popcorn with butter, sugar, salt, and cinnamon for a tasty treat.",
            "Make some chocolate-mint popcorn for a wintery treat.",
            "Make some peanut butter popcorn, then toss it with M&Ms.",
            "Try a tropical blend with coconut, dried pineapple, and powdered sugar.",
            "Mix up a crunchy treat with cinnamon cereal, sugar, and cinnamon.",
            "Whip up a rocky road treat with marshmallows, chocolate, and pecans."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Make Popcorn on the Stove",
        "steps": [
            "Place the oil, popcorn, and salt in a large, 6-quart, metal mixing bowl.",
            "Place the bowl on the stove and turn to medium heat.",
            "Remove the bowl from the heat and carefully remove the foil.",
            "Slowly drizzle melted butter over the popcorn, while spinning the bowl."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Make Popcorn in a Pan",
        "steps": [
            "Buy a bag of dry maize kernels.",
            "Select your biggest saucepan with a lid (a see - through one makes all the difference!.",
            "Work out how many kernels you'll need.",
            "Add your kernels to the pan (about 2 small handfuls is usually about right) and turn the stove to medium heat.",
            "Put the lid on quickly.",
            "You will soon begin to hear the kernels popping and hitting the sides and lid of the pan.",
            "Carefully take a peek under the lid.",
            "If you want sweet popcorn, take sugar or Splenda and sprinkle it over the popcorn (still in the pan).",
            "If you prefer cheddar flavoring, do the same thing as you did with the sugar!.",
            "Serve.",
            "Finished."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Make Kettle Corn",
        "steps": [
            "Play with the type of corn kernel used.",
            "Add a 1/4 teaspoon of ground chipotle and a squeeze of lime to the cooling popcorn.",
            "Add 2 tablespoons of flavored syrup along with the sugar to make any variety you could desire.",
            "Try a decadent brown sugar-cinnamon glaze.",
            "Whip up some maple-bacon kettle corn to impress any crowd."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Make Buffalo Popcorn",
        "steps": [
            "Place the popcorn in a large bowl.",
            "Cover a baking tray with waxed or parchment paper.",
            "Preheat the oven to 275° Fahrenheit or 135° Celsius.",
            "Melt the butter and buffalo sauce in the microwave.",
            "Pour the buffalo sauce mixture over the popcorn.",
            "Toss the popcorn around with your hands until fully coated.",
            "Spread the popcorn over the baking tray.",
            "Bake the popcorn for about twenty minutes.",
            "Season the popcorn with a desired amount of salt.",
            "Serve."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Colour Popcorn",
        "steps": [
            "Gather your ingredients.",
            "Melt 1 tablespoon of butter.",
            "Stir in the food colouring.",
            "Pop the popcorn.",
            "Pour the popcorn into a bowl, salt to taste, and enjoy."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Make Movie Butter for Your Popcorn",
        "steps": [
            "Pop your popcorn in coconut oil or canola oil.",
            "Add flavored salt during or after cooking.",
            "Drizzle on butter flavored popcorn topping."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Make Popcorn",
        "steps": [
            "Use a pan with a lid, preferably a lid with holes to allow steam to escape during popping.",
            "Add 3 tablespoons of vegetable oil to the pan (suggested on your package of kernels).",
            "Turn the heat to medium and add two kernels to the pan.",
            "Add the amount of kernels suggested on the bag to the pan and cover them.",
            "Gently shake the pan to keep the kernels from burning.",
            "Keep shaking while the kernels pop.",
            "Wait a second for any final pops, and then remove the lid away from you to avoid steam.",
            "Immediately pour the popcorn into a bowl, add your seasoning of choice, and enjoy!."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Make Popcorn Balls",
        "steps": [
            "Bring the brown sugar, corn syrup, and butter to a boil over medium heat.",
            "Take the saucepan off the stove, then stir in the peanut butter.",
            "Place the popcorn into a large bowl, then pour the mixture over it.",
            "Coat your hands with butter or vegetable shortening, then form the popcorn into balls.",
            "Wait for the popcorn to set.",
            "Finished."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Make Microwave Popcorn",
        "steps": [
            "Remove all the popped popcorn before trying to heat uncooked kernels.",
            "Microwave loose popcorn in a paper bag.",
            "Do not try to cook \"unpopped\" kernels for too long.",
            "Don't rely on the \"Popcorn\" setting on your microwave."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Make No Bake Pop Chow",
        "steps": [
            "Make puppy chow, no-bake cookies, and popcorn.",
            "Break the no bake cookies into pieces about a centimeter long.",
            "Add the popcorn, no bake cookies, and puppy chow together in a large bowl or container.",
            "Stir for 30 seconds."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Keep Popcorn Warm",
        "steps": [
            "Buy or rent a professional popcorn warming display case.",
            "Set up the machine and plug it in.",
            "Turn on the heat lamp for the warming case.",
            "Make popcorn using your preferred method.",
            "Dump the popcorn into the popcorn warming case."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Make a Salted Popcorn Caramel Shake",
        "steps": [
            "Put milk, ice cream and sauce into a blender.",
            "Blend for 20 seconds.",
            "Pour the mixture into a glass.",
            "Place the popcorn kernels into the brown paper bag.",
            "Fold over the edge of the brown paper bag to conceal the popcorn kernels.",
            "Place in the microwave.",
            "Microwave for 3 minutes or until last kernel pops.",
            "Put the popcorn on top of the caramel shake.",
            "Sprinkle with salt.",
            "Serve with a straw and spoon."
        ],
        "cluster_label": 228
    },
    {
        "title": "How to Use Pesto",
        "steps": [
            "Blend pesto into bread dough before baking.",
            "Combine pesto with your favorite dipping sauce.",
            "Drop a spoonful of pesto over unbuttered popcorn."
        ],
        "cluster_label": 228
    }
]