[
    {
        "title": "How to Be a Morning Person",
        "steps": [
            "Light up your morning.",
            "Try out various wake-up strategies.",
            "Exercise before breakfast.",
            "Eat a smart breakfast.",
            "Keep the new morning rhythm going once it's established.",
            "Persevere and be realistic."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Have a Winter Morning Routine",
        "steps": [
            "Figure out what time you need to wake up in the morning.",
            "Set an alarm for 15 minutes before your decided time.",
            "Consider taking a warm shower to give you energy.",
            "Select your outfit for the day.",
            "Get dressed and work your way to the kitchen.",
            "Consider have a mug of hot chocolate, tea, apple cider, or coffee to relax your body and bring you warmth.",
            "Have a wonderful winter morning and rest of the day!."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Get Into a Morning Routine",
        "steps": [
            "Evaluate your routine schedule if it gets off track.",
            "Make your routine rewarding.",
            "Address your losses.",
            "Keep a record of your routine.",
            "Enlist a buddy to help."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Have a Great Morning Routine Before School",
        "steps": [
            "Get up 10 minutes earlier than you think you need to.",
            "Make your bed so you aren’t tempted to go back to sleep.",
            "Go to the bathroom and take care of your personal needs and grooming.",
            "Get dressed in the outfit you picked out the night before.",
            "Style your hair and do your makeup if you want or need to.",
            "Eat a healthy breakfast for energy.",
            "Pack your lunch and put it in your bag.",
            "Do any morning chores once you are all ready to go.",
            "Grab your bag and head out the door to get to school on time."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Be Active Before Work",
        "steps": [
            "Prepare the night before.",
            "Set your alarm.",
            "Follow through with your workout."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Go on a Jog Every Morning",
        "steps": [
            "Set up a morning routine to wake up early!.",
            "Find out how much time you want to jog.",
            "Find out where you want to jog.",
            "Throw on some jogging clothes.",
            "Warm up!.",
            "Grab some water!.",
            "Take your iPod along with you.",
            "Shower when you're finished."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Enjoy a Sunrise",
        "steps": [
            "Wake up early enough.",
            "Get dressed and sit where you can enjoy the view.",
            "Relax.",
            "Have a light breakfast!.",
            "Watch as the sun slowly peeks out over the horizon.",
            "Listen to the sounds around you.",
            "Feel the air beginning to warm around you and enjoy the experience."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Understand Morning Sickness",
        "steps": [
            "Accept the positive side of morning sickness.",
            "Understand the causes and conditions of morning sickness.",
            "Adopt coping strategies."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Wake Up Early",
        "steps": [
            "Exercise early enough in the day.",
            "Avoid drinking caffeinated drinks at night.",
            "Get more sleep on days after you under-sleep.",
            "Avoid eating large meals before bedtime."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Be an Early Bird",
        "steps": [
            "Make sure to get at least eight hours of sleep.",
            "Know when you are going to take a shower.",
            "Put your alarm clock on the other side of the room.",
            "Freshen up in the morning.",
            "Know what you are going to wear.",
            "Read a good book or take a hot bath before you go to bed.",
            "Listening to classical music.",
            "If you hear things during the night (like crickets, dogs, snoring, etc.).",
            "Have a stuffed animal.",
            "In the morning when you are thinking, \"Just fifteen more minutes and I will get up,\" just get up!.",
            "Always leave a little bit early."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Make Yourself Wake Up",
        "steps": [
            "Expose yourself to light when you get up.",
            "Take a shower.",
            "Try caffeine.",
            "Set your alarm clock to music.",
            "Get a laugh in.",
            "Start a routine that makes your morning easier to handle."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Wake up in the Morning Successfully",
        "steps": [
            "Set up your alarm clock before you need to wake up.",
            "Place your alarm clock across the room.",
            "Leave the blinds or shades open.",
            "Turn on all the lights!.",
            "Wash your face with cold water immediately after you get out of bed or have a cold shower.",
            "Drink a glass of ice water.",
            "Plug in your headphones and play upbeat songs as you get dressed in the morning.",
            "Eat breakfast!.",
            "Massage yourself.",
            "Go for a morning run.",
            "Use peppermint toothpaste."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Feel Like Eating Breakfast First Thing in the Morning",
        "steps": [
            "Mix up your breakfast options.",
            "Try a liquid breakfast at first.",
            "Pick something you can prepare in advance.",
            "Keep some breakfast options that you can eat on the go.",
            "Have leftovers or other non-breakfast foods for breakfast.",
            "Spread your breakfast over the morning."
        ],
        "cluster_label": 652
    },
    {
        "title": "How to Make Breakfast in Bed",
        "steps": [
            "Get a tray that has small sides on it.",
            "Decide what you'll make for breakfast.",
            "Prepare the breakfast as quietly as possible, if there's a chance you might wake the person up.",
            "Pour any liquids only 3/4 of the way.",
            "Add some nice touches:.",
            "When you bring the breakfast, put it aside while you prepare the area.",
            "Turn on the television, play music, or give the person something to read while they eat.",
            "When they're done, clean up."
        ],
        "cluster_label": 652
    }
]