[
    {
        "title": "How to Dye Bleached Hair",
        "steps": [
            "Determine what color you want to dye your hair.",
            "Bring in a picture.",
            "Ask your hairdresser’s opinion.",
            "Inform your hairdresser if you have sensitivities to hair color or other chemicals.",
            "Consider getting your hair dyed at a beauty school.",
            "Make your next appointment."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Lighten Brown Hair",
        "steps": [
            "Experiment with an at-home treatment.",
            "Use lightening hair spray.",
            "Try a lightening cream.",
            "Wash your hair with shampoo for blonde hair.",
            "Get your hair colored professionally."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Mix Hair Dye",
        "steps": [
            "Choose 2 complementary colors from the same brand to mix together.",
            "Take note of the lightening strength of both colors.",
            "Combine a 1:1 ratio of the 2 hair dyes together.",
            "Follow the dye and developer mixing ratio.",
            "Write down the color combination after you have dyed your hair."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Dye Hair with Kool Aid",
        "steps": [
            "Add 3 to 4 unsweetened Kool-Aid packets to 2  c (470 mL) of hot water.",
            "Part your hair down the middle to create 2 pigtail sections.",
            "Dip the ends of each pigtail into the dye bath.",
            "Scrunch your damp strands with a paper towel to remove the excess liquid.",
            "Wrap the strands in a plastic bag if you want to let the dye soak in longer.",
            "Rinse out your hair until the cool water runs clear."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Naturally Dye Your Hair",
        "steps": [
            "Test your hair first.",
            "Do not attempt major changes with natural dye.",
            "Use caution if you've dyed your hair at a salon previously."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Get Purple Hair",
        "steps": [
            "Try to shampoo your hair as little as possible.",
            "Use a sulfate-free shampoo and cold water when you do wash your hair.",
            "Deep condition your hair every time you wash it.",
            "Boost the purple with a color refresher shampoo.",
            "Reapply semi-permanent dye every 6 weeks or as needed.",
            "Minimize your use of hot tools.",
            "Avoid chlorinated pools or wear a swim cap.",
            "Wear a hat if you'll be in the sun."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Dye Men's Hair",
        "steps": [
            "Choose a subtle color change.",
            "Select a quality hair dye.",
            "Mix the hair color with developer.",
            "Brush on the color.",
            "Rinse out."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Dye Your Hair With Coffee",
        "steps": [
            "Shampoo your hair.",
            "Brew coffee.",
            "Transfer the coffee to a large container.",
            "Rinse your hair with the coffee.",
            "Rinse your hair clean."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Dye Your Hair Neon Purple",
        "steps": [
            "Start off by washing your hair.",
            "Get out your basic hair dye tools.",
            "Before you start using chemicals (such as bleach), always make sure you're wearing clothing that you don't mind getting stained.",
            "Separate your hair into sections starting from bottom to top; almost like you're flat ironing your hair, but split into two.",
            "Tone your hair to get rid of brassiness.You can purchase toners at Sally's Beauty Supply.",
            "Now it's time to dye your hair purple.",
            "Pour out your dye into a plastic bowl and place a tinting brush in it.",
            "Cover your hair with a shower cap.",
            "Finally, wash it out with clear water and vinegar (this helps set the color) until it runs clear.",
            "Your hair is now bright purple!."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Do Bonding Hair Extensions and Hair Color in the Same Day",
        "steps": [
            "If you haven't cut the extensions to fit already, get a tape measure.",
            "Using a rat tail comb, section off the hair that you are applying the first extension, clip up excess hair, and apply the glue to the weft, then slowly apply the extension to your hair.",
            "If your are using a latex glue, use a hair dryer to dry the glue.",
            "After repeating the process until you are done, Once you are done with your extensions, You can style however you want."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Dye Hair Black Naturally",
        "steps": [
            "Wash and dry your hair.",
            "Brew 2 cups (470 mL) of dark roast coffee and let it cool down.",
            "Mix the finished coffee with conditioner and coffee grounds.",
            "Apply the coffee mixture to your hair and leave it in for 1 hour.",
            "Rinse out the coffee mixture with water.",
            "Repeat this coffee application twice a month to keep your hair black."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Lighten or Brighten Dark Hair With Lemon Juice",
        "steps": [
            "Make chamomile tea.",
            "Cut and squeeze your lemons.",
            "Add oil and cinnamon to your lemon juice.",
            "Combine your lemon juice mixture and chamomile tea.",
            "Apply to your hair before exposing it to sunlight."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Color Hair",
        "steps": [
            "Try dyeing your hair with Kool-Aid.",
            "Use hair chalk.",
            "Buy a temporary spray-on hair color.",
            "Add color with washable markers."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Color Your Hair Without Using Hair Dye",
        "steps": [
            "Try hair mascara if you want to add streaks or touch up your roots.",
            "Use hair chalk to get bright colors.",
            "Use colored hairspray as an alternative to chalk.",
            "Try colored hair gel for wilder styles.",
            "Use clip-in extensions if you don't want to use any product at all."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Dye Braids",
        "steps": [
            "Go to the salon if you don’t have experience dyeing hair.",
            "Buy boxed color.",
            "Use multiple colors on your hair.",
            "Protect yours clothes and hands from the color.",
            "Test a strand of your hair.",
            "Mix the color.",
            "Use clips to separate sections of hair.",
            "Apply the color with a brush.",
            "Wait for the color to take.",
            "Rinse out the color.",
            "Braid your hair."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Maintain Balayage",
        "steps": [
            "Purchase a touch-up kit or specific matching hair dye for your hair.",
            "Avoid washing your hair before you color it.",
            "Mix the dye with a 20-volume developer in a bowl.",
            "Protect your work surface and clothing before you use the dye.",
            "Apply the dye to your roots only for a quick root touch-up.",
            "Brush the dye onto the mid-length or ends of your hair to freshen up the lower portion.",
            "Comb the hair dye down through your hair for the balayage effect.",
            "Continue applying the dye to your hair using the applicator brush.",
            "Wait the recommended amount of time before rinsing the dye out."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Get White Blonde Hair",
        "steps": [
            "Find a professional stylist to bleach your hair.",
            "Know your budget.",
            "Research salons.",
            "Book an appointment.",
            "Bring a visual to your appointment."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Dye Pubic Hair",
        "steps": [
            "Mix 2 packets of Kool-Aid with 2 cups (470 ml) of water in a saucepan.",
            "Boil the liquid for 1 to 2 minutes over medium-high heat.",
            "Remove the pan from the heat and pour the liquid into a bowl.",
            "Use a hair applicator brush to apply the mixture to your pubic hair.",
            "Let the Kool-Aid mixture sit on your pubic hair for 15-30 minutes.",
            "Rinse the mixture off of your pubic hair with warm water and a washcloth."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Highlight Your Hair With Lemons",
        "steps": [
            "Take the sections of your hair that you want to highlight, and separate it COMPLETELY from the rest of your hair.",
            "Take a lemon and cut it in half, and then cut it into quarters.",
            "Squeeze the lemon in half over the hair that you want to highlight, while holding the hair you want to highlight AWAY from your head, as shown in image 1.",
            "Put lemon juice on everything you want highlighted.",
            "Sit out in the direct sun for 1- 1 and a half hours or until highlights are how light you like them, combing your hair occasionally.",
            "If the highlights aren't light enough, put more lemon juice on the same spots as before and sit out for another 30 minutes.",
            "Finished."
        ],
        "cluster_label": 47
    },
    {
        "title": "How to Make Tie Dye Nails",
        "steps": [
            "Buy a tie dye top coat.",
            "Apply a solid color nail polish.",
            "Brush on the tie dye top coat."
        ],
        "cluster_label": 47
    }
]