[
    {
        "title": "How to Have Fun With an American Girl Doll",
        "steps": [
            "Style your doll's hair.",
            "Do fashion fun with your doll.",
            "Play a board game with your American girl doll.",
            "Have a friend over with her American doll.",
            "Make clothing for your doll, and/or accessories.",
            "Pretend that the doll is your sister or daughter.",
            "Come up with new names for your doll.",
            "Celebrate a special occasion together.",
            "Role play.",
            "Watch videos with your doll.",
            "Play doctors and nurses."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Bleach Dark Haired Doll's Hair",
        "steps": [
            "Take off all of the doll's clothes and accessories.",
            "Rinse the doll's hair.",
            "In the container put:.",
            "Stir the mixture and then lay the doll on a flat surface.",
            "Using an application brush or your hands, apply the mixture to your doll's hair, avoiding any face paint or make up.",
            "Wrap the hair in foil for four hours or overnight.",
            "After the allotted time is over, take the aluminum foil off and rinse the hair with warm water.",
            "Allow it to dry again.",
            "After it has dried, you should see a lighter brown amongst your doll's hair."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Cut a Doll's Hair",
        "steps": [
            "Repair damaged hair.",
            "Create a new hair style.",
            "Learn a new a skill."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Untangle and Soften Doll Hair",
        "steps": [
            "Remove all items from the doll.",
            "Brush your doll's hair regularly.",
            "Avoid over-styling your doll's hair.",
            "Read manufacturer's instructions first, when possible.",
            "Be careful when washing dolls with mechanical parts."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Fix Doll Hair",
        "steps": [
            "Use caution when using water on wood or porcelain dolls.",
            "Avoid using water on doll hair made of wool.",
            "Wash human hair and mohair after removing the wig base.",
            "Clean doll hair made of yarn with fabric softener."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Make Doll Hair",
        "steps": [
            "Remove synthetic hair from the bag.",
            "Cut the synthetic hair to your desired length.",
            "Apply glue to the center of the doll’s hair.",
            "Press a sewing needle to the glue.",
            "Remove the sewing needle.",
            "Glue the hair to the doll’s head.",
            "Style your doll hair."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Get Crayon Out of Doll Hair",
        "steps": [
            "Use a gentle soap without coloring or scents.",
            "Lather the soap with water.",
            "Scrub the hair softly.",
            "Continue with each strand until all of the crayon has been removed.",
            "Rinse the hair.",
            "Let the doll's hair dry overnight."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Wash a Cabbage Patch Doll's Hair",
        "steps": [
            "Remove the clothes from around the doll's head area.",
            "Pour some warm water into a large bowl.",
            "Wash the doll's hair.",
            "Squeeze the doll's hair in one hand.",
            "Remove the doll's hair from the water.",
            "Fill the bowl again with more warm water.",
            "Remove the doll again and place back on the folded towel.",
            "Let the doll's hair air dry.",
            "Finger brush and style."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Order an American Girl Doll Without Hair",
        "steps": [
            "Visit the American Girl Website.",
            "Click on the \"Shop\" tab (click to agree that you are 18 years or older; even if you aren't, you're not buying anything via the website anyway).",
            "Scroll down on the \"Shop\" page and click the \"Doll Hospital\" tag under \"Let Us Help You,\" a tiny section at the bottom.",
            "Scroll down on the page until you see the box explaining the American Girl dolls without hair that are available.",
            "Out of the five options available, choose which skin color and face mold variation you want.",
            "Locate the phone number provided in the box and call it.",
            "Tell the employee on the phone that you would like to order a \"Doll Without Hair.\".",
            "Let the employee guide you, but don't forget some bullet points to make sure you bring up during the conversation, if they don't first:.",
            "Place the order using a credit card.",
            "Make sure you get your order number, particularly if you don't have an online account.",
            "Your order is done!."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Properly Wash Doll Hair",
        "steps": [
            "Gather your supplies.",
            "Make sure you know where a bathroom is.",
            "Finger comb or brush your dolls hair.",
            "Prepare.",
            "Rinse.",
            "Create a soft lather.",
            "Rinse.",
            "Dry."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Wash an American Girl Doll's Hair",
        "steps": [
            "Brush your doll’s hair whenever it gets tangled.",
            "Only wash your doll’s hair once every few years.",
            "Try not to eat sticky foods or drinks around your doll.",
            "Use hair ties to tie back her hair, not rubber bands.",
            "Don’t use style your doll’s hair with gel, mousse, or heat products.",
            "Get an American Girl doll hair care kit for special supplies.",
            "Take your doll to an AG Salon for extra help."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Wash Doll Hair",
        "steps": [
            "Watch out for synthetic hair.",
            "Read manufacturer's instructions before attempting to wash doll hair.",
            "Do not wash mechanical doll's hair."
        ],
        "cluster_label": 2179
    },
    {
        "title": "How to Make a Plaster Cast of an Arm",
        "steps": [
            "Use Modroc to make a cast for a doll.",
            "Fill a plastic container with warm water.",
            "Wrap the damp strips of Modroc around the doll's arm.",
            "Allow cast to dry.",
            "Cut cast off using scissors."
        ],
        "cluster_label": 2179
    }
]