[
    {
        "title": "How to Melt Hard Wax Beans",
        "steps": [
            "Pour the wax beans into a microwave-safe glass or bowl.",
            "Set your microwave power setting to 20 percent.",
            "Heat the wax for 10 seconds, then stir it.",
            "Repeat the process in 10-second increments until the wax is melted.",
            "Reheat the wax as needed when it starts to congeal."
        ],
        "cluster_label": 427
    },
    {
        "title": "How to Use a Heat Gun",
        "steps": [
            "Use your heat gun to remove old wallpaper.",
            "Soften glue, caulk, or other adhesives with the gun.",
            "Remove old window glazing with a heat gun.",
            "Apply shrink wrap with a heat gun.",
            "Defrost frozen metal pipes.",
            "Incorporate your heat gun into arts and crafts projects."
        ],
        "cluster_label": 427
    },
    {
        "title": "How to Use Super Glue",
        "steps": [
            "Make sure the cap is fully closed before you store the super glue.",
            "Keep the super glue container in an airtight bag.",
            "Place the bag upright in your refrigerator."
        ],
        "cluster_label": 427
    },
    {
        "title": "How to Use Pipe Joint Compound",
        "steps": [
            "Use a pipe joint sealant for major plumbing projects.",
            "Seal gas lines.",
            "Stick to low temperature systems.",
            "Double up on sealants in high-stress areas."
        ],
        "cluster_label": 427
    },
    {
        "title": "How to Make Surf Wax",
        "steps": [
            "Pour the wax into a tin or container.",
            "Let the surf wax harden.",
            "Use the wax or close and store the container."
        ],
        "cluster_label": 427
    },
    {
        "title": "How to Wax Traps",
        "steps": [
            "Put a smaller pot inside a larger pot with boiling water.",
            "Melt 5 pounds (2.3 kg) of trap wax in the second pot.",
            "Put the trap in the wax for 2-3 minutes.",
            "Hang the trap to cool and dry it."
        ],
        "cluster_label": 427
    },
    {
        "title": "How to Make a Seal",
        "steps": [
            "Get a smooth, heat-safe surface.",
            "Allow the hot glue gun to heat up first.",
            "Make a coin-sized glob of hot glue on your work surface.",
            "Wait for the glue to cool for about 30 seconds.",
            "Press the stamp into glue, wait 30 to 60 seconds, then pull the stamp away.",
            "Wait for the wax seal to cool all the way, then peel it off.",
            "Paint the stamp using acrylic paint.",
            "Use the wax seal."
        ],
        "cluster_label": 427
    },
    {
        "title": "How to Singe Paper",
        "steps": [
            "Place your paper on a heat-resistant surface.",
            "Rub the edges of the paper with lemon or lime juice.",
            "Hold a heat gun near the edge of the paper.",
            "Heat the paper until the edges begin to look burnt.",
            "Finished."
        ],
        "cluster_label": 427
    },
    {
        "title": "How to Make Skate Wax",
        "steps": [
            "Choose pure paraffin and beeswax to make better skate wax.",
            "Add the paraffin and beeswax to a metal pot.",
            "Melt the ingredients together over medium heat.",
            "Add candle dye if you wish to color your skate wax.",
            "Pour the wax into container or molds to shape into finished bars.",
            "Leave the wax in the refrigerator overnight until it solidifies."
        ],
        "cluster_label": 427
    },
    {
        "title": "How to Use a Wax Seal",
        "steps": [
            "Place a sealing wax tube into a large hot glue gun.",
            "Let the glue gun heat up fully.",
            "Squeeze a dollop of the melted wax onto your paper.",
            "Press the seal into the wax for 5 to 10 seconds."
        ],
        "cluster_label": 427
    }
]