[
    {
        "title": "How to Celebrate Christmas While Traveling",
        "steps": [
            "Find out whether there are Christmas celebrations happening where you are.",
            "If you're in a country that is not predominantly Christian, there are still often Christmas celebrations but you'll need to find out where the Christian communities are holding these.",
            "Even if you don't find any local celebrations, this doesn't prevent you and your companions from celebrating Christmas in your own way while traveling.",
            "Gather your friends/family.",
            "Consider taking a Christmas memento with you.",
            "Try to link up with family back home.",
            "Give yourself a gift.",
            "Enjoy the opportunity to celebrate Christmas somewhere different.",
            "Take a note from Scrooge."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Host a College Christmas Party",
        "steps": [
            "Give guests plenty of time to plan for the party.",
            "Give the party a theme.",
            "Get lost in the spirit.",
            "Prepare food at the right time.",
            "Keep the drinks simple, tasteful, and decorative.",
            "Set the mood for the party with a Christmas mix.",
            "Show that the party is about the guests, not the hosts."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Get Prepared for a Christmas Party",
        "steps": [
            "Start getting ready in good time.",
            "Decide what clothes you are going to wear based on the dress code of the party, or the venue, if applicable.",
            "Pick out what jewelry you plan on wearing to the Christmas party (if any).",
            "Stay festive!.",
            "Lay out all of the products you will use on your hair when you get out of your shower.",
            "Lay out all of your make-up that you will use that night, if applicable.",
            "Take a shower or a bath or have a good wash. Wash your hair too, if you like.",
            "Get dressed in a pair of sweats if you do not think you can get ready without getting something on your party outfit.",
            "Dry, brush and style your hair.",
            "Apply your make-up if you are wearing some for the party.",
            "Put on all your finishes touches.",
            "Gather everything you need to take with you.",
            "Remember that everyone is going with the intention to have fun."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Prep for The Holidays",
        "steps": [
            "Make a gift list in the summer.",
            "Place \"stocking stuffer bags\" in the back of your closet.",
            "Check your yearly credit score before the holidays.",
            "Make a budget throughout the year that pays off your credit cards before holiday shopping starts.",
            "Look out for zero percent annual percentage rate credit card, if you are in the market to increase your credit amount.",
            "Budget your holiday shopping."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Sneak Around Your House on Christmas Eve",
        "steps": [
            "Make a map of your house.",
            "Try to get an hour or two of sleep at least!.",
            "Stay awake for about half an hour after your alarm goes off.",
            "When you get up, creep around your room, and practice.",
            "Watch out for creaks and everything you labelled!.",
            "To have a look at presents that aren't your main ones, open only the bottom and make sure when you place it down you can't see what you opened.",
            "Return upstairs and keep yourself occupied."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Host a Christmas Cookie Exchange",
        "steps": [
            "Learn that a cookie exchange party is a clever way to encourage the spirit of giving, plenty of warm wishes and lots of fun throughout the day.",
            "Send out invitations to your guests at least before the date of your cookie exchange.",
            "Notify those whom are signed up of who is coming, how many people will be there, and how many cookies they will need to bring.",
            "Request that everyone only makes holiday cookies or expand your collection to include other goodies such as home made candy, chocolate covered pretzels, or other festive sweets.",
            "Have everyone tell stories.",
            "Swap family recipes."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Celebrate a Warm Weather Christmas",
        "steps": [
            "Go for a post-dinner walk or hike.",
            "Hit the beach for a unique, relaxing Christmas.",
            "Head to an ice-skating rink for a taste of cold.",
            "Celebrate with local warm weather traditions if you're traveling.",
            "Go to a Christmas festival or lights celebration."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Celebrate a Public Domain Christmas",
        "steps": [
            "Decorate using public domain Christmas art.",
            "Play or sing public domain Christmas music (songs, hymns, and instrumental).",
            "Cook public domain Christmas or holiday recipes.",
            "Make art and crafts with public domain art and patterns.",
            "Watch public domain Christmas movies.",
            "Read public domain Christmas stories."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Have a Twilight Themed Halloween Party",
        "steps": [
            "Decide who is invited to your party.",
            "Decide on a date (31st October?!).",
            "Sort out costumes.",
            "Buy a CD of music to play over the party.",
            "Start buying food.",
            "Decorate your house.",
            "Set out all your costume the night before the party, to ensure it's all ready for the big day.",
            "Play the CD while your guests arrive.",
            "Play Twilight-themed games.",
            "Have a Twilight trivia game!.",
            "Give prizes for the best costumes, and the people who act most like their characters."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Have a Christmas Party",
        "steps": [
            "Play plenty of Christmas songs and carols.",
            "Play holiday movies for a cheap, continuous form of entertainment.",
            "Host a gift exchange at a small party.",
            "Ask guests to come in Christmas costumes for a contest.",
            "Decorate Christmas cookies or gingerbread houses to make tasty treats.",
            "Decorate ornaments for a crafty activity."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Raise an Eco Friendly Child",
        "steps": [
            "Take the birthday boy or girl out somewhere they enjoy such as a theme park or the zoo, that way the things they did have more significance than the gifts they're given.",
            "Ask Santa to bring your children presents in a reusable gift bag rather than poor-quality wrapping paper.",
            "Be prudent on the presents.",
            "Encourage Christmas cards and decorations to be homemade.",
            "Try making a vegetarian or vegan alternative to the Yule turkey.",
            "Use a real Christmas tree instead of an artificial \"fake fir\".",
            "Decorate the tree with natural or homemade decorations such as pine cones, a cardboard angel, and red berries.",
            "Buy a plastic Christmas tree!.",
            "Rather than wasting chicken eggs for this special occasion, find some large smooth stones that resemble eggs.",
            "Hide the eggs as part of an Easter egg hunt or roll them down the hill to commemorate the stone of Jesus Christ's tomb being rolled away to let him live again.",
            "Be conservative when making the costumes.",
            "Give out healthier sweets like packets of raisins or apples to visitors, and only if you feel they deserve a treat.",
            "Don't buy the cards- make them!.",
            "Try incorporating the story of St. Valentine into the day.",
            "Instead of buying something for your lover, you could give them something more significant."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Hold a Christmas Scavenger Hunt",
        "steps": [
            "Get out several sheets of paper and a colorful writing utensil.",
            "Plan out your clue locations.",
            "Write your clues.",
            "Spread the clues from all the clue-papers all around the house.",
            "Don't try to place your clues in spots where you don't want your children to be.",
            "Reveal the coveted surprise in the last room.",
            "Gather your children and let them try out your scavenger hunt."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Host a Children's Christmas Party",
        "steps": [
            "Begin by preparing a list of children to invite.",
            "Enlist teenagers or other adults to help supervise the party.",
            "Choose the menu you will serve.",
            "Plan games and activities.",
            "Find Christmas music.",
            "Pick decorations.",
            "Buy or make invitations.",
            "Send the invitations out early - around Thanksgiving."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Throw a Cookie Exchange Party",
        "steps": [
            "Invite your friends and neighbors.",
            "Bring enough cookies for everyone attending.",
            "Remind people to bring containers.",
            "Bake your cookies a few days before your cookie exchange party.",
            "Set up a table where the cookies will be presented.",
            "Set out refreshments."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Have a Spa Party",
        "steps": [
            "Keep a variety of drinks available to your guests throughout the party.",
            "Provide some light party food to keep your guests from feeling hungry.",
            "Provide party favors that can be used at your pampering stations."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Make Festive Drinks",
        "steps": [
            "Try new hot drinks.",
            "Blend some holiday smoothies and milkshakes.",
            "Take an adult party to a new level.",
            "Make some holiday mentionable martinis.",
            "Add alcohol to gelatin to create festive Jello shots for your parties.",
            "Make drinks for kids."
        ],
        "cluster_label": 1089
    },
    {
        "title": "How to Talk Politics at Holiday Gatherings",
        "steps": [
            "Ask for the guest list.",
            "Speak to the host beforehand.",
            "Keep the politics out of the office holiday party.",
            "Limit your interactions with difficult people."
        ],
        "cluster_label": 1089
    }
]