[
    {
        "title": "How to Become a Hair Care Product Distributor",
        "steps": [
            "Locate a hair product company whose products you want to sell.",
            "Read over and sign the agreement the hair care product company sends to you.",
            "Ask the hair care company if they have any online or live training sessions to educate their distributors on the products.",
            "Choose a location where you can effectively sell and market the products.",
            "Develop some type of business plan.",
            "Determine a plan of displaying and promoting the products you want to sell.",
            "Advertise the fact that you are a legal hair care distributor.",
            "Stick with it when trying to be successful at hair product distribution."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Start a Skin Care Business",
        "steps": [
            "Rent a location to sell your products from a retail store.",
            "Set up a website to sell your skin care products online.",
            "Visit local stores and offer to sell your products to them wholesale.",
            "Organize skin care parties to sell your products."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Buy a Dry Cleaning Business",
        "steps": [
            "Make sure your financing is in order.",
            "Set a closing date.",
            "Pay the seller for the dry cleaning business, either in person or through his or her attorney.",
            "Announce the new ownership of your dry cleaning business and begin making whatever changes you envisioned when you decided to buy it."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Run a Bake Sale",
        "steps": [
            "Plan your bake sale.",
            "Plan what treats you want to make.",
            "Plan the prices.",
            "Plan the date.",
            "Advertise.",
            "Bake.",
            "Decorate your treats.",
            "Set up.",
            "Start your stall, and hope that people start lining up!."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Sell Final Expense Life Insurance",
        "steps": [
            "Get your life insurance license through your local state office.",
            "Get contracted with at least 4 insurance companies that sell final expense insurance at reasonable rates.",
            "Order final expense leads.",
            "Seek out final expense training.",
            "Learn how to make final expense appointments off the leads you receive.",
            "Get a GPS so you can navigate to your appointments easily.",
            "Memorize a final expense sales presentation.",
            "Watch your bank account grow."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Close a Small Business",
        "steps": [
            "Meet with your co-owners, if your business is a corporation, partnership, or limited liability company (LLC), and formally agree on the decision to dissolve.",
            "Consult your attorney regarding workers' protection rights in relation to a business closing.",
            "Reveal your intentions to your employees when closing your business.",
            "Inform your customers that you will be closing your business.",
            "Seek professional assistance and advice on dissolving a business from a lawyer, tax expert, or accountant.",
            "Ask your attorney if you need to file dissolution forms.",
            "Make sure to cancel any permits, registrations, and licenses associated to the business.",
            "Fulfill all tax requirements by contacting the IRS and closing out your Employer Identification Number (EIN) account.",
            "Resolve all outstanding debts with business associates and close out vendor and supplier accounts."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Sell Sandwiches Commercially",
        "steps": [
            "Determine the location to sell your sandwiches.",
            "Secure proper documentation.",
            "Purchase or rent kitchen equipment.",
            "Publicize your menu items.",
            "Stock up on supplies."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Buy a Business out of Insolvency",
        "steps": [
            "Find out on what basis the insolvency practitioner has been appointed.",
            "Find out what is included in the sale.",
            "Make sure you are legally entitled to use the company name.",
            "Assess the human assets of the business.",
            "Write to all the main insolvency practitioners.",
            "Have an advisory team in place, so that when the ideal opportunity appears you are in a position to act on it.",
            "Be aware of your competition."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Buy Wholesale",
        "steps": [
            "Get a business license if you plan on reselling wholesale items.",
            "Apply for a resale certificate with your government to avoid taxes.",
            "Find a place to store what you buy.",
            "Start off with sample units until you want to buy more of a product.",
            "Order items in higher quantities to save money.",
            "Request an itemized list of what's on the pallet or truckload.",
            "Inspect shipments to make sure you received what you paid for."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Prepare a Bake Sale",
        "steps": [
            "Check your local food safety laws.",
            "Make some homemade baked goods and set up a table.",
            "Gather up some friends to help you with your bake sale.",
            "Make brightly colored signs and hang them on places you are allowed.",
            "When you are ready for your bake sale, arrive a half an hour early to set up.",
            "If you are in front of your house, have some people stand on the corner and hold a big sign for cars.",
            "Enjoy the experience."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Locate a Company",
        "steps": [
            "Collect several comprehensive guidebooks.",
            "Narrow down the search to a manageable sized region.",
            "Mark several phone numbers and addresses to attempt to contact.",
            "Contact a chamber of commerce.",
            "Contact the company directly by phone or certified mail."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Buy a Spa Business",
        "steps": [
            "Look for a good location.",
            "Research the local economy to be sure the area is growing, as some markets are greatly affected by the downsizing of local industries.",
            "Find a spa for sale.",
            "Check out the spa.",
            "Acquire financial statements.",
            "Check the lease and be sure it is transferable before you agree to buy the spa.",
            "Research license transfers.",
            "Valuate the business.",
            "Make an offer.",
            "Get a preliminary spa business sale agreement.",
            "Apply for licenses and sign lease.",
            "Sign the final business sale contract."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Buy Your Own Business",
        "steps": [
            "Define the business you want to buy.",
            "Research.",
            "Target a business.",
            "Get as much information as possible about each business on your list.",
            "Begin negotiating the price.",
            "Value the business.",
            "Decide how to pay for the business.",
            "Create heads of agreement.",
            "Due diligence."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Sell Your Own Business",
        "steps": [
            "Prepare your business for sale.",
            "Determine what you are selling.",
            "Prepare a list of assets which are you selling.",
            "Determine the normalized profits of the company.",
            "Determine the value of the business.",
            "Prepare a three-page summary of your business in case someone would like a little more information.",
            "Determine if you are going to prepare your business yourself or use a business broker."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Expand Your Business",
        "steps": [
            "Form an alliance with an existing business.",
            "Bid on a government contract.",
            "Look into getting your business product(s) licensed."
        ],
        "cluster_label": 292
    },
    {
        "title": "How to Organize Sales for a Craft Business",
        "steps": [
            "Research your state's sales tax.",
            "Produce a receipt for all your sales.",
            "Invest in inventory and accounting technology.",
            "Open up a business checking account and a business credit card.",
            "Enter your receipts into your spreadsheet or software program after fairs or after a week of online sales.",
            "Keep a separate spreadsheet for each venue that you sell.",
            "Reconcile your bank account, online marketplace and spreadsheet/bookkeeping records every month.",
            "Keep a regular schedule of submitting sales and income tax.",
            "Consider hiring an accountant."
        ],
        "cluster_label": 292
    }
]