[
    {
        "title": "How to Eat Healthy Around Your Friends (for Teen Girls)",
        "steps": [
            "Avoid junk food restaurants as much as possible.",
            "Have fruits and vegetables with that you can eat as a snack if your friends starting tucking into cookies or ice cream.",
            "If your friends think that they eat more healthily than you or they judge you for occasional unhealthy choices, try to ignore them.",
            "Learn about nutrition so you can make healthy choices in any circumstances.",
            "Share snacks and meals.",
            "Explain to your friends about why you sometimes have to have apparently unhealthy snacks.",
            "Try to stay friends with food too!.",
            "If you have a friend over tell them they can have what they want and if they have junk, go healthy and have a salad!."
        ],
        "cluster_label": 2657
    },
    {
        "title": "How to Get Your Child to Eat Healthy Lunches at School",
        "steps": [
            "Ask your child what they usually like to eat for lunch.",
            "Work together on a list of nutritious lunch options.",
            "Get your child to help you pack lunch for the day.",
            "Try creative options to encourage your child to eat.",
            "Cut up fruit and vegetables so they're easier to eat.",
            "Make nutritious swaps instead of cutting out foods completely.",
            "Include a treat every once in a while."
        ],
        "cluster_label": 2657
    },
    {
        "title": "How to Buy Healthy Foods for Young Athletes",
        "steps": [
            "Determine your young athlete's favorite healthy foods.",
            "When you shop, look for the favorite items in bulk or on sale.",
            "If time is a factor — and it is for most busy sports families — cook several extra portions and freeze in meal-size packets or plan to consume a couple of times over the following few days.",
            "If your athlete drinks milk, consider purchasing whole milk.",
            "For snacks on the go, use transportable fruit, granola, trail mix, or meat jerky.",
            "Keep in mind that the more variety in the diet, the healthier it will be.",
            "Avoid processed \"combination\" foods.",
            "Cook the items your athlete likes simply."
        ],
        "cluster_label": 2657
    },
    {
        "title": "How to Choose Healthy Packaged Foods",
        "steps": [
            "Go for plain frozen vegetables and fruits.",
            "Choose healthy canned goods.",
            "Look for bagged fresh fruits and vegetables.",
            "Grab a healthy packaged option when you're on the go.",
            "Vary your packaged food choices."
        ],
        "cluster_label": 2657
    },
    {
        "title": "How to Use Leftover Baby Food",
        "steps": [
            "Give it to a friend or family member.",
            "Donate it to a charity organization.",
            "Feed the sick with baby food."
        ],
        "cluster_label": 2657
    },
    {
        "title": "How to Prepare Your Own Baby Food",
        "steps": [
            "Research baby nutrition needs.",
            "Put together a baby food menu.",
            "Purchase a variety of fresh fruits, vegetables, grains and poultry.",
            "Cook food items thoroughly.",
            "Puree food in different combinations.",
            "Store baby food in refrigerated containers.",
            "Keep a journal detailing your baby's eating habits."
        ],
        "cluster_label": 2657
    },
    {
        "title": "How to Make Healthy Snacks for Children",
        "steps": [
            "Look to the food pyramid to ensure that you provide your child with the necessary food groups.",
            "Realize that preparing healthy snacks for kids doesn't have to be a chore.",
            "Always involve your children in the process of preparing healthy snacks.",
            "Make healthy snacks easily accessible and convenient.",
            "Limit unhealthy snacks such as chips and soda or refrain from buying them altogether.",
            "Add variety by offering different snacks daily.",
            "Have fun when making nutritious snack foods.",
            "Join your children at snack time.",
            "Don't be afraid to teach your child to snack."
        ],
        "cluster_label": 2657
    },
    {
        "title": "How to Prepare Healthy Summer Recipes",
        "steps": [
            "Take advantage of local farmers' markets.",
            "Focus on how to make your summer cooking more healthy.",
            "Grill fruits, vegetables and fish instead of meat.",
            "Eat light.",
            "Use fruit in different ways.",
            "Use more berries in your cooking.",
            "Eat more trail mix snacks or fruits.",
            "Keep the kids happy with fruit popsicles or fruit flavored ice cubes.",
            "Re-hydrate with water."
        ],
        "cluster_label": 2657
    },
    {
        "title": "How to Snack Healthily",
        "steps": [
            "Decide that you want to have a healthy approach to eating.",
            "Plan your healthy approach around lean protein, fruits and veggies, and whole grains with healthy fats like olive oil and nuts.",
            "Revise your plan if you are still finding yourself snacking.",
            "Choose snacks from your same menu.",
            "If necessary, abstain from those foods that are causing you to stray from healthy eating.",
            "There are also very many naturally made chips and other various foods that are delicious.",
            "There are plenty of healthy snacks.",
            "Don't give up.",
            "Pack little containers full of 100-200 calories worth of fruits.",
            "Snack on things that have a low calorie content, for example, pears."
        ],
        "cluster_label": 2657
    },
    {
        "title": "How to Make Healthy Snacks As a Kid",
        "steps": [
            "Ask permission from your parents to make a snack.",
            "Ask an adult to help you out.",
            "Dress for success.",
            "Wash your hands.",
            "Find more healthy snacks.",
            "Snack responsibly.",
            "Clean up after you’re done."
        ],
        "cluster_label": 2657
    },
    {
        "title": "How to Stash Snacks in Your Room",
        "steps": [
            "Wait until your parents aren't home, are asleep, or are in their room.",
            "Go to the kitchen, or wherever the snacks are.",
            "Get the snacks you want.",
            "Sneak them up to your room.",
            "Put them in a drawer or a place where your parents won't find them.",
            "Save them for a time you need them, like staying up late at night.",
            "Always vacuum or sweep up any crumbs or leftovers from your snacks, otherwise it will attract insects and rodents."
        ],
        "cluster_label": 2657
    },
    {
        "title": "How to Choose Healthy Movie Snacks",
        "steps": [
            "Drink water during the movie.",
            "Select chewier snacks.",
            "Opt for food you need to unwrap.",
            "Bring treats you can suck on.",
            "Eat a big meal ahead of time.",
            "Share food with others.",
            "Chew gum."
        ],
        "cluster_label": 2657
    }
]