[
    {
        "title": "How to Make a Doll Head Paperweight",
        "steps": [
            "Mix your plaster of Paris in your flexible plastic cup about 1/4 cup at a time so you don’t make too much.",
            "Fill your doll head with the plaster.",
            "Let dry, then cut the old doll head in half until you can remove the cast replica.",
            "Place it on your newspaper workspace.",
            "Spray with black paint.",
            "When dry, spray with water and immediately spray with the gold spray-paint.",
            "Let dry.",
            "Place on a pile of papers or just on your desk to spark some interesting conversation."
        ],
        "cluster_label": 1799
    },
    {
        "title": "How to Make a Washer and Dryer for Dolls Using a Tissue Box",
        "steps": [
            "Select a small tissue box to make either a washer or a dryer.",
            "Cut two small slits across the middle of the plastic.",
            "Cover the box.",
            "Add switches or knobs to the washer or dryer.",
            "Give the washer and/or dryer a name.",
            "Place in the area where you've set up a doll's house."
        ],
        "cluster_label": 1799
    },
    {
        "title": "How to Make a Wax Paper Doll",
        "steps": [
            "Select an image of a face from either a magazine, clip art, or a copy of a photo.",
            "Cut off the flat bottom of a paper lunch bag.",
            "Spread the piece of paper out flat and fold in half vertically.",
            "Glue the face to the front of the sack which is the top layer.",
            "Draw the above-mentioned headdress.",
            "Give the face a neck and a body of sorts.",
            "Go over the pencil lines with a permanent black pen.",
            "Decorate your doll.",
            "Color with pencils.",
            "Hold the doll together.",
            "Stitch the doll.",
            "Cut away the excess paper.",
            "Melt the wax.",
            "Dip the doll in the wax.",
            "Enjoy your doll!."
        ],
        "cluster_label": 1799
    },
    {
        "title": "How to Make a Kachina Doll",
        "steps": [
            "Cut two slits opposite each other in a toilet paper tube — they should go about a third of the way up the tube.",
            "Make two short cuts at the ends of each slit you just made, cutting a \"T\" shape on each side of the roll (the flaps under the \"T\"s will be the legs of the doll).",
            "Curve each of the two flaps  just made into small cylinders — these will be the doll's legs.",
            "Use hot glue to attach a Styrofoam ball or a ping-pong ball to the top of the tube (this will be the doll's head).",
            "If the ball is a bit too small for the tube, make a series of cuts along the top of the cardboard tube, forming flaps.",
            "Decide the theme that your doll will represent so that you can decorate and dress your doll properly.",
            "Cover the body and legs with pieces of construction paper, felt and fabric.",
            "Decorate the figure by gluing on feathers, beads, buttons, shells, ribbons, or other decorative objects.",
            "Make a base (oval, circular, rectangular or another shape) for your doll out of thick cardboard.",
            "Use the doll's theme (that you decided on for the clothes) to design a corresponding base.",
            "Use hot glue to attach the kachina doll to its base.",
            "Take pride, you just made your own kachina doll."
        ],
        "cluster_label": 1799
    },
    {
        "title": "How to Make Paper Dolls",
        "steps": [
            "Draw a base for your doll.",
            "Laminate or line your drawing with contact paper.",
            "Cut out the doll with scissors.",
            "Create a stand for your doll.",
            "Print out some clothes that go with your template.",
            "Design and make some clothes for your doll."
        ],
        "cluster_label": 1799
    },
    {
        "title": "How to Make a Paper Dog",
        "steps": [
            "Fold a piece of paper lengthwise into 3 equal sections.",
            "Glue the last fold down with your glue stick.",
            "Fold the paper in half so the “seam” is on the outside.",
            "Fold the open edge to the bottom crease on each side.",
            "Cut out the dog’s ears and tongue and glue them into place.",
            "Draw on the eyes and nose to complete your puppet."
        ],
        "cluster_label": 1799
    },
    {
        "title": "How to Make a Paper Doll With Clothes",
        "steps": [
            "Get a piece of paper.",
            "Draw in the features.",
            "Draw a skin-tight bathing suit.",
            "Then color.",
            "After that, write the doll's name on the back.",
            "Once that's done, you can make more.",
            "Trace your doll against a window.",
            "Before you cut the outfit out, draw little strips of paper on the top of it where the shoulders go.",
            "Now you can cut it out.",
            "Then keep it all in an empty candy box.",
            "The last thing is to have fun with your paper dolls."
        ],
        "cluster_label": 1799
    },
    {
        "title": "How to Make a Figurine Out of Foil",
        "steps": [
            "Prepare.",
            "Make a skeleton for your figurine.",
            "Glue the sticks together.",
            "Cut some strips of aluminum foil.",
            "Wrap the aluminum foil tightly along the contours of the skeleton.",
            "Make the head.",
            "Brush glue all over the figurine.",
            "Add the figurine's \"skin.\".",
            "Apply more watered down glue and repeat the blotting paper wrapping at least twice more.",
            "Let the figurine dry or, if you are in a hurry, blow dry it.",
            "Paint or decorate your figurine as you wish.",
            "Voila!.",
            "Be creative and have fun with it."
        ],
        "cluster_label": 1799
    },
    {
        "title": "How to Make a Simple Paper Puppet",
        "steps": [
            "Get a paper lunch bag to use as your puppet.",
            "Paint the entire bag with acrylic paint if you want it to be a different color.",
            "Use googly eyes and yarn if you want to make a doll puppet.",
            "Make a dog or cat puppet if you love animals.",
            "Create a monster puppet if you want something spooky or silly."
        ],
        "cluster_label": 1799
    },
    {
        "title": "How to Draw an Anime Paper Doll",
        "steps": [
            "Draw the character or animal in a simple outfit like a T-shirt and shorts.",
            "When you are done with the basic doll, slide the other piece of paper on top of the doll.",
            "Draw some more outfits for the doll.",
            "To make the doll even more cool, draw the hair short like a boy and make different hairstyles like you would do the clothes.",
            "Color your doll and clothes.",
            "Touch up your doll by erasing all of the stray pencil marks and smudges.",
            "Scan your paper doll and give copies to friends or put them on a website.",
            "Glue cardboard to the shape of the doll to make it sturdier."
        ],
        "cluster_label": 1799
    }
]