[
    {
        "title": "How to Make a Sequin Egg",
        "steps": [
            "If you're using a specific design, draw this onto the egg as a guide.",
            "Place a little blob of glue onto the sequin.",
            "Continue with the remaining sequins.",
            "Done."
        ],
        "cluster_label": 1168
    },
    {
        "title": "How to Make Batik Eggs",
        "steps": [
            "Decide whether to blow the egg or simply use it hard boiled.",
            "Make the dye.",
            "Pull out the paper and discard.",
            "Draw or paint a design onto the egg with the crayon or hot wax.",
            "Pour the dye into a small dish.",
            "Dip the wax designed egg into the lightest dye.",
            "Remove the dyed egg and dry with a tissue.",
            "Light a candle.",
            "Continue with additional dyes and new wax areas if wished.",
            "Put the batik eggs on display."
        ],
        "cluster_label": 1168
    },
    {
        "title": "How to Blow Out Eggs",
        "steps": [
            "Apply decoupage glue and water over the eggs to make them last longer.",
            "Dye the eggs with food coloring for a pretty spring decoration.",
            "Draw designs with puff paint if you want eggs with texture.",
            "Use washi tape to add colorful accents to the eggshells.",
            "Attach an ornament cap to hang the eggs on a Christmas tree."
        ],
        "cluster_label": 1168
    },
    {
        "title": "How to Place a Message Inside an Egg",
        "steps": [
            "Remove yolk from the inside of the egg.",
            "Allow egg to dry before painting.",
            "Paint the outside of the egg.",
            "Create message.",
            "Roll message into a tight package.",
            "Slide the message through the larger hole on top of the egg.",
            "Package your egg message."
        ],
        "cluster_label": 1168
    },
    {
        "title": "How to Build an Egg Drop Project",
        "steps": [
            "Collect all of the materials listed below that you will need for the project.",
            "Choose a location to drop your egg.",
            "Establish your hypothesis of whether you think your created chamber will keep the egg safe from cracking once it is dropped.",
            "Open the shoe box and pad all sides of the box with facial tissues and cotton balls.",
            "Open the egg carton lid and remove two eggs from the bottom carrier tray.",
            "Place 'cartoned' egg in the padded egg chamber.",
            "Hold box at the top of the stairs and ask a friend to time and signal you to go.",
            "Open box and check to see if the egg is broken.",
            "Repeat the experiment 2 more times.",
            "Buy a presentation board and creatively display your experiment."
        ],
        "cluster_label": 1168
    },
    {
        "title": "How to Have an Egg Race",
        "steps": [
            "Make the egg race into a relay for added suspense.",
            "Add obstacles to make the egg race more challenging.",
            "Use different kinds of eggs depending on the age group.",
            "Carry the spoon in your mouth for a fun alternative to using your hands.",
            "Switch up your movements to make the walking more fun."
        ],
        "cluster_label": 1168
    },
    {
        "title": "How to Draw an Egg",
        "steps": [
            "First gather all the necessary utensils: paper, pencil, razor gum, pencil sharpener and watercolors.",
            "Over the vertical line draw three horizontal lines of different sizes delimited at each end by a small horizontal line (this will help you outline the shape of the egg).",
            "Now outline the egg shape over the “skeleton”.",
            "Add in some color."
        ],
        "cluster_label": 1168
    },
    {
        "title": "How to Embroider an Easter Egg Design",
        "steps": [
            "Get a plastic egg that will work with your design.",
            "Create a template on a sheet of paper.",
            "Stick the template onto a plastic egg.",
            "Draw dots around the template with a permanent marker.",
            "Drill holes into the egg where the dots are.",
            "Wrap some tape around the end of your string.",
            "Weave the string through the holes.",
            "Weave the string back through the holes, if desired.",
            "Consider switching to a different color for a more unique design.",
            "Tie the ends of the string together.",
            "Snap the two halves of the egg together."
        ],
        "cluster_label": 1168
    },
    {
        "title": "How to Make an Egg Carton Caterpillar",
        "steps": [
            "Cut apart an egg carton.",
            "Paint the outside of the cups.",
            "Poke two holes into the edge of the strip for the antenna.",
            "Cut a pipe cleaner in half, then feed it through the holes to make the antenna.",
            "Give the caterpillar a face.",
            "Fill the cups with damp dirt.",
            "Sprinkle grass seeds over the dirt.",
            "Cover the seeds with more dirt, then let them grow!."
        ],
        "cluster_label": 1168
    },
    {
        "title": "How to Make a Chick Costume",
        "steps": [
            "Cut a 9 inch (23 cm) circle out of white craft foam to make the hat.",
            "Glue a piece of yellow boa to the inside edge of foam shell.",
            "Hot glue the cone to a yellow pilot cap to complete the cracked egg hat.",
            "Measure your child's waist and torso with a measuring tape.",
            "Cut a strip of cardboard with sharp scissors.",
            "Cut a rectangle of felt from about 1 yard (0.91 m) of the fabric.",
            "Form a loop with the cardboard.",
            "Attach the felt to the cardboard.",
            "Trim the top of the felt to create a cracked egg edge.",
            "Strengthen the lower eggshell with quilt batting.",
            "Create a rounded bottom edge with darts.",
            "Cut 2 pieces of yellow ribbon and glue them to the bottom shell.",
            "Dress your child in yellow clothing before putting on the shell components.",
            "Tie on the bottom shell component and hat to complete the costume."
        ],
        "cluster_label": 1168
    }
]