[
    {
        "title": "How to Design Front Yard Landscaping",
        "steps": [
            "Create a basic outline of the shape of your yard.",
            "Draft multiple designs to develop a style that works for you.",
            "Select your favorite design and redraw the design with more detail.",
            "Color in your drawing to get a sense for the visual impact of your design."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Make a Hanging Gutter Garden",
        "steps": [
            "Find suitable guttering.",
            "Clean the guttering.",
            "Paint the guttering.",
            "Drill a series of small holes down the length of the gutter.",
            "Select a suitable hanging spot.",
            "Attach the guttering to the chosen spot.",
            "Add soil.",
            "Choose suitable plants.",
            "Remember to water regularly."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Make a Rock Garden in a Trough",
        "steps": [
            "Select your rocks to create the trough garden.",
            "Think about textures and the colors of your rock as you work.",
            "Pick out plants that will do well in the location that you have chosen to put your trough.",
            "Consider the “thriller, filler, and spiller” philosophy.",
            "Think about picking out plants that can survive the winter.",
            "Give your plants some space.",
            "Add a decorative mulch (optional).",
            "Maintain your rock garden."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Pebble a Garden",
        "steps": [
            "Spill the pebbles into the space dedicated for the pebble covering.",
            "Spread the pebbles over the designated area in the garden.",
            "Arrange them by hand around the plants and flowers.",
            "Cement the pebbles if necessary.",
            "Step back from the garden to assess the visual impact.",
            "Adjust where necessary and add pebbles if more are needed."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Work out Your Garden's Microclimate",
        "steps": [
            "Check which way your garden faces.",
            "Look for frost-prone parts of the garden.",
            "Check the materials or surfaces used in your garden.",
            "Consider where you live.",
            "Look to your garden soil.",
            "Consider the air circulation within your garden.",
            "Consider modifying your garden's microclimate to eliminate problems and to improve your garden."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Make a Plantable Felt Garden Box",
        "steps": [
            "Paint box and add “dirt.”  Cover the entire box with brown paint.",
            "Make carrots.",
            "Create beats using the purple and green felt.",
            "Add some strawberries.",
            "Plant your garden."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Make a Bog Garden",
        "steps": [
            "Dig out the area for your bog garden.",
            "Line the bog area.",
            "Line the liner.",
            "If you cut the bog space out of the lawn, place the pieces of turf back into the bog, facing upside down.",
            "Fill the hole.",
            "Plant with suitable bog plants.",
            "Keep watered using a hose.",
            "Fertilise with a liquid fertiliser.",
            "Weed regularly."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Design a Perennial Garden",
        "steps": [
            "Start small.",
            "Choose the ideal garden spot.",
            "Sketch a simple map of the location you have chosen.",
            "Research types of perennials and decide how much time you are willing to devote to the care and maintenance of any plants you are considering.",
            "Think about other elements you can incorporate into your garden.",
            "Consider spacing when you are researching the plants you’d like to put in your garden; many perennials multiply by themselves, so if you initially plant in every available space, your garden will soon be overcrowded.",
            "Plant groups of similar plants together.",
            "Note the growing heights of the plants you are considering.",
            "Choose perennials that have a mixture of colors, shapes and foliage.",
            "Factor in the blooming times of each perennial you want; that way you will have a colorful garden from spring until fall.",
            "Make sure your new perennial garden can be easily reached with a garden hose."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Design a Backyard",
        "steps": [
            "Prioritize the features that are most important to you.",
            "Sketch out your backyard plan to see how everything fits together.",
            "Create multi-functional areas if you have a smaller backyard.",
            "Incorporate repeating elements to make a larger backyard feel more cohesive.",
            "Start small if you're doing the work yourself."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Make a Garden Railway",
        "steps": [
            "Plan a garden space suitable for the railway.",
            "Find out who wants to get involved.",
            "Plan the track and layout.",
            "Plan the budget.",
            "Purchase suitable track and carriages.",
            "Start building the garden railway.",
            "Select your trains.",
            "Maintain the garden railway."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Prepare a Spring Garden on a Budget",
        "steps": [
            "Start with a budget.",
            "Use your own seed.",
            "Strike cuttings.",
            "Wait until frost season has cleared.",
            "Create a garden plan on paper.",
            "Keep an eye on garden sales in catalogs.",
            "Buy plants that have been reduced due to lack of adequate attention or overstocking.",
            "Make your own garden decorations.",
            "Keep it simple."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Prepare a Raised Bed Garden",
        "steps": [
            "Draw out a plan of your raised garden.",
            "Choose a location for your raised garden bed.",
            "Decide on the height of your raised bed.",
            "Decide on the size of your garden and lay out the perimeter.",
            "Assemble your garden bed frame.",
            "Level the frame.",
            "Get the base of your raised bed cleaned up before adding the topsoil.",
            "Design an irrigating system for your raised vegetable or flower garden."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Garden in a Small Space",
        "steps": [
            "Size up your space.",
            "Figure out where water will come from.",
            "Choose a purpose for your garden.",
            "Clear the clutter.",
            "Use perspective.",
            "Disguise the boundaries, or at least soften them.",
            "Use garden rooms.",
            "Make a space for people, especially the gardener.",
            "Go up.",
            "Create a focal point, or one focal point per room, if you have multiple rooms."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Create Carpet Bedding for the Garden",
        "steps": [
            "Design a pattern or design clearly by using plants that provide a solid color effect.",
            "Select good quality foliage plants for creating the carpet bedding.",
            "Choose the layout design.",
            "Choose the color combination.",
            "Plant the plants.",
            "Care for the carpet bedding."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Design a Garden",
        "steps": [
            "Choose a sunny spot.",
            "Ensure there is water nearby.",
            "Evaluate your soil.",
            "Make the garden the proper size.",
            "Decide what you’ll grow.",
            "Figure out a timeline.",
            "Sketch out a plan."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Create a Minimalist Garden",
        "steps": [
            "Decide if a minimalist garden is right for you.",
            "Gain space and use artificial highlights.",
            "Make the plants a bold feature but allow the hard landscape features tie the whole design together.",
            "Use similar materials in sculpture and furniture.",
            "Use lighting to great effect.",
            "Use water to create serenity.",
            "Get professional assistance.",
            "Use industrial elements to create a minimalist tidiness.",
            "Use horizontal juniper.",
            "Keep the symmetry front and back."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Make a Garden Gnome That Looks Like Your Husband",
        "steps": [
            "Purchase a standard garden gnome.",
            "Take the gnome’s exact measurements.",
            "Study your husband’s characteristics.",
            "Draw a basic plan on paper of how you envisage transforming the gnome into your husband.",
            "Search for mini-replicas of your husband’s distinct characteristics or items.",
            "Assemble the tools to help you create your husband-like garden gnome from the craft store.",
            "Improvise with clothing or accessories to obtain the desired result.",
            "Assemble the husband-like gnome.",
            "Place the husband-like gnome in your garden or on your lawn."
        ],
        "cluster_label": 126
    },
    {
        "title": "How to Make a Planet Model",
        "steps": [
            "Decide which planet to make.",
            "Select styrofoam (thermocol) balls.",
            "Paint your planet.",
            "Add texture or defining characteristics to your model.",
            "Prepare dowel rods if you want to make a solar system.",
            "Attach planets to the sun."
        ],
        "cluster_label": 126
    }
]