[
    {
        "title": "How to Light a Road Flare",
        "steps": [
            "Have a location in mind to place the flare before you light it.",
            "Locate the cap at one end of the flare.",
            "Look at the cap.",
            "Remove the cap, exposing the end of the flare.",
            "Hold the flare as far away from your body and face as possible.",
            "Light the flare much the same way as you would light a match.",
            "Carry the lighted flare pointed downward and away from yourself, so that no burning residues can drip back onto your hand.",
            "Replace the cap on the back end of the flare (the end that is not burning).",
            "Set the flare on the ground, away from vehicles and flammable materials and be sure that it will not roll.",
            "Make sure that the flare is extinguished before leaving the site."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Use a Flint Stick",
        "steps": [
            "Put dried grass, leaves, or paper into a small pile that will be used as tinder.",
            "Put the flint stick end near the edge of the pile.",
            "Use the piece of steel to scrape the flint roughly, causing sparks to go into the pile.",
            "Continue until the fire starts.",
            "To keep the fire going, add dry wood of gradually increasing size."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Light a Match",
        "steps": [
            "Hold the match at a slight downwards angle to keep the flame burning.",
            "Hold the match at a very low angle to get a big flame.",
            "Hold the match straight up for a small flame that fades.",
            "Be aware of the wind."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Light a Smokeless Fuel Fire",
        "steps": [
            "Find a good handful of dry kindling for the base.",
            "Make sure that the grate is clear, the ash pan is empty and the chimney has been swept within the last 12 months.",
            "Build the fire.",
            "Place the smokeless fuel of choice on the fire pile.",
            "Light the fire.",
            "Keep the ventilation clear."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Make Char Cloth",
        "steps": [
            "Gather firewood, kindling, and tinder.",
            "Build a Fire.",
            "Lay the cloth on your tinder.",
            "Light the char cloth.",
            "Spread the flame.",
            "Place the tinder under the kindling."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Light a Coal Fire in a Grate",
        "steps": [
            "Clear out the ashes and cinders from the last fire, leaving a light layer of cinders on the grate.",
            "Place two firelighters near the front of the cinders.",
            "Roll up tightly a newspaper page, then bend it in half, and twist it tight around itself again until it is about 8 or 9 inches (20.3 or 22.9 cm) in length.",
            "Repeat this with a total of 5 or 6 pages, and then place them over the firelighters in a pyramid pattern.",
            "Place the kindling over the rolled-up newspaper, also in a star-shaped/pyramid pattern.",
            "Place the pieces of coal around the outer edges of the fire, working inwards and towards the top of the pile.",
            "Fill all large gaps with smaller pieces of coal, leaving place at the front to insert the lit match.",
            "Strike the match, and insert in the gaps at the front to light the firelighter.",
            "Add coal, wood, peat (turf), or whatever other long-burning fuel you require to have a warm cozy fire for the evening."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Make a Bonfire with Lighter Fluid",
        "steps": [
            "Locate where you want to have the bonfire.",
            "Place a couple of wood in the pit, and align them at an angle so they balance against each other as shown below.",
            "Tear large pages of newspaper or gather a bunch of twigs and leaves.",
            "Set the newspaper on fire with the lighter and stick the first piece in the middle of the wood through the gap which you should have made before.",
            "Take more pieces of paper and place them at different angles in the center of the wood to spread the fire and burn the wood balancing against each other.",
            "Take the lighter fluid and carefully pour it on top wood.",
            "When you notice the fire starting to go down add additional wood onto the fire and use your stick/ metal rod and carefully move the wood around so it all is burning evenly.",
            "Repeat the process of using your stick or metal rod and carefully moving the food around, whenever you notice the fire to go down again.",
            "Finished."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Light a Fire",
        "steps": [
            "Make a circular divot in a piece of fireboard.",
            "Place the spindle into the divot of the fireboard.",
            "Rub the spindle between your hands as you apply pressure.",
            "Cut a triangular notch into the middle of the pilot hole.",
            "Put a scrap of wood under the fireboard and rub the spindle again.",
            "Transfer the coal and dust to tinder and blow it to make a fire."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Burn Wood",
        "steps": [
            "Select a safe site away from plants and other flammable material.",
            "Set up a metal barrel with a heavy mesh cover.",
            "Punch oxygen holes in the barrel with a hammer and metal punch.",
            "Wait for a calm, damp day before burning any wood.",
            "Put the wood over tinder in the center of the barrel.",
            "Light the tinder with a match or a long lighter.",
            "Drown the embers in water when you’re done burning wood."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Light a Fire With One Match",
        "steps": [
            "Find a suitable fire area.",
            "Find suitable tinder.",
            "Don't use paper matches (the ones that look like thin cardboard).",
            "Light the match firmly but carefully and cup your hand around it.",
            "Light the tinder in more than one place.",
            "If it does not burst in to flame but smolders, blow gently but consistently until it does.",
            "Put bigger and bigger sticks or leaves on until you have a raging fire with little or no smoke."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Create Fire With a Magnifying Glass",
        "steps": [
            "Create a fire with a lightweight, flat magnifying lens for a portable option.",
            "Use a lens from eyeglasses to start a fire if you have one handy.",
            "Focus the circle of heat from your lens until it’s as small as possible.",
            "Do not look directly at the hot circle if using a large focusing device."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Make a Fire With a Tissue, Sock Lint, and a Spark",
        "steps": [
            "Get a tissue.",
            "Roll it into a funnel shape with a small opening at the end.",
            "Pick lint off of your sock.",
            "Compact the lint until it is about the size of a dime.",
            "Put the lint in the small opening you made earlier in the tissue.",
            "Get a flint or magnifying glass.",
            "Get some sparks onto the lint or use the magnifying glass to make it catch on fire.",
            "Put tinder on the tissue.",
            "Gradually add on more wood and you will have a fire."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Juggle Fire",
        "steps": [
            "Become a solid three club juggler.",
            "Go someplace where the local authorities won't mind you juggling fire.",
            "Put some fuel in a bucket.",
            "Bring some equipment for safety.",
            "Shake off your torches.",
            "Light the torches.",
            "Juggle!.",
            "When you fumble a torch, let it fall."
        ],
        "cluster_label": 1527
    },
    {
        "title": "How to Make a Match Box Bomb",
        "steps": [
            "Gather the materials to make an explosive fireball.",
            "Pour all the matches out of the box.",
            "Cut off all of the match heads.",
            "Cut out the striking strips from the box.",
            "Curl the striking strip into a loop.",
            "Fill the inside area of the loop with the match heads.",
            "Wrap the structure with tape, making sure every gap is covered.",
            "Hit it or throw it hard at the ground and it should burst into flames."
        ],
        "cluster_label": 1527
    }
]