[
    {
        "title": "How to Wrap with Tissue Paper",
        "steps": [
            "Wrap the gift in a layer of tissue paper before putting it in the bag, if needed.",
            "Spread out 1-4 sheets of tissue paper depending on the size of your gift bag.",
            "Layer the tissue paper in a fan pattern if you’re using multiple sheets.",
            "Pinch the middle of the tissue paper and wave it gently through the air.",
            "Stick the tissue paper in the bag to display the crisp points.",
            "Add embellishments like gift tags or bows if desired."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Make Wedding Gift Bags",
        "steps": [
            "Purchase or make sachets.",
            "Consider embellishing the sachet.",
            "Fill with gift items.",
            "Draw closed with the drawstring or tie a ribbon around the top."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Throw a Gift Wrapping Party",
        "steps": [
            "Get creative with your embellishments.",
            "Award prizes for the best wrapped present.",
            "Set gift wrapping challenges.",
            "Disguise easy to recognize presents.",
            "Thank your guests for coming."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Make a Simple Sentimental Gift",
        "steps": [
            "Buy a tall and transparent jar or container, with a lid.",
            "Choose your layering snack.",
            "Plan how many layers you wish to make/fit into the jar.",
            "Write sentimental notes to your recipient.",
            "Make sure your layers are thick enough to cover the notes.",
            "Start layering.",
            "Wrap the gift.",
            "Be creative."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Give a Chocolate Box of Money",
        "steps": [
            "Decide how much money you want to give.",
            "Look at the shapes left inside the chocolate box.",
            "Fold or shape the notes.",
            "Place the creatively folded notes into their various spots in the chocolate box after folding.",
            "Place the protective sheet back over the top of the arranged money.",
            "Put the lid back on."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Wrap a Gift in a Vintage Handkerchief",
        "steps": [
            "Select a suitable vintage or old handkerchief.",
            "Select a suitably sized gift.",
            "Place the gift inside the gift box.",
            "Tie the top-knot in place with a piece of grosgrain ribbon or a large piece of lace.",
            "Add a finishing touch.",
            "Finished."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Wrap Presents Without Tape",
        "steps": [
            "Tie a ribbon around the present to hold the wrapping paper in place.",
            "Apply stickers along the edges to secure the wrapping in place.",
            "Use glue to secure the wrapping in place of tape.",
            "Paint nail polish along the edges to hold the paper in place."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Make a Cookie Gift Bag",
        "steps": [
            "Make the cookies.",
            "Place cookies in a cellophane bag.",
            "Measure the width of your bag and how far you want your note to go down.",
            "Fold over the top part of the bag.",
            "Fold the note in half."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Put Tissue Paper in a Gift Bag",
        "steps": [
            "Gather your materials.",
            "Wrap the present loosely in white tissue paper.",
            "Place 3 or 4 sheets of tissue paper on a flat surface.",
            "Place the wrapped gift in the center of the laid out sheets of tissue paper.",
            "Gather up the tissue paper loosely over the gift.",
            "Lift the gift from the bottom and place it in the gift bag.",
            "Add more tissue paper, if needed.",
            "Add your card and gift tag.",
            "Add any embellishments to the gift."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Make a Christmas Gift Box",
        "steps": [
            "What does the person like?.",
            "Buy materials.",
            "Go out and get the store bought gifts.",
            "Music for the Music Lover.",
            "The Christmas Card.",
            "Gather materials to make the box.",
            "Securing the box.",
            "Inserting the gift.",
            "Inserting the card.",
            "Seal the box with shipping tape.",
            "There are many methods on How to Wrap Presents.",
            "Find ribbon and a stick and a bow.",
            "If you chose to do the ribbon attachment method, skip this step."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Make a Gift Pouch from a Greeting Card",
        "steps": [
            "Cut the card along the crease or just in front of it.",
            "Measure the height of the card.",
            "Score the card horizontally along the lines you just marked.",
            "Fold along the score lines, as shown.",
            "Trace around the edge of a large, round object, such as a CD or the edge of a bowl or pot lid.",
            "Using the same object, score curves at each end.",
            "Glue the open edge closed along the tab or use clear tape to close it.",
            "Insert a small gift by opening the tube as shown.",
            "Fold the ends in along the scored curves to hold the gift in place and finish the pouch.",
            "Done."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Wrap a Gift in a Bag",
        "steps": [
            "Open the gift bag and lay it on its side on a table or surface.",
            "Scrunch tissue paper and place at the bottom of the bag.",
            "Slide gift into bag and turn bag upright.",
            "Make sure the tissue paper covers the gift.",
            "Tie the handles together with a small piece of scissor curled ribbon if the gift is small enough to accept this.",
            "Finished."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Wrap a Round Gift",
        "steps": [
            "Set the cylinder on its side in the middle of the wrapping paper.",
            "Roll and tape the short ends of the paper over the gift.",
            "Bend the top edge over one flat end of the gift.",
            "Fold a diagonal triangle crease towards the center.",
            "Make a second, overlapping diagonal crease.",
            "Repeat the creases all around the flat end.",
            "Secure the center with a piece of tape."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Wrap a Gift in Tissue and Tulle",
        "steps": [
            "Use this wrapping method for a substantial gift.",
            "Wrap the box in tissue paper first.",
            "Cut a large square or rectangle of doubled-up tulle.",
            "Begin lifting the tulle over the wrapped gift from one corner.",
            "Hold the bunched up top firmly.",
            "Slip the satin ribbon underneath the gift and bring it up the sides.",
            "Trim the ends of the ribbon.",
            "Finish off by fluffing out the tulle topping so that it stands upright and billows out over the gift.",
            "Finished."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Wrap Soap in Fabric",
        "steps": [
            "Package soap in fabric just like you'd wrap a gift box in wrapping paper.",
            "Place the soap in an organza bag with a drawstring for an easy option.",
            "Wrap round soap in fabric and secure the ends closed with a ribbon.",
            "Bundle bars of soap in cute wash cloths to give as gifts.",
            "Wrap a scrap of fabric around the center of the soap for a quick solution."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Make a Newspaper Gift Bow",
        "steps": [
            "Wrap the gift in a layer of nice newspaper.",
            "Add the newspaper bow."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Package Cookies",
        "steps": [
            "Place your cookies into a simple gift box or tin.",
            "Dress up plastic zipper-locked bags with pieces of wrapping paper.",
            "Slip cookies into a muslin wine bag for a more rustic look.",
            "Display particularly delicious-looking cookies in a mason jar.",
            "Use cellophane and ribbon to create a holiday cracker.",
            "Wrap your cookies onto individual serving dishes.",
            "Repurpose an egg carton for smaller cookies and truffles.",
            "Use paper CD envelopes to wrap individual sugar or gingerbread cookies."
        ],
        "cluster_label": 950
    },
    {
        "title": "How to Wrap Wontons",
        "steps": [
            "Balance a wrapper on a ring made with your finger and thumb.",
            "Place your filling in the center of the wrapper.",
            "Close the ring.",
            "Dab warm water around the opening and seal.",
            "Finished."
        ],
        "cluster_label": 950
    }
]