[
    {
        "title": "How to Sell Tires",
        "steps": [
            "Stock a variety of different brands.",
            "Display your tires somewhere in plain sight.",
            "Read up on the main features of your most popular products.",
            "Promote competitive prices and discounts."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Have a Successful Farm Shop",
        "steps": [
            "Look at your location with a critical eye.",
            "If your farm is not easily accessible, think about providing sales over the Internet.",
            "Examine how you are displaying your products.",
            "Create a theme for your shop and carry it through.",
            "Check your produce regularly, removing any spoiled food on a daily basis and only offering produce of a high standard.",
            "Double the shopping experience, if you have the space, by selling arts and crafts along with your farm produce.",
            "Perhaps you could open up a small cafe for light refreshments, or provide luncheons,or you could sell herbs and plants as another line?.",
            "What sets you apart from the thousands of farm shops in the country?.",
            "Finally customer service is what it is all about.",
            "People like to feel that they are getting good value for money and are important to you as their customer."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Sell a Product",
        "steps": [
            "Familiarize yourself with all aspects that feed into the end sale of a product.",
            "Market your product.",
            "Review your sales performance.",
            "Troubleshoot sales, if necessary."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Sell Items at a Farmers Market",
        "steps": [
            "Offer items that are in demand.",
            "Keep produce items fresh and on ice if necessary.",
            "Create highly visible signage to tout the key benefits of your product.",
            "Select a high-traffic location and be visible from all directions in order to sell items at a farmers market.",
            "Provide free samples.",
            "Price your items competitively with vendors who sell items at the farmers market.",
            "Differentiate yourself from others who sell similar items at a farmers market by promoting the aspects that set you apart.",
            "Be consistent with your market location and attendance when you sell items at a farmers market."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Sell Furs",
        "steps": [
            "Check with your country’s laws to see if you can sell fur pelts.",
            "Sell just to pelt to increase your overall profit.",
            "Scrape off any fat and skin if you’re selling a finished pelt.",
            "Dry your pelts on a stretcher if you plan on transporting them.",
            "Package the pelts in a ventilated container if you’re shipping the furs.",
            "Contact a Conservation Agent to see what fur buyers are in your area.",
            "Meet with a registered fur buyer to sell your pelts."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Promote Humane Farming Practices",
        "steps": [
            "Search online for grocery stores that sell products from humane sources.",
            "Purchase meat products from farms that treat animals humanely.",
            "Consider purchasing humanely farmed animal products online.",
            "Ask your local grocery stores to stock humanely farmed products.",
            "Post on social media sites about supporting humane farming."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Buy from Yard Sales",
        "steps": [
            "Find yard sales in your area.",
            "Gather supplies before you shop.",
            "Decide what time of day you want to shop.",
            "Check out the neighborhood.",
            "Read yard sale signs carefully.",
            "Examine the yard sale's presentation.",
            "Ask the seller if you are looking for a specific item.",
            "Request prices on unlabeled items before offering a price.",
            "Look over items carefully before you buy at yard sales.",
            "Avoid buying potentially hazardous items.",
            "Prepare to pay around 15 percent of an item's original price at a yard sale.",
            "Negotiate if you believe an item has been overpriced.",
            "Provide your name and number if a seller won't negotiate."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Sell Slime",
        "steps": [
            "Make sure the school allows you to sell products on campus.",
            "Avoid competition by offering unique slime at a lower price.",
            "Advertise the slime for sale.",
            "Keep track of the slime orders.",
            "Deliver the slime."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Make Bake Sale Goodies",
        "steps": [
            "Figure out what you plan to make.",
            "Go to a free recipe website.",
            "Use the tool on the site to make a different amount of baked goods.",
            "Package the goods in a container that is stable enough to make it to school or the sale's location, but is something you won't miss in your kitchen too much.",
            "Label the treats."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Save Money at a Farmers' Market",
        "steps": [
            "Research and locate both your nearest farmers' market and other nearby markets.",
            "Learn more about the farms and farmers that attend the markets.",
            "Come to the market with a flexible palate.",
            "Come to the market prepared to flatter.",
            "Offer the farmers more than cash.",
            "Add value to bulk purchases.",
            "Shop with friends or family."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Buy Corn Commodities",
        "steps": [
            "Find a commodity broker.",
            "Open an online trading account.",
            "Purchase commodities through your online broker.",
            "Decide whether to buy corn commodities on margin.",
            "Buy commodities through ETFs.",
            "Get commodities through mutual funds."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Sell Breast Milk",
        "steps": [
            "Research the online milk communities to find one that meets your expectations.",
            "Register to join the community of your choice.",
            "Get a blood test and heath screening done by your doctor.",
            "Create an engaging profile and ad for your breast milk.",
            "Store and transport breastmilk according to regulations."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Buy Things at a Flea Market",
        "steps": [
            "Search online or in the classified section of your local paper for upcoming flea markets.",
            "Do research on the type of good you will be purchasing, taking note of comparable pricing and brand names.",
            "Arrive early.",
            "Bring cash.",
            "Attend each booth or table, taking note of the items you like.",
            "Select your items.",
            "Negotiate with the vendor by requesting a lower price.",
            "Discuss the price until you and the vendor have reached an agreement."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Buy in Season",
        "steps": [
            "Check to see what’s in season in your area.",
            "Visit your local farmer’s market for fresh produce.",
            "Get seasonal food delivered by your local agricultural association.",
            "Look for in season foods at your local grocery store.",
            "Inspect produce for signs it’s not at peak freshness.",
            "Grow your own seasonal vegetables."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Price Your Product at a Farmers' Market",
        "steps": [
            "Do market research.",
            "Use consumer surveys.",
            "Get vendor information.",
            "Cover your costs.",
            "Price goods to compete.",
            "Post prices clearly.",
            "Follow all applicable rules from farmers' market creators.",
            "Keep scales handy at a booth that sells by volume.",
            "Answer price questions."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to Understand Why You Should Bring Your Kids to the Farmers Market",
        "steps": [
            "The growing number of farmers markets in the United States gives us hope.",
            "Farmers markets allow you to teach your kids that they can make a difference by voting with their dollars."
        ],
        "cluster_label": 1645
    },
    {
        "title": "How to List an Item in Your Etsy Shop",
        "steps": [
            "Go to the Etsy home page and click on More and then go to \"Sell on Etsy\" on the right hand side of the page.",
            "Make sure you're allowed to sell the item.",
            "You will see a “Open an Etsy Shop” button to press on top.",
            "Log in or create an Etsy account if necessary.",
            "Choose a name for your shop and click save, if the name already exists, you will be prompted to choose another name.",
            "Click \"List a new item\" to add an item to your shop.",
            "Fill the item form:.",
            "Once you preview your listing and are satisfied, click on \"Save & Continue."
        ],
        "cluster_label": 1645
    }
]