[
    {
        "title": "How to Prepare a Shrub Bed",
        "steps": [
            "Mark the boundaries of the bed with sticks or any available material.",
            "Chop down or pull out any tall weeds or plants to a height of two inches (5 cm) or less with.",
            "Place double layers of newspaper (only black and white-no color or glossy paper) down over the area you wish to create.",
            "Wet down the paper with water.",
            "Dump mulch or wood chippings on the area one to two inches (3-5 cm) deep.",
            "Water the mulch or wood chippings.",
            "Plant the shrubs or plants by cutting a hole (make an X with a shovel to start and pull back enough paper and mulch to create a hole).",
            "Water the plants.",
            "Remove the sticks or markers."
        ],
        "cluster_label": 345
    },
    {
        "title": "How to Make Corn Stalk Decorations",
        "steps": [
            "Procure a roll of brown Kraft paper.",
            "Unroll at least  a six foot length of paper.",
            "Curl the sheet into a roll about one and a half to two inches in outer diameter with an inside diameter of at least one inch (two finger widths).",
            "Make three eight inch cuts down from the top evenly spaced around the sleeve.",
            "Secure the bottom with glue.",
            "Twist the paper a bit, then pull the sleeve out from the top.",
            "Spray paint as desired with deep fall colors.",
            "Make 30 or so and bind them at the top and flare at the bottom to make tepee shaped corn stands as a fall church decoration."
        ],
        "cluster_label": 345
    },
    {
        "title": "How to Make a Flower from a Cigarette",
        "steps": [
            "Remove the tobacco from the paper by lightly twisting and pushing it out.",
            "Tap the paper on a surface or squeeze the paper like a toothpaste tube to make sure everything is out.",
            "Remove the cigarette filter by pinching and rubbing the filter part.",
            "Fan out the filter.",
            "Create the flower stem.",
            "Put it together.",
            "Secure them together.",
            "Finish your flower."
        ],
        "cluster_label": 345
    },
    {
        "title": "How to Make a Paper Cactus",
        "steps": [
            "Cut a disk out of Styrofoam, and wedge it into a flower pot.",
            "Roll several Styrofoam eggs across a table to flatten the sides.",
            "Assemble your cactus.",
            "Attach the cactus to the pot.",
            "Prepare your papier mâché glue.",
            "Prepare your papier mâché strips.",
            "Cover the cactus with two layers of papier mâché.",
            "Insert toothpicks into the cactus the make the spikes.",
            "Let the cactus dry completely.",
            "Paint the cactus, then let the paint dry.",
            "Add some tissue paper flowers, if desired.",
            "Add some sand, pebbles, or rice to the flower pot, if desired.",
            "Finished."
        ],
        "cluster_label": 345
    },
    {
        "title": "How to Make a Paper Flower",
        "steps": [
            "Find three sheets of colorful paper.",
            "Cut two flowers of different sizes from each paper.",
            "Stick a pipe-cleaner through the middle of the flowers.",
            "Spray perfume on the flowers.",
            "Place the flowers in a vase."
        ],
        "cluster_label": 345
    },
    {
        "title": "How to Make a Paper Garland",
        "steps": [
            "Gather at least 10 pieces of text weight paper.",
            "Trace flower patterns onto the paper.",
            "Cut the patterns out of the paper.",
            "Shape the flowers.",
            "Shape the leaves.",
            "Create a pattern with the petals and leaves.",
            "Thread a needle through the shapes.",
            "Add a small pompom (or beads) in the middle of the flower.",
            "Hang up your garland."
        ],
        "cluster_label": 345
    },
    {
        "title": "How to Make Paper Tropical Flowers",
        "steps": [
            "Trace your hand onto a sheet of paper, then cut it out.",
            "Decorate the handprint to look like a lily.",
            "Overlap and glue the side edges together to make a cone.",
            "Wrap the fingers on your lily 1 at a time around a pencil.",
            "Cut a pipe cleaner into thirds, then add a pony bead onto each end.",
            "Twist the mini pipe cleaners onto a green pipe cleaner.",
            "Poke the stem down through the flower and secure it with hot glue."
        ],
        "cluster_label": 345
    },
    {
        "title": "How to Make a Paper Lei",
        "steps": [
            "Cut plastic party straws into 1 inch (2.5 cm) lengths.",
            "Create a basic flower design template on paper.",
            "Poke string through the hole of the flower, then thread it through a straw.",
            "Adore your own lei creation!.",
            "Finished."
        ],
        "cluster_label": 345
    },
    {
        "title": "How to Make Papier Mâché Flowers",
        "steps": [
            "Gather some scrap cardboard.",
            "Draw a large leaf shape.",
            "On a separate piece of cardboard draw and cut individual flowers petals.",
            "Using a Hot Glue Gun position and stick the petals onto the leaf shape.",
            "Mix some papier mâché paste using Flour, Water, and Salt.",
            "Rip some Paper Towel or Kitchen Towel into small squares.",
            "Papier mâché the flower with 2 layers.",
            "Once dried gather some acrylic paints.",
            "Seal your flowers using regular varnish.",
            "Decorate with sequins or Hot Glue a pom-pom to the centre of the flower.",
            "Finished!."
        ],
        "cluster_label": 345
    },
    {
        "title": "How to Make Tissue Paper Flowers",
        "steps": [
            "Choose several sheets of colored tissue paper for your flower.",
            "Cut out 120 teardrop-shaped petals.",
            "Cut and bundle 30 pieces of floral wire to make the flower’s base.",
            "Spread out the wires at the top.",
            "Hot-glue the petals to the wires.",
            "Fluff up the petals."
        ],
        "cluster_label": 345
    },
    {
        "title": "How to Make Lollipop Flower Pots",
        "steps": [
            "Measure the inside diameter of the flower pot.",
            "Make little posy shapes using the green tissue paper.",
            "Slip each lollipop into place in the florist's foam (or alternative).",
            "Tie a ribbon around the flower pot for the finishing touch."
        ],
        "cluster_label": 345
    }
]