[
    {
        "title": "How to Apply for a Job",
        "steps": [
            "Make sure your online presence is squeaky clean.",
            "When you do finally get an interview, be sure to dress for the job you want.",
            "Be prompt.",
            "Show interest and enthusiasm at your job interview.",
            "Refer to your notes.",
            "Employ proper etiquette."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Prepare for a Social Work Interview",
        "steps": [
            "Practice your small talk.",
            "Review the job description.",
            "Review your own qualifications.",
            "Research the agency or organization.",
            "Be able to explain why you are applying for the job.",
            "Prepare for behavioral interviewing.",
            "Anticipate questions about your career goals.",
            "Stay informed about current events in the social work field.",
            "Make a list of questions you will ask."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Give an Interview",
        "steps": [
            "Prepare responses to possible interview questions.",
            "Rehearse for the interview with a relative, friend, or coworker.",
            "Do your best to relax and be yourself.",
            "Keep your responses concise.",
            "Ask questions of your own if you’re attending a job interview."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Administer an Email Interview",
        "steps": [
            "Research your subject's background prior to developing the interview questions.",
            "Write your list of email interview questions.",
            "Send your email interview questions to the subject.",
            "Edit the email interview answers if needed.",
            "Thank your subject after the email interview has been completed."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Go to an Interview",
        "steps": [
            "Find out how long the interview will take, including travel times.",
            "Don't agree to interview times you can't keep.",
            "Ask if you can attend an interview before or after your workday.",
            "Try to fit your interview into your lunch hour.",
            "Use a vacation or sick day.",
            "Use a simple, vague excuse.",
            "Don't use an excuse that makes you look bad.",
            "Don't lie about a family member's problems.",
            "Don't make an excuse that can be easily fixed or doesn't give you enough time.",
            "Allow time to change clothes if necessary.",
            "Hire a babysitter if necessary.",
            "Don't schedule phone interviews during work."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Set Up a Phone Interview",
        "steps": [
            "Know who you want to interview.",
            "Decide when you want to conduct the interview.",
            "Know what you want out of the phone interview.",
            "Contact the other party about the interview.",
            "Come up with a list of questions or topics.",
            "Confirm the date and time the day before the interview.",
            "Choose a place to take the call."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Answer a Phone Interview Call",
        "steps": [
            "Research the company before the interview.",
            "Draft sample answers to common interview questions.",
            "Practice talking on the phone.",
            "Find a quiet place to take the call.",
            "Turn off notifications and electronic devices.",
            "Gather all your documentation.",
            "Try breathing exercises before the time of the call."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Write Interview Questions",
        "steps": [
            "Do your research on the person.",
            "Write down your objective for the interview.",
            "Lead with a “softball question”.",
            "Ask about strategies, process, methods for achieving goals.",
            "Use your knowledge to tailor specific questions.",
            "Create open-ended questions."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Conduct an Interview Via Email",
        "steps": [
            "Get the subject's approval prior to drafting questions for and sending the interview email.",
            "Write questions that are clear, concise and to the point.",
            "Refrain from asking too many questions during the email interview.",
            "Follow up with a telephone interview or additional questions via email if you need to clarify any answers provided by the interview subject.",
            "Send a note or email thanking the interview subject for taking his or her time to answer your questions.",
            "Edit the interview answers for grammar or spelling, if necessary, when writing your story or article."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Practice for an Interview",
        "steps": [
            "Find a family member or friend to help you practice.",
            "Get interview practice feedback from a professional career counselor.",
            "Sign up for a mock interview online."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Prepare for an Interview",
        "steps": [
            "Know who you are dealing with.",
            "Ask for details about the interview before it happens.",
            "Set boundaries.",
            "Prepare a list of possible answers and key talking points.",
            "Do a mock interview.",
            "Dress to impress for in-person interviews."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Relax Before an Interview",
        "steps": [
            "Research the company ahead of time.",
            "Stage a practice interview and rehearse some of your answers.",
            "Aim for a natural, conversational tone while you practice.",
            "Get plenty of rest the night before the interview."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Interview a Source Via Email",
        "steps": [
            "Send your source a letter of introduction and explanation about the purpose of your interview.",
            "Reduce the number of questions from what you would normally ask during an in-person interview.",
            "Prepare open-ended questions that allow the source to provide insight and reasoning behind her answers.",
            "Send a reminder to your source if you fail to get a reply within the timeframe you and your source initially agreed upon.",
            "Ask for clarification if you have any uncertainties about your source's answers.",
            "Thank your source."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Pass an Interview on Roblox",
        "steps": [
            "Look professional.",
            "Show up on time.",
            "Be grammatically correct.",
            "Be polite.",
            "Sit still.",
            "When you pass an interview, make sure to ask any questions about your job before you leave if needed."
        ],
        "cluster_label": 910
    },
    {
        "title": "How to Conduct a Survey",
        "steps": [
            "Decide on sample size.",
            "Get review board clearance if necessary.",
            "Pursue funding.",
            "Contact respondents via email for a quick option.",
            "Contact respondents via the post for a traditional method.",
            "Contact respondents via the phone if you have access to phone numbers.",
            "Choose a research firm to survey for you if you can afford it.",
            "Monitor your interviewers.",
            "Adhere to federal and state regulations.",
            "Prepare your findings for professional review."
        ],
        "cluster_label": 910
    }
]