[
    {
        "title": "How to Care for Sweaters",
        "steps": [
            "Fold your sweaters.",
            "Remove pills from your sweaters regularly to keep them looking presentable.",
            "Remove dandruff, hair & lint regularly.",
            "Repair the sweater quickly.",
            "Give your favorite sweater a break.",
            "Wash most sweaters by hand.",
            "Treat cashmere & other delicates very carefully.",
            "Store sweaters carefully during summer months.",
            "Wash any sweater you put away for storage.",
            "Store sweaters dry."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Fix Clothes",
        "steps": [
            "Sew a popped button back into place quickly with needle and thread.",
            "Fix a broken zipper yourself instead of replacing the garment.",
            "Remove pilling with scissors to keep your clothes looking fresh.",
            "Get rid of deodorant stains on clothes with baking soda and vinegar.",
            "Distress your jeans to turn worn patches into intentional design spots.",
            "Fix a gaping neckline to refresh your favorite tops."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Clean a Cashmere Sweater",
        "steps": [
            "Pre-treat stains with a small amount of baby shampoo.",
            "Remove pilling with a cashmere comb or sweater stone.",
            "Store your sweater folded to avoid lumps."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Waterproof Clothes",
        "steps": [
            "Gather your materials.",
            "Prepare your work area by laying down old newspapers.",
            "Dissolve 2 cups of laundry detergent in 8 liters (2.1 US gal) of warm water.",
            "Soak the clothes in this solution until they are completely and evenly wet.",
            "Make a solution of 1 cup of alum and 8 liters (2.1 US gal) of warm water.",
            "Soak the clothes in this solution for several hours or overnight.",
            "Test the waterproofed clothing after using any of these methods."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Care for Your Foundation Garments",
        "steps": [
            "Caring for any undergarments begins with proper fitting at the time of purchase.",
            "When putting on or taking off an undergarment, take special care to avoid snagging it with your fingernails.",
            "Always consult labels for directions and precautions on caring for each garment.",
            "Machine-wash only when the \"delicate fabric\" setting is used.",
            "Undergarments should be washed every other day.",
            "If possible, use cold-water soap, avoiding hot water.",
            "Soaking for about ten minutes before washing is effective in helping to loosen soil.",
            "Stubborn spots may be removed by scrubbing with a soft brush.",
            "Do not wring or twist the garment.",
            "Rinse  thoroughly and roll in a bath towel to remove excess moisture or, if spandex, in dryer.",
            "Dry away from sunlight or direct heat.",
            "Alternate wearing of undergarments."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Wash Scarves",
        "steps": [
            "Use the gentle or delicate setting on your washing machine for cotton or polyester scarves.",
            "Hang your cotton or polyester scarves on a clothesline to air dry.",
            "Place your fleece scarf in the dryer on a low heat setting."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Wash Clothes with Shampoo",
        "steps": [
            "Remove as much of the staining material as you can.",
            "Add a drop of shampoo to a damp rag.",
            "Blot the stain with the rag, reapplying water and shampoo as needed.",
            "Rinse the affected area and wash the garment as usual.",
            "Reshape the garment and then hang it or lay it flat to dry."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Wash a Cotton Sweater",
        "steps": [
            "Hand-wash your sweater.",
            "Turn the sweater inside out.",
            "Place fine cotton sweaters in a zippered pillowcase or laundry bag."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Wash Clothes without a Washing Machine",
        "steps": [
            "Fill a container with cool water.",
            "If your water is hard, add a little borax or baking soda.",
            "Add a tiny amount of mild soap.",
            "Measure wool or cashmere clothing before washing.",
            "Gently press each article of clothing under the water.",
            "Rinse the clothing.",
            "Learn how to dry wool or cashmere clothing.",
            "Dry other delicate clothing on a clothesline or clothes horse."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Care For the Most Delicate Fabrics",
        "steps": [
            "Avoid frequent washing of your delicate fabrics.",
            "Use a clothes brush to remove dust or dirt from delicate fabrics.",
            "Hang delicate fabrics on padded hangers.",
            "Fold heavy items like gowns and sweaters.",
            "Keep delicate fabrics away from sunlight.",
            "Store delicate fabric in a cool, well-ventilated place."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Wash a Silk Pillowcase",
        "steps": [
            "Check the label on the pillowcase before using the washing machine.",
            "Pick a delicate and cold temperature cycle on the washing machine.",
            "Put the pillowcase into a laundry bag and then into the washing machine.",
            "Add a mild laundry detergent and start the cycle.",
            "Leave the pillowcase resting flat on a clean towel to dry."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Wash a Wool Sweater",
        "steps": [
            "Wear a shirt underneath your sweater to minimize sweat transfer.",
            "Let your sweater air dry between wearings to limit washings.",
            "Wash your sweaters before you put them in storage.",
            "Put your sweaters in an airtight plastic bin for storage.",
            "Avoid taking your sweaters to the dry cleaners."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Dry Clothes Washed by Hand",
        "steps": [
            "Avoid hanging heavy items to prevent stretching.",
            "Hang a drying net to avoid stretching clothing.",
            "Use hangers or rods to dry clothing indoors.",
            "Use a clothesline to dry clothing outside."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Wash Cotton Polyester",
        "steps": [
            "Treat your stains before washing your cotton-polyester blends.",
            "Separate your laundry by color to keep clothes pristine.",
            "Turn colored clothing inside out before washing It.",
            "Hang or fold your clothes as soon as they’re dry to prevent wrinkles."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Wash Sheepskin",
        "steps": [
            "Shake and brush your sheepskin regularly.",
            "Store the sheepskin away from heat and direct sunlight.",
            "Be extra gentle with a sheepskin coat when it's wet."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Wash Felt",
        "steps": [
            "Determine if your felt is wool felt or synthetic felt.",
            "Use a home dry cleaning kit.",
            "Take the item to the cleaners."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Wash Knitted Blankets",
        "steps": [
            "Use a gentle detergent suited to hand washing.",
            "Hand-wash blankets made of delicate fibres.",
            "Soak the blanket in cold water.",
            "Rinse the blanket.",
            "Ventilate woollen blankets.",
            "Air-dry your knitted blanket."
        ],
        "cluster_label": 2035
    },
    {
        "title": "How to Dry Soft Toys on the Clothes Line",
        "steps": [
            "Wash the soft toys as usual.",
            "Find a large safety pin for each animal washed.",
            "Pierce an ear or other easy part of each animal with the large safety pin.",
            "Leave to dry.",
            "Remember to remove the pin and close it before bringing the toys back inside."
        ],
        "cluster_label": 2035
    }
]