[
    {
        "title": "How to Tell the Differences Between Take and Took",
        "steps": [
            "Look at the meanings and tenses of these words.",
            "Recognize the differences in the tenses of these words.",
            "Recognize when you should use \"take\"."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Guess on a Test",
        "steps": [
            "Ask to see past exams.",
            "Find out if blank answers are marked incorrect.",
            "Answer questions you know before making guesses.",
            "Look for context clues in the rest of the test.",
            "Go with an answer that seems familiar."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Test a Hypothesis",
        "steps": [
            "Use inductive reasoning to note patterns among your data.",
            "Make alterations to your hypothesis.",
            "Draw a revised hypothesis."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Pass a Job Assessment Test",
        "steps": [
            "Ask the hiring manager what skills you'll be tested on.",
            "Take skills quizzes for spelling, grammar, and math as needed.",
            "Review any math skills you might be tested on.",
            "Study writing skills if you need to improve on them.",
            "Practice your skills with the software the job requires.",
            "Create a positive environment for the test.",
            "Stay calm while answering questions.",
            "Read questions thoroughly."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Test Hair for Drug Use",
        "steps": [
            "Research and buy a home testing kit.",
            "Clip a sample of hair.",
            "Prepare your sample for mailing.",
            "Ship your sample.",
            "Register your sample online.",
            "Understand the testing process.",
            "Access your secure online results."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Dispute the War on Drugs",
        "steps": [
            "Understand the Black Market.",
            "Understand that prohibiting drugs makes them FAR MORE DANGEROUS.",
            "Understand the propaganda with which the drug war fights.",
            "Understand that the scheduling system of drugs can be seriously flawed.",
            "Understand that, even with the above, legal alcohol is better than the first Prohibition.",
            "Understand that drugs SHOULD be regulated.",
            "Understand that the War on Drugs severely handicaps scientific research.",
            "DO YOUR RESEARCH."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Drug Test Yourself",
        "steps": [
            "Send your sample to a lab to confirm the result.",
            "Detox to pass a drug test for work.",
            "Talk to a counselor or addiction specialist."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Understand Addiction",
        "steps": [
            "Know that there are physiological factors involved in addiction.",
            "Know that alcohol and illicit drug use are the most common forms of addiction.",
            "Consider how use of pain medication may lead to drug addiction.",
            "Be aware that people can be addicted to more than just alcohol and drugs."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Pass a Drug Test for a Job",
        "steps": [
            "Know how drug tests work.",
            "Identify what drugs you may have in your system and research how long each one remains.",
            "Abstain from usage.",
            "Delay the testing, if possible.",
            "Understand that cheating a drug test may be against the law."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Pass a Drug Test",
        "steps": [
            "Know when you might be observed during a drug test.",
            "Know the law.",
            "Recognize when you are likely to be tested.",
            "Know when drug testing is not permitted.",
            "Know what's true and what's not about drug testing."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Tell if Someone Has Been Using Marijuana",
        "steps": [
            "Wait until the person is sober to talk about it.",
            "Pick a time to talk when the person is calm and relaxed.",
            "Ask them if they are using marijuana.",
            "Let them know you are concerned about them.",
            "Stay calm."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Detect Drug Use",
        "steps": [
            "Buy a drug detection test when all signs point to drug use, or if you just can't tell but need your suspicions satisfied.",
            "Administer the test without prior warning for the most accurate results.",
            "Notify the individual of the drug test results to arrange any necessary follow-up testing, drug treatment, counseling, or even job termination."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Pass a Typing Test",
        "steps": [
            "Practice your technique whenever you have access to a computer.",
            "Take practice tests online to improve your speed.",
            "Purchase typing books that contain practice exercises.",
            "Download a computer program that teaches typing skills.",
            "Take a typing class if you prefer to work with a tutor in person."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Sniff Packets",
        "steps": [
            "Download the packet sniffing software and install it according to the manufacturer's instructions.",
            "Configure the software.",
            "Hit the “start” button or command to start monitoring.",
            "Select “stop” to stop the session and “save” to save the results.",
            "View the results.",
            "Filter the display or select individual entries.",
            "Get help from books, online resources, or user forums to learn more about how to sniff packets and interpret the results."
        ],
        "cluster_label": 2625
    },
    {
        "title": "How to Withdraw from Your 401K",
        "steps": [
            "Determine if you meet the criteria for hardship withdrawal.",
            "Determine if you qualify for penalty-free withdrawals.",
            "Prove you need the money due to a hardship.",
            "Roll over the funds."
        ],
        "cluster_label": 2625
    }
]