[
    {
        "title": "How to Convince Your Parents to Let You Homeschool",
        "steps": [
            "Refute common myths about homeschooling.",
            "Talk about low-cost or free alternatives, if they are worried about money.",
            "Figure out a plan that works with your parents’ schedules.",
            "Compromise with your parents."
        ],
        "cluster_label": 2673
    },
    {
        "title": "How to Homeschool Yourself",
        "steps": [
            "Learn about homeschooling in general.",
            "Read up on the homeschooling laws in your area.",
            "Talk to your parents about your ideas.",
            "Decide upon what you want to learn about.",
            "Plan out what you would do for each subject.",
            "Talk to your parents about your plans, and if they're in, ask them to help you deal with the legalities.",
            "Once you're legally self-schooling, keep up the good work!.",
            "Keep detailed records of your self-schooling.",
            "Enjoy the self-schooling experience because you are one of the rare children to exceed expectations and take their education into their own hands."
        ],
        "cluster_label": 2673
    },
    {
        "title": "How to Make Homeschool Fun for Your Children",
        "steps": [
            "Make sure homeschooling is the right choice for you and your family.",
            "Get your curriculum before taking the child out of school.",
            "Plan your schedule.",
            "Do not let your kid be un-socialised.",
            "Make the lessons fun.",
            "Watch DVDs or something educational.",
            "Know the laws.",
            "Be there when your child needs help."
        ],
        "cluster_label": 2673
    },
    {
        "title": "How to Take Your Child to School for the First Time",
        "steps": [
            "Talk to your child about kindergarten or preschool.",
            "Find out what their first day of school will entail (i.e.",
            "Make school-supplies shopping fun, but don't break your budget.",
            "Ask them about any questions about they have about school the night before.",
            "Drive or walk them to school.",
            "Communicate with your child's teacher.",
            "Ask your child every day what he or she did at school."
        ],
        "cluster_label": 2673
    },
    {
        "title": "How to Homeschool a Child with Special Needs",
        "steps": [
            "Think long and hard as to whether this is the right decision.",
            "Once you have decided that home education is for you and your child, you can begin to think about how exactly you are going to go about the education.",
            "Figure out how you will approach home education.",
            "Think about how to incorporate that with your child and his/her special needs.",
            "Make sure to incorporate your child's needs into the day.",
            "Make sure to keep education fun so that your child doesn't get too downbeat about it.",
            "Trust your techniques and have faith in your abilities.",
            "Don't worry too much if it takes a while to get into a routine.",
            "Make time for you.",
            "Enjoy learning together.",
            "Make sure you ask for help if needed."
        ],
        "cluster_label": 2673
    },
    {
        "title": "How to Prepare a Child for the First Day of School or Kindergarten",
        "steps": [
            "Visit the school or kindergarten in advance.",
            "Meet the teacher.",
            "Obtain the school handbook.",
            "Shop together to obtain school supplies.",
            "Obtain a class schedule.",
            "Be organized.",
            "Reassure your child.",
            "Be supportive but also learn to let go."
        ],
        "cluster_label": 2673
    },
    {
        "title": "How to Homeschool a Kindergartener",
        "steps": [
            "Determine when your area requires children to attend school.",
            "File a notice of intent to homeschool.",
            "Send your notice to your local school superintendent.",
            "Set up any necessary testing at the end of your homeschool year."
        ],
        "cluster_label": 2673
    },
    {
        "title": "How to Socialize Homeschoolers",
        "steps": [
            "Start socializing your children at a young age.",
            "Encourage after school activities.",
            "Require each child to earn service hours.",
            "Model behavior.",
            "Take school into the “real world.”  Field trips into society can not only help you socialize your child but further his/her education through real life experiences."
        ],
        "cluster_label": 2673
    },
    {
        "title": "How to Choose a Homeschool Curriculum",
        "steps": [
            "Review your state's homeschool laws to determine what subjects you are required to teach.",
            "Think about your goals for your child.",
            "Think about how your child best takes in and processes information.",
            "Choose a homeschooling method.",
            "Look for programs that fit your chosen method of instruction by browsing the internet, participating in online forums, or talking to homeschoolers you know personally.",
            "Read online reviews of programs that interest you.",
            "Attend a home school curriculum fair so you can view materials up close and ask questions about materials.",
            "Select and purchase your chosen curriculum."
        ],
        "cluster_label": 2673
    },
    {
        "title": "How to Homeschool Your Teenager",
        "steps": [
            "Check homeschool regulations.",
            "Create a difficult curriculum.",
            "Give your teenager independence.",
            "Lead her to a wider range of subjects.",
            "Hold your teenager to deadlines.",
            "Look into colleges.",
            "Set aside time for a social life.",
            "Stay friends."
        ],
        "cluster_label": 2673
    },
    {
        "title": "How to Prepare Your Child for Adult Life",
        "steps": [
            "Teach your children how to write a bill.",
            "Consider what your children will need to do when shopping as adults.",
            "Cover how to do the taxes with your child.",
            "Discuss the responsibilities of having children with your child.",
            "Suppose your children want to live by themselves when they reach adulthood.",
            "Teach your children how to be productive and manage stress.",
            "Teach your children how to use a credit card.",
            "Cover maturity with your child.",
            "Understand that one important skill in the workplace is hiding true feelings."
        ],
        "cluster_label": 2673
    },
    {
        "title": "How to Prepare Your Child for Kindergarten",
        "steps": [
            "Train your child to use the bathroom before school starts.",
            "Eat, sleep, and play at the same time every day to prepare for school.",
            "Set a bedtime and stick to it consistently.",
            "Show your child how to hold a pencil and practice writing their name.",
            "Teach your child how to zip/button a jacket and put their shoes on."
        ],
        "cluster_label": 2673
    }
]