[
    {
        "title": "How to Make Fabric Earrings",
        "steps": [
            "Get an aluminum cover button kit from the fabric store.",
            "Use the included template to trace a circle onto your fabric.",
            "Cut the fabric circle out.",
            "Press the fabric into the tool.",
            "Press the button down into the tool.",
            "Tuck the edges of the fabric into the button.",
            "Place the back of the button on top of the fabric.",
            "Use the other part of the button maker to assemble your button.",
            "Glue an earring post to the back of the button.",
            "Make a second earring, then wait for both to dry."
        ],
        "cluster_label": 595
    },
    {
        "title": "How to Make Peruvian Thread Earrings",
        "steps": [
            "See \"Things You'll Need\" below and obtain the needed supplies.",
            "Cut two lengths of the heavier gauge wire equal to the desired circumference of the earrings plus one inch for fastening to the earring findings.",
            "Wrap the thinner gauge wire evenly around the heavier gauge wire, leaving equally spaced loops.",
            "Bend the wrapped, heavy gauge wire into a loop.",
            "Fasten the ends.",
            "Attach to your earring finding or hooks.",
            "Proceed with your string art pattern.",
            "Tie off each thread securely.",
            "Use a craft glue on the outer edge of the wire loop to secure the threads to the loop and prevent unraveling or loosening.",
            "Wear proudly and enjoy the compliments!.",
            "Finished."
        ],
        "cluster_label": 595
    },
    {
        "title": "How to Make Button Earrings",
        "steps": [
            "Get a fabric-covered button-making kit.",
            "Use a pair of pliers to pull the metal loop out of the button back.",
            "Use the template to trace a circle onto your fabric.",
            "Cut your fabric out using a pair of fabric scissors.",
            "Hand stitch along the edges of the circle.",
            "Place the fabric right-side-down into the button maker.",
            "Place the button cap on top of the fabric, smooth-side-down.",
            "Pull on the thread to gather the fabric.",
            "Push the back of the button in place.",
            "Glue an earring post to the back of your button.",
            "Wait for the glue to dry before wearing your earrings."
        ],
        "cluster_label": 595
    },
    {
        "title": "How to Make Stud Earrings",
        "steps": [
            "Look for beads and buttons in craft stores.",
            "Use clay to make your own designs.",
            "Make a pair of bow earrings.",
            "Create a pair of holiday themed earrings.",
            "Try using old jewelry."
        ],
        "cluster_label": 595
    },
    {
        "title": "How to Make Origami Earrings",
        "steps": [
            "Gather the \"Things You'll Need\" (see list below).",
            "Fold two origami models from the squares of paper.",
            "Thread one of the beads onto a pin.",
            "Take one of the origami models, and thread it onto a pin.",
            "Thread the rest of the beads onto the pin.",
            "Cut off the excess wire from the pin with the pliers.",
            "Bend the tip of the pin into the form of a fishhook, using the pliers.",
            "Attach the earring by hooking the pin's hook through the earring's hole.",
            "Bend the hook fully closed.",
            "Repeat these steps with the other origami model.",
            "Show off your new origami earrings!."
        ],
        "cluster_label": 595
    },
    {
        "title": "How to Make Leather Earrings",
        "steps": [
            "Cut a feather shape out of cardboard.",
            "Trace and cut out your leather feathers.",
            "Fringe the edges of the feathers.",
            "Stitch a line down the middle of each feather.",
            "Add gold tips using acrylic paint.",
            "Attach hooks to your earrings."
        ],
        "cluster_label": 595
    },
    {
        "title": "How to Make a Homemade Earring Holder",
        "steps": [
            "Take an embroidery hoop apart.",
            "Paint the hoops, if desired, and wait for the paint to dry.",
            "Cut a piece of lace or tulle a few inches larger than your hoop.",
            "Place the lace on top of the inner hoop.",
            "Place the upper hoop on top, and tighten it.",
            "Trim off the excess lace using a pair of fabric scissors.",
            "Thread some ribbon through the metal closure, and tie it in a knot.",
            "Hang and use your earring holder."
        ],
        "cluster_label": 595
    },
    {
        "title": "How to Attach Earring Hooks",
        "steps": [
            "Select a pair of premade earrings that match your earring hooks.",
            "Use pliers to open the bottom loop attached to the hook.",
            "Slide any premade earring onto the loop attached to the earring hook.",
            "Secure the earring by closing the metal loop with pliers."
        ],
        "cluster_label": 595
    },
    {
        "title": "How to Make Your Own Earrings",
        "steps": [
            "Gather all of your materials.",
            "Disinfect the earring hooks.",
            "Make a ball or another shape with aluminum foil.",
            "Decorate the earrings.",
            "Make a hole through the center of the earrings.",
            "Cut two pieces of wire about 2-3\" (5-7.5cm) long.",
            "Run one piece of wire through one earring and attach it to the hook.",
            "Repeat this step with the other piece of wire.",
            "Store your earrings."
        ],
        "cluster_label": 595
    },
    {
        "title": "How to Make Earrings",
        "steps": [
            "Make bottle cap earrings.",
            "Make SIM card earrings.",
            "Make feather earrings.",
            "Make book earrings.",
            "Make food earrings.",
            "Make origami earrings.",
            "Make quilling earrings.",
            "Make button earrings."
        ],
        "cluster_label": 595
    },
    {
        "title": "How to Make Cupcake Earrings",
        "steps": [
            "Gather your materials.",
            "Make the cupcake bases out of the brown clay.",
            "Add indents around the bases using the earring findings.",
            "Roll out a bit of white clay into a thin white string.",
            "Cut earring findings to the correct size using a wire cutter.",
            "Stick the earring findings inside the cupcakes' centers.",
            "Bake the cupcakes.",
            "Hang the earrings onto the earring findings and enjoy your new cupcake jewellery."
        ],
        "cluster_label": 595
    },
    {
        "title": "How to Make Dragonfly Earrings",
        "steps": [
            "Choose a suitable polymer clay.",
            "Decide which approach to take to making the dragonfly earrings.",
            "Assuming you've decided to model the clay into the shape of a dragonfly, do the following:.",
            "Assuming you've decided to make the punch-out version, do as follows:."
        ],
        "cluster_label": 595
    }
]