[
    {
        "title": "How to Encourage Kids to Love Science",
        "steps": [
            "Provide your kids with books that celebrate science.",
            "Show your kids scientific programming.",
            "Give your kids toys that relate to science."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Learn Body Parts for Preschool",
        "steps": [
            "Show the student where each body part is located by pointing it out and saying its name.",
            "Say the name of a body part out loud and ask the student to move it.",
            "Ask students to match images of different body parts to their names.",
            "Play the \"Simon Says\" game.",
            "Sing songs that help students learn about anatomy.",
            "Put some music on that the students enjoy and ask them to dance by moving specific parts of their body.",
            "Tickle the students on different parts of their body and ask them if it tickles."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Develop Creativity in Preschool",
        "steps": [
            "Create an environment that stimulates creativity.",
            "Exhibit an attitude that promotes creativity in preschool.",
            "Conduct activities that help children develop creativity.",
            "Avoid things that are proven to stifle creativity."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Teach Sequencing to Preschool Children",
        "steps": [
            "Use sequence words to describe the arrangement of items.",
            "Ask your child to sequence toys and items according to your directions.",
            "Put pictures out of order for a tougher exercise.",
            "Use family photos to teach sequencing."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Introduce Science to Preschoolers",
        "steps": [
            "Discover answers to questions together.",
            "Introduce the scientific method.",
            "Use new vocabulary to teach science.",
            "Avoid forcing scientific concepts on preschoolers.",
            "Pay attention to what your class is interested in."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Learn Shapes in Preschool",
        "steps": [
            "Use paper to make different shapes and ask the students to use the shapes to make different objects.",
            "Ask students to make specific things from different shape-cuts.",
            "Make a figure out of shapes.",
            "Cut different shapes out of paper.",
            "Have the preschool students search through magazines that have a lot of images and ask them to identify shapes within the images.",
            "Arrange a school trip to a museum or art gallery and ask the children to name different shapes that they see during the trip.",
            "Tell the students to draw different shapes on the floor (you may want to place a large sheet of paper on the floor to draw on or use chalk so the shapes can be erased later).",
            "Give the child toy shapes to play with."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Teach Science",
        "steps": [
            "With your class(es), introduce yourself in a way that makes you seem friendly and trustworthy.",
            "Everyday, make sure you have everything planned out.",
            "There is a very delicate balance between disaster and control, so don't treat every kid like a baby.",
            "When teaching the class(s), teach almost everything in a fascinating way.",
            "With homework, make it a fair amount."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Introduce Soccer to a Child",
        "steps": [
            "Buy a soccer ball for him or her.",
            "Present the soccer ball to your child on a special day, maybe their birthday.",
            "Encourage the watching of soccer games.",
            "Make a small goal post in your yard.",
            "Remain calm at all times when teaching your child soccer.",
            "Buy your child an occasional football accessory or team top.",
            "Consider enrolling your child in a local children's soccer team."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Teach Kids to Garden",
        "steps": [
            "Focus on making it fun and exciting.",
            "Kit out your kids.",
            "Choose plants that are easy to grow.",
            "Show your children the basics of planting seeds and seedlings in the ground.",
            "Include wildlife in your child's gardening experience.",
            "Show children how to grow plants from cuttings.",
            "Make things for the garden.",
            "Decorate the garden with your kids' art and craft efforts.",
            "Talk to your kids about the importance of native vegetation in gardens.",
            "Acknowledge the place of the digital era in gardening.",
            "Show kids how to compost.",
            "Keep gardening even when the season changes.",
            "Keep making gardening an exciting experience and be enthusiastic about it."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Teach Art to Children",
        "steps": [
            "Ask kids to talk about a piece of art instead of telling them what it's about.",
            "Act out a piece of art to help children connect to it.",
            "Encourage children to respond with their own art.",
            "Take a field trip to an art museum."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Show Your Toddler Activities to Teach Colors and Shapes",
        "steps": [
            "Make edible finger paints.",
            "Make shapes with different colored play-doughs.",
            "Play with chalk on the sidewalk.",
            "Use different colored jelly beans to teach colors.",
            "Test your toddler with silhouette flash cards.",
            "Encourage your toddler to sort shapes.",
            "Feed an imaginary pet with different shaped foods."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Teach Kids About Computers",
        "steps": [
            "Teach kids basic computer etiquette and ways to take care of computers.",
            "Show kids how to hold and use a computer mouse.",
            "Teach kids about typing on a keyboard.",
            "Teach kids how to use the Internet for research and homework."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Make an Art Kit",
        "steps": [
            "A child's kit is extremely easy to make, since children are naturally creative and they will use just about anything.",
            "Include a cheap plastic tablecloth or oilcloth in a child's kit and explain to Mom and Dad that it's to go underneath anything messy: paint, clay, glue, etc.",
            "With this child's kit it's really up to you."
        ],
        "cluster_label": 2719
    },
    {
        "title": "How to Introduce Your Kids to Feeding the Birds",
        "steps": [
            "Spend a little time observing the birds.",
            "Choose or make bird feeders.",
            "Set up the bird feeder together.",
            "Have the kids prepare the seed mixes for the bird feeder.",
            "Teach the children how to keep the bird feeder clean on a regular basis."
        ],
        "cluster_label": 2719
    }
]