[
    {
        "title": "How to Dispose of a Bamboo Toothbrush",
        "steps": [
            "Place the bamboo toothbrush handle in your compost bin.",
            "Write on the bamboo holder to make a garden marker for plants.",
            "Burn the bamboo holder to use it for fire wood.",
            "Use your used toothbrush for cleaning if you left the bristles on."
        ],
        "cluster_label": 2444
    },
    {
        "title": "How to Use Pedicure Tools",
        "steps": [
            "Throw away items that are not reusable.",
            "Wash your tools thoroughly.",
            "Disinfect your pedicure tools."
        ],
        "cluster_label": 2444
    },
    {
        "title": "How to Dispose of Medication",
        "steps": [
            "Determine whether your medication is considered potentially dangerous.",
            "Look into community drug disposal programs.",
            "Flush if you have no other option.",
            "Finished."
        ],
        "cluster_label": 2444
    },
    {
        "title": "How to Dispose of Nail Polish",
        "steps": [
            "Find a hazardous waste recycling center or service in your area.",
            "Take the old bottles of nail polish to the recycling center or get them picked up.",
            "Buy environmentally friendly nail polish and other cosmetics in the future."
        ],
        "cluster_label": 2444
    },
    {
        "title": "How to Clean a Man Cave",
        "steps": [
            "Get permission.",
            "Focus first on what you know to be junk.",
            "Deodorize.",
            "Locate all used bowls, cups and plates.",
            "Pick up ancillary items.",
            "Organize, dust and vacuum.",
            "Liberate yourself from cleaning the man cave."
        ],
        "cluster_label": 2444
    },
    {
        "title": "How to Clean Asbestos",
        "steps": [
            "Place all asbestos-containing materials into waste disposal bags.",
            "Dispose of polyethylene sheeting.",
            "Wipe down all surfaces.",
            "Wipe down your equipment.",
            "Remove your protective gear.",
            "Locate an asbestos disposal facility.",
            "Drop your asbestos-contaminated materials off."
        ],
        "cluster_label": 2444
    },
    {
        "title": "How to Dispose of Bleach",
        "steps": [
            "Ask friends, family members, or neighbors if they need bleach.",
            "Check to see if a local organization could use the bleach.",
            "Post the bleach on a classifieds page online for someone who needs it."
        ],
        "cluster_label": 2444
    },
    {
        "title": "How to Dispose of Wallpaper Paste",
        "steps": [
            "Add water to dilute dried wallpaper paste.",
            "Rinse liquid paste down household drains.",
            "Treat like all household water waste."
        ],
        "cluster_label": 2444
    },
    {
        "title": "How to Disinfect Gardening Tools",
        "steps": [
            "Use liquid bleach.",
            "Clean your tools with an industrial disinfectant.",
            "Disinfect your tools regularly when working on infected plants."
        ],
        "cluster_label": 2444
    },
    {
        "title": "How to Clean Out Your Medicine Chest",
        "steps": [
            "Empty the medicine cabinet and place the items on a counter or table.",
            "Clean the medicine cabinet with household cleaner and water.",
            "Sort the medicine cabinet contents by category.",
            "Set aside each item that is old or out-of-date.",
            "Throw away expired antibiotics.",
            "Throw away unopened and opened cosmetic and toiletry products that are a year old or older.",
            "Put the cabinet items back in the cabinet by category.",
            "Dispose of medicine cabinet items following local guidelines.",
            "Add water to pills that are safe to dispose of in the trash.",
            "Add kitty litter or flour to liquid ingredients that are safe to dispose of in the trash.",
            "Keep prescriptions in their original containers."
        ],
        "cluster_label": 2444
    },
    {
        "title": "How to Bury a Treasure",
        "steps": [
            "Find a treasure.",
            "Choose a secret location you can remember how to find again (Note: Treasure maps are frequently lost or stolen.",
            "Dig a very deep hole using your shovel.",
            "Enclose your treasure in a protective case or covering.",
            "Carefully place your treasure into the hole you dug.",
            "Refill the hole with the treasure inside using the dirt you dug up.",
            "Plant a tree or shrub on top of the hole as to disguise the area's true purpose."
        ],
        "cluster_label": 2444
    },
    {
        "title": "How to Dispose of Fireworks",
        "steps": [
            "Pick up all debris.",
            "Wrap the soaked fireworks.",
            "Place fireworks in regular household trash."
        ],
        "cluster_label": 2444
    }
]