[
    {
        "title": "How to Have Glittery Nails",
        "steps": [
            "Pull back your cuticles, wash your hands, and moisturize your fingers.",
            "Paint gold nail polish on your nails.",
            "Before your nails dry, sprinkle some glitter on your nails.",
            "Finish up."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Get Glitter out of Your Hair",
        "steps": [
            "Style your hair before applying any glitter to make sure it’s visible.",
            "Spray a light coat of hairspray to create a barrier between your hair and the glitter.",
            "Apply some oil to your roots before putting on the glitter.",
            "Shake, spread, and disperse the glitter over the oil to create your look."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Do Holly Nail Art",
        "steps": [
            "Put a bead of green polish on a flat surface.",
            "Create your holly leaves using the thin nail art brush.",
            "Put a bead of red polish on the flat surface.",
            "Use your dotting tool to add the holly berries.",
            "Apply a topcoat."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Remove Glitter from Your Hands",
        "steps": [
            "Purchase or select rubbing alcohol or nail polish remover.",
            "Soak a cotton pad or ball in the rubbing alcohol or nail polish remover.",
            "Dab and gently rub over the area of skin with glitter glue stuck to it.",
            "Peel off whatever is ready to come off with ease.",
            "Wash the rest off using warm, soapy water and gentle scrubbing."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Do Ombre Nails",
        "steps": [
            "Clean up your nails.",
            "Apply a clear base coat.",
            "Apply your base color coat.",
            "Add your first coat of glitter.",
            "Paint your second coat of glitter.",
            "Add a clear topcoat."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Do Strawberry Nail Art",
        "steps": [
            "Put on a base coat to protect and strengthen your nails.",
            "Paint your nails red.",
            "Paint the strawberry leaves white first.",
            "Paint the strawberry leaves green.",
            "Paint the seeds.",
            "Finish off with a top coat.",
            "Finished."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Paint Your Nails With the Opposite Hand",
        "steps": [
            "To start, if you are using colour, apply a good base coat.",
            "Prepare your work area and then wash your hands thoroughly.",
            "Find a position of holding the brush that is comfortable for you.",
            "Place the left side of your non-dominant hand on the table in a relaxed manner and either straighten your pinky out and tuck your ring finger in under your hand or vice versa.",
            "Hold the brush between your thumb pad and against the side of your index finger (try adding the finger next to it a little as well for extra support).",
            "Paint your opposite nails first, so you can avoid wasting time.",
            "Unscrew the lid and apply a little less polish to the brush than you think you should.",
            "Lightly squeeze the handle of the brush to help prevent you from shaking or twisting the handle and start in the center of the nail, slightly further away from the cuticle than you normally would.",
            "Paint one strip down the middle, then one either side of that.",
            "If you flooded the nail a bit, put the pointy end of an orange stick or toothpick as close as you can to the cuticle and run it along one side and along the nail groove, then repeat on the other side if necessary.",
            "Once finished polishing all of your nails on that hand, let them dry thoroughly.",
            "Polish your other hand like you normally would and let it dry.",
            "You don't necessarily need nail polish remover to get rid of the varnish on your skin.",
            "Be sure to wash your hands and apply a hand cream or nail oil.",
            "Admire your newly painted nails."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Apply Glitter on Nail Polish",
        "steps": [
            "Clean, cut, and shape your nails.",
            "Apply a base coat and a base color and let them dry.",
            "Block off the areas you don't want glittered with pieces of tape.",
            "Paint a coat of clear polish onto your first nail, then remove the tape.",
            "Sprinkle loose glitter over the wet polish.",
            "Wait 1 minute before brushing the excess glitter off.",
            "Repeat the process for the rest of your nails.",
            "Apply a thin layer of clear top coat over each nail.",
            "Clean your manicure up."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Make Your Nail Polish Matte",
        "steps": [
            "Paint your nails with regular nail polish.",
            "Pour some water into a pan.",
            "Place your hand above the steam."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Decorate Your Nails",
        "steps": [
            "Apply rhinestones or gems.",
            "Add glitter to your nails.",
            "Use nail stickers for an alternative manicure."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Remove Glitter from Your Clothes",
        "steps": [
            "Use coconut oil to remove glitter from your face and skin.",
            "Use olive oil to remove glitter from your hair.",
            "Vacuum your carpet with a hose attachment.",
            "Use a wet cloth on tile and hardwood flooring."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Make Glitter Tape",
        "steps": [
            "Acquire loose glitter.",
            "Take a piece of double-sided tape and dip it into the plate.",
            "It should be completely covered in glitter.",
            "Now shake off the excess glitter.",
            "Your glitter tape is ready to use!."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Remove Glitter",
        "steps": [
            "Sweep glitter spills into a large pile with a damp paper towel or a dryer sheet.",
            "Use a vacuum hose to suck the glitter pile from the floor.",
            "Remove all lingering glitter bits with scotch tape or a lint roller."
        ],
        "cluster_label": 1414
    },
    {
        "title": "How to Do Ravenclaw Nails",
        "steps": [
            "Remove any old nail varnish.",
            "Shape the nails to your personal preference.",
            "Apply a base coat and let it dry.",
            "Choose your nail varnish colours.",
            "Get some nail art pens.",
            "Bear in mind not all of the designs on each nail have to be the same.",
            "Firstly, paint the whole nail blue.",
            "Wait at least 5 minutes to make sure that they are dry.",
            "Apply a second coat and wait 10 minutes to ensure all layers of paint are fully dry.",
            "With a nail art pen or a thin brush, paint the tips of the nails with a bold silver or gold paint.",
            "Leave until they are fully dried.",
            "If you are a master in nail design or have access to a nail art professional, you could add an eagle (the symbol of Ravenclaw).",
            "To finish, after ensuring the nails are fully dried, apply at least 2 layers of top coat clear varnish.",
            "Leave the nails to dry and enjoy you new Ravenclaw nails!."
        ],
        "cluster_label": 1414
    }
]