[
    {
        "title": "How to Refinance a Car",
        "steps": [
            "Shop around for refinancing deals.",
            "Send approval to the appropriate parties.",
            "Pay off the old loan with a check from the new lender.",
            "Try this refinance strategy if you can afford to pay the extra money.",
            "Watch out for shady auto refinancing lenders."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Get Racing Sponsors",
        "steps": [
            "Understand the sponsorship process first.",
            "Figure out what you can offer to a potential sponsor.",
            "Decide where you will look for racing sponsors.",
            "Start making phone calls.",
            "Prepare a sponsorship proposal.",
            "Get a contract for the sponsorship.",
            "Read through the terms of your sponsorship agreement with your lawyer."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Make Car Loan Payments",
        "steps": [
            "Contact your lender as soon as possible.",
            "Check your credit score.",
            "Gather information about your current loan.",
            "Apply with several car loan refinance companies.",
            "Compare offers to your current loan.",
            "Complete the paperwork to refinance your car."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Finance a New Car",
        "steps": [
            "Determine the amount you will need to finance via a vehicle loan.",
            "Compare loan offers from a variety of providers after you calculate the desired loan amount needed to buy the car.",
            "Ask the dealership to match the best loan offer you collected from the competing financial institutions.",
            "Read all loan contract and purchase agreements carefully before signing."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Finance a Car",
        "steps": [
            "Get a loan through a new or used car dealer.",
            "Bring leverage.",
            "Offer a down payment in cash or trade equivalent to at least 10% of the vehicle's purchase price."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Loan a Car to Someone",
        "steps": [
            "Name the parties to the agreement.",
            "Identify your car.",
            "State where the car will be parked.",
            "Come up with a schedule.",
            "Explain when and if someone can take a long trip.",
            "Prohibit certain uses.",
            "Divide costs.",
            "Ask the other driver to indemnify you.",
            "Explain how you will resolve disputes.",
            "Explain how you’ll end the agreement.",
            "Sign and date the agreement."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Use a Turbocharger",
        "steps": [
            "Increase the power output of your engine with a turbocharger.",
            "Check reliability reviews for the model you're buying.",
            "Be aware of possible tire skidding when the turbo boost kicks in."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Buy a Car with Bad Credit",
        "steps": [
            "Check your credit report for mistakes.",
            "Negotiate with creditors to remove negative items from your report.",
            "Reduce credit card debt to below 30% of credit line.",
            "Don’t max out your cards."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Get Out of a Car Loan",
        "steps": [
            "Check your loan agreement for early payoff terms.",
            "Contact your lender for a payoff quote.",
            "Assess your savings and budget.",
            "Pay your lender the payoff amount.",
            "Follow up with your lender to close the account."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Buy a New Car Online",
        "steps": [
            "Apply for a loan if you need help with financing.",
            "Complete the paperwork for the car's title and registration online.",
            "Pick up the car or arrange to have it shipped to you."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Get Your Ex Off a Car Loan",
        "steps": [
            "Estimate the value of your car.",
            "Find a new car.",
            "Get the lender’s permission.",
            "Trade in your old car.",
            "Advertise your car.",
            "Sell your car.",
            "Give your ex part of the proceeds."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Qualify for a Subprime Loan",
        "steps": [
            "Call lenders and ask if they offer subprime loans.",
            "Gather supporting documentation to make your case for a loan approval.",
            "Complete the application and sign any necessary paperwork in order to allow the lender pull your credit.",
            "Prepare to be asked by the lender for additional documentation, explanation and/or proof of your ability to repay the loan."
        ],
        "cluster_label": 1753
    },
    {
        "title": "How to Lend Money to Family",
        "steps": [
            "Determine whether the family member asking for money is responsible enough to return it.",
            "Make sure that you have the money to spare before lending money to family.",
            "Discuss your expectations regarding a family loan before coming to a final decision.",
            "Establish a payment plan that meets the budget of both you and your family member.",
            "Write up a family loan contract with all the details of the loan and make it official by having you both sign it."
        ],
        "cluster_label": 1753
    }
]