[
    {
        "title": "How to Clean Your Belly Button",
        "steps": [
            "Look for signs of infection if regular washing doesn’t work.",
            "See your doctor for a diagnosis if you have infection symptoms.",
            "Use topical medications to treat a bacterial, fungal, or yeast infection.",
            "Ask your doctor to drain a belly button cyst if you have one.",
            "Visit your doctor to get navel stones removed if necessary."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Remove E Coli from Water",
        "steps": [
            "Check your water for debris or discoloration.",
            "Send a sample to a water-testing laboratory.",
            "Watch for the development of E coli symptoms."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Prepare for a Cleanse",
        "steps": [
            "Cut back on dairy products, wheat, and sugar.",
            "Opt for fresh vegetables and fruits.",
            "Replace caffeine and alcohol with water.",
            "Do not make dining out plans.",
            "Buy the ingredients for the juice cleanse."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Use Aromatherapy for Constipation",
        "steps": [
            "Check with your doctor if it’s safe for you to use aromatherapy.",
            "See your doctor if your constipation lasts longer than a week.",
            "Talk to your doctor if your bowel habits significantly change.",
            "Get emergency medical care if you develop severe symptoms."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Take an Internal Bath",
        "steps": [
            "Determine what type of internal bath cleanse best suits your needs.",
            "Gather the necessary materials.",
            "Mix the ingredients of your cleanse.",
            "Fill the enema bag with the cleansing concoction and insert into your colon.",
            "Massage your belly and move gently back and forth from the bent-over position."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Detox Your Colon",
        "steps": [
            "Consider a colonic.",
            "Ask your doctor about the procedure.",
            "Make sure you have at least 1 bowel movement per day."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Go on a Technology Cleanse",
        "steps": [
            "Decide why you want to do a Technology Cleanse.",
            "Decide how long you will do the cleanse.",
            "Decide what technology you will put away during the cleanse.",
            "Inform your family, friends, and contacts.",
            "Tie-up loose ends.",
            "Make a plan.",
            "Now you are ready!."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Make an Enema",
        "steps": [
            "Get your doctor's consent before having an enema.",
            "Ask your doctor to recommend a dose and frequency.",
            "Use a sterile enema kit to prevent infection.",
            "Administer the enema.",
            "Hold the saline enema in for up to 15 minutes.",
            "Expel the enema and stool into the toilet.",
            "Recognize the risks of using enemas at home.",
            "Avoid using home remedies as enemas since these can damage your colon."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Cleanse Your Colon",
        "steps": [
            "Speak to your doctor about colonic irrigation.",
            "Ask your doctor about an enema.",
            "Talk to your doctor about taking medication for your colon."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Cleanse Your Colon for a Colonoscopy",
        "steps": [
            "Prepare to empty your colon.",
            "Drink enough water to prevent dehydration.",
            "Pick up or assemble your prep kit, as advised by your doctor.",
            "Follow special precautions if you are diabetic.",
            "Flush your system on the evening before your colonoscopy.",
            "Make the final preparations on the day of the colonoscopy."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Clean an Uncircumcised Child's Penis",
        "steps": [
            "Explain how to pull the foreskin back before cleansing his penis.",
            "Tell him to gently cleanse under the foreskin with soap and warm water.",
            "Have him rinse off his penis to remove the soap.",
            "Instruct him to dry off the glans with a clean dry towel.",
            "Teach him to return the foreskin to its original position."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Clean a Baby's Belly Button",
        "steps": [
            "Prepare your tub with lukewarm water.",
            "Clean the belly button last.",
            "Dry the area well.",
            "Avoid using other products on newborns."
        ],
        "cluster_label": 131
    },
    {
        "title": "How to Clean Asparagus",
        "steps": [
            "Rinse the asparagus under cold water.",
            "Use a vegetable peeler to peel the asparagus.",
            "Snap off the tough ends.",
            "Use the shaved asparagus in a recipe."
        ],
        "cluster_label": 131
    }
]