[
    {
        "title": "How to Remove Gel Nail Polish",
        "steps": [
            "Wait until the nails are mostly chipped away.",
            "Insert a cuticle stick under the surface of a gel.",
            "Peel off the gel.",
            "Condition your nails."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Remove Press‐On Nails",
        "steps": [
            "Go polish and press-on free for a few days.",
            "Cut your nails short to prevent breakage.",
            "Buff your nails to even out rough spots.",
            "Replenish lost moisture.",
            "Apply a top coat before you use press on nails again."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Dry Gel Nail Polish",
        "steps": [
            "Select a no-light gel nail polish and top coat set.",
            "Apply 2 coats of polish, allowing your nails to air-dry between coats.",
            "Add 1 layer of a clear no-light gel top coat and air-dry it completely."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Use Both Regular and UV Gel Nail Polish Together",
        "steps": [
            "Buff your nails to remove any shine.",
            "Use an alcohol wipe to clean off the dust.",
            "Brush on a layer of gel polish foundation.",
            "Cure the foundation under an LED or UV lamp.",
            "Wipe the surface of each nail with alcohol to remove the tacky layer.",
            "Apply 1 or 2 thin coats of regular nail polish.",
            "Allow the polish to dry completely.",
            "Add a layer of gel topcoat.",
            "Cure the topcoat under the lamp for the recommended time.",
            "Wipe off the tacky layer with an alcohol wipe."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Reuse an Old Bottle of Nail Polish",
        "steps": [
            "Clean the bottle.",
            "Decide which craft items would benefit from being kept in a small storage container.",
            "Reuse the bottle as a glue dispenser.",
            "Keep hobby or modeling paints inside the nail polish bottle."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Apply Nail Polish Strips",
        "steps": [
            "Open the pack carefully and examine what the strips came with.",
            "Remove existing nail polish.",
            "Choose the size that fits your nail the best.",
            "Gently peel the strip off.",
            "Place the strip onto your nail.",
            "Smooth the strip down, while applying a lot of pressure.",
            "Take the file.",
            "Apply a top coat.",
            "Enjoy!."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Open Nail Polish",
        "steps": [
            "Avoid using force to open a stuck bottle.",
            "Don't hit the cap against the counter.",
            "Wrap a rubber band around a cap.",
            "Use nail polish thinner to dissolve hardened polish.",
            "Use hot water to soften stuck nail polish."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Keep Nail Polish from Drying Out",
        "steps": [
            "Add a few drops of lacquer thinner to the bottle.",
            "Shake well to combine.",
            "Alternatively, use clear polish.",
            "Don't use nail polish remover."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Remove Nail Polish from Around the Nails",
        "steps": [
            "Gather your materials.",
            "Paint the glue around your nails.",
            "Let the glue dry.",
            "Paint your nails.",
            "Let your nails dry.",
            "Peel away the glue."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Dry Nail Polish Quickly",
        "steps": [
            "Use quick-drying nail polish products.",
            "Apply a glossy, fast-drying top coat to help your nails dry.",
            "Try using drying drops or setting spray to cut down on time."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Remove Old Nail Polish",
        "steps": [
            "Choose a nail polish you don't like very much.",
            "Paint polish over one of your nails.",
            "Use a paper towel to wipe it off after five seconds.",
            "Repeat with remaining nails."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Remove Nail Polish Without Using Remover",
        "steps": [
            "Make a base coat with glue and water.",
            "Apply and dry the glue base coat before putting on polish.",
            "Apply nail polish.",
            "Soak your nails when you're ready to remove your polish.",
            "Peel off your old nail polish."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Whiten Nails",
        "steps": [
            "Wipe your nails down with nail polish remover for polish stains.",
            "Color your tips white with a whitening nail pencil for a quick fix.",
            "Use a base coat when painting your nails to prevent yellowing.",
            "Choose lighter colors of nail polish instead of darker shades."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Get Nail Polish out of Fabric",
        "steps": [
            "Use hydrogen peroxide.",
            "Try hairspray.",
            "Use bug spray.",
            "Rinse and wash. No matter what method you use, be sure to rinse the previously stained area well to get rid of the traces of the substance you used to remove the nail polish."
        ],
        "cluster_label": 1703
    },
    {
        "title": "How to Get Nail Polish off Just About Any Surface",
        "steps": [
            "Get nail polish off of your floor surface.",
            "Remove the excess nail polish right away.",
            "Use acetone.",
            "Wash the stain with a soft scrub."
        ],
        "cluster_label": 1703
    }
]