[
    {
        "title": "How to Make an Easter Treat Without Sugar",
        "steps": [
            "Focus on fruit.",
            "Use sugar-free chocolate for making chocolate eggs and molded figures.",
            "Use gel or jelly to make Easter treats.",
            "Find sugar-free or sugar-reduced baking recipes for cupcakes, cakes, muffins and cookies.",
            "Make cute things from real eggs.",
            "Make savory treats.",
            "Fill Easter egg containers and Easter baskets with healthy treats."
        ],
        "cluster_label": 2127
    },
    {
        "title": "How to Make Crispy Rice Cereal Easter Eggs",
        "steps": [
            "Coat the inside of the cleaned plastic eggs with non-stick spray.",
            "Melt butter.",
            "Add marshmallows to the butter and melt.",
            "Add crispy rice cereal to the melted butter and marshmallow mixture.",
            "Coat hands with non-stick spray.",
            "Press the cereal mix inside and around the walls of the plastic eggs.",
            "Set eggs aside to cool.",
            "Remove the crispy rice eggs from the shell and set aside.",
            "Fill half of the egg-halves with candy.",
            "Close the eggs up.",
            "Decorate with frosting.",
            "Finished!."
        ],
        "cluster_label": 2127
    },
    {
        "title": "How to Make Decorated Chocolate Easter Eggs",
        "steps": [
            "Melt enough white chocolate to fill one plastic egg.",
            "Melt a few coloured wafers (any colour you want, or rainbow) and drizzle into both parts of the plastic egg.",
            "Once both are swirled, make sure they are both completely full, and as quick as you can shut the egg.",
            "Now, place your egg into ice water to cool.",
            "After waiting for the egg to cool, (about 15 minutes in ice water, longer without ice water), Open the eggs.",
            "Now, melt a bit more of the coloured wafers (any colour, preferably matching the egg's swirls).",
            "Now your eggs are ready for Easter!."
        ],
        "cluster_label": 2127
    },
    {
        "title": "How to Make a Robin's Nest With Eggs",
        "steps": [
            "Assemble the supplies needed.",
            "Make the salt dough if you haven't already.",
            "Push the brown or yellow salt dough through the garlic press to create \"worms\".",
            "Using the salt dough \"worms\", shape a small, rounded nest.",
            "Create the eggs.",
            "Wet one side of each egg with a dab or brush of water.",
            "Leave to dry."
        ],
        "cluster_label": 2127
    },
    {
        "title": "How to Make Jelly Bean Easter Nests",
        "steps": [
            "Prepare the muffin pan before beginning, so that you can use it straight away.",
            "Place the marshmallows and butter or margarine into the saucepan.",
            "Add the chow-mein noodles to the melted mixture.",
            "Remove from the heat.",
            "Place the muffin pan into the refrigerator to chill the nests.",
            "Add a few jellybeans into each nest.",
            "Finished."
        ],
        "cluster_label": 2127
    },
    {
        "title": "How to Make Sugar Easter Eggs",
        "steps": [
            "Assemble the ingredients as outlined above in the \"sugar method\" ingredients section above.",
            "Mix the sugar and the water in a large bowl.",
            "Prepare the egg molds.",
            "Press the sugar mixture into the egg molds.",
            "Flatten the edge tops of the egg halves while they're sitting in the mold.",
            "Join the eggs together and decorate them as outlined in one of the previous methods."
        ],
        "cluster_label": 2127
    },
    {
        "title": "How to Make Miniature Sugar Eggs",
        "steps": [
            "Pour the caster (superfine) sugar into a mixing bowl.",
            "Add the water gradually.",
            "Use a spoon to place the wet sugar into the miniature egg moulds.",
            "Put the egg mould sheet in a dry, cool place.",
            "Remove the egg halves.",
            "Use the white royal icing to stick the two halves together.",
            "Decorate the eggs.",
            "Use as needed."
        ],
        "cluster_label": 2127
    },
    {
        "title": "How to Make Spun Sugar Cobwebs",
        "steps": [
            "Hold the saucepan in one hand.",
            "Dip the fork into the syrup.",
            "Quickly fling threads of sugar across the bottom of the bowl.",
            "Remove the sugar spun cobweb from the bowl.",
            "Decorate your baked goods with the sugar spun cobwebs."
        ],
        "cluster_label": 2127
    },
    {
        "title": "How to Sugar Flowers",
        "steps": [
            "Choose thin-petaled, edible flowers.",
            "Prepare the flowers.",
            "Prepare the egg white glaze.",
            "Brush a thin layer of egg white on each flower.",
            "Sprinkle superfine sugar over each flower.",
            "Let dry overnight.",
            "Store the flowers.",
            "Decorate cakes or centerpieces."
        ],
        "cluster_label": 2127
    },
    {
        "title": "How to Make an Egg Shaker",
        "steps": [
            "Decide what kind of shaker you want to make.",
            "Gather your materials.",
            "Open your plastic Easter egg so the two pieces are completely separated.",
            "Fill the bottom half of the egg almost up the rim.",
            "Glue the two pieces together.",
            "Wipe away the excess glue."
        ],
        "cluster_label": 2127
    }
]