[
    "Based on the task \"hunt_animal_for_food\" and the descriptions provided, I will generate PDDL actions that align with the intent and logic of the task. The steps and descriptions will guide the creation of the actions, ensuring they reflect the necessary preconditions and effects.\n\n### PDDL Actions\n\n#### Action 1: Heat Water\n```lisp\n(:action heat_water\n    :parameters (?water - resource ?fire - heat_source ?location - place)\n    :precondition (and\n      (at ?water ?location)\n      (at ?fire ?location)\n      (not (heated ?water))\n    )\n    :effect (and\n      (heated ?water)\n      (above_temperature ?water 185)\n    )\n)\n```\n\n#### Action 2: Hunt for Food\n```lisp\n(:action hunt_for_food\n    :parameters (?hunter - person ?location - place ?food - animal)\n    :precondition (and\n      (at ?hunter ?location)\n      (not (captured ?food))\n    )\n    :effect (and\n      (captured ?food)\n      (has ?hunter ?food)\n    )\n)\n```\n\n#### Action 3: Test Food for Poison\n```lisp\n(:action test_food_for_poison\n    :parameters (?food - item ?person - tester)\n    :precondition (and\n      (has ?person ?food)\n      (not (tested ?food))\n    )\n    :effect (and\n      (tested ?food)\n      (if (poisonous ?food) (alert ?person))\n    )\n)\n```\n\n### Explanation\n\n1. **Heat Water**: This action involves heating water to a specific temperature to ensure it is safe for consumption. The precondition checks if the water and heat source are at the same location and if the water is not yet heated. The effect marks the water as heated and above the required temperature.\n\n2. **Hunt for Food**: This action allows a person to hunt for food at a specific location. The precondition ensures the hunter is at the location and the food is not yet captured. The effect indicates the food is captured and now possessed by the hunter.\n\n3. **Test Food for Poison**: This action involves testing food for poison by a person. The precondition checks if the person has the food and if it is not yet tested. The effect marks the food as tested and alerts the person if the food is poisonous.\n\nThese actions are crafted to align with the task of hunting for food, ensuring that each step is relevant and logically structured based on the descriptions provided."
]