{
    "knit": [
        "(:action knit_flat_web\n      :parameters (?p - player ?loc - location ?web - web)\n      :precondition (and (at ?p ?loc) (not (knit ?web)))\n      :effect (and (knit ?web) (length ?web 84))\n   )\n   ```\n\n2. **Step 2: Begin five inches from the end of the web, turn and sew into a rectangular form five inches wide and eight inches long.**\n\n   ```pddl\n   ",
        "(:action sew_rectangular_form\n      :parameters (?p - player ?web - web)\n      :precondition (and (knit ?web) (length ?web 84) (not (sewn ?web)))\n      :effect (and (sewn ?web) (shape ?web rectangular) (dimensions ?web 5 8))\n   )\n   ```\n\n3. **Step 3: Join the five-inch ends, and draw in the top with the needle and a piece of the material from which the cap was made.**\n\n   ```pddl\n   "
    ],
    "join": [
        "(:action join_ends_draw_top\n      :parameters (?p - player ?web - web ?needle - needle ?material - material)\n      :precondition (and (sewn ?web) (shape ?web rectangular) (dimensions ?web 5 8) (inventory ?p ?needle) (inventory ?p ?material))\n      :effect (and (joined ?web) (top_drawn ?web))\n   )\n   ```\n\n4. **Step 4: After securing the top, twist and fold the piece of yarn remaining for a cord and fasten a number of strands of yarn through the loop for a tassel.**\n\n   ```pddl\n   "
    ],
    "secure": [
        "(:action secure_top_and_add_tassel\n      :parameters (?p - player ?web - web ?yarn - yarn)\n      :precondition (and (joined ?web) (top_drawn ?web) (inventory ?p ?yarn))\n      :effect (and (secured_top ?web) (has_tassel ?web))\n   )\n   ```\n\n### Explanation\n\n- **knit_flat_web**: This action represents the initial knitting of the web to a specified length. The precondition checks if the web is not yet knit, and the effect ensures the web is marked as knit with the correct length.\n- **sew_rectangular_form**: This action involves sewing the web into a rectangular shape. Preconditions ensure the web is knit and not yet sewn, and effects set the shape and dimensions.\n- **join_ends_draw_top**: This action joins the ends of the web and draws in the top, using a needle and material. Preconditions ensure the web is sewn and the player has necessary tools, while effects indicate the web is joined and the top is drawn.\n- **secure_top_and_add_tassel**: This action secures the top of the hat and adds a tassel. Preconditions ensure the top is drawn and the player has yarn, with effects marking the top as secured and the tassel added.\n\nThese actions follow the guidelines provided and ensure a logical progression through the task of spool knitting a winter hat."
    ]
}